{
    "intents": [
        {
            "patterns": [
                "What are the requirements for admission as an incoming first-year college student?",
                "What documents do I need to submit for admission as an incoming first-year college student?",
                "What requirements do I need to apply for admission as an incoming first-year college student?",
                "What documents should I prepare to apply for admission as an incoming first-year college student?",
                "What are the required documents for the admission process for incoming first-year college students?"
            ],
            "responses": [
                "To apply for admission as an incoming first-year college student at BatStateU ARASOF-Nasugbu, you will need to provide the following requirements:\n\n1. One (1) copy of Grades Form 1 (for Regular Admission) / Grades Form 2 (for ALS)\n2. One (1) certified true copy of Junior High School and Senior High School Form 137\n3. Certification of completion of SHS and respective strand or enrollment therein, if not completed (1 photocopy)\n4. Two (2) copies of recent 2” x 2” pictures with a white background\n5. Form 138 (if the student is a graduate of SHS) – 1 Original\n6. Admission Test Permit – 1 Original\n\nAdditional Requirements for Admission under AAP:\n\nIndigent Applicants:\n  1. Certificate of Indigency of Parent/Guardian\n  2. Certificate of Tax Exemption\n\nAlternative Learning System (ALS):\n  1. Certification of completion of ALS program or enrollment\n\nIndigenous People:\n  1. Certificate of Tribe Membership or equivalent certification\n\nPWD:\n  1. PWD Identification card\n\nIskolar ng Bayan:\n  1. Certification from the public high school, signed by the school principal, confirming the applicant's rank in the Top Ten of the graduating (Grade 12) class"
            ]
        },
        {
            "patterns": [
                "Where can I get Grades Form 1 for admission as an incoming first-year student?",
                "Where can I request Grades Form 1 for admission as an incoming first-year student?",
                "Where can I obtain Grades Form 1 for admission as an incoming first-year student?"
            ],
            "responses": [
                "You can get Grades Form 1 from the College Admission portal at https://dione.batstate-u.edu.ph/tao/#/application."
            ]
        },
        {
            "patterns": [
                "Where can I get Grades Form 2 for admission as an incoming first-year student?",
                "Where can I request Grades Form 2 for admission as an incoming first-year student?",
                "Where can I obtain Grades Form 2 for admission as an incoming first-year student?"
            ],
            "responses": [
                "You can get Grades Form 2 from the College Admission portal at https://dione.batstate-u.edu.ph/tao/#/application."
            ]
        },
        {
            "patterns": [
                "Where can I get the Form 137 for admission as an incoming first-year student?",
                "Where can I request the Form 137 for admission as an incoming first-year student?",
                "Where can I obtain the Form 137 for admission as an incoming first-year student?"
            ],
            "responses": [
                "You can obtain the certified true copy of Form 137 from your current or previous school."
            ]
        },
        {
            "patterns": [
                "Where can I get a certification of SHS completion or enrollment for admission as an incoming first-year student?",
                "Where can I request a certification of SHS completion or enrollment for admission as an incoming first-year student?",
                "Where can I obtain a certification of SHS completion or enrollment for admission as an incoming first-year student?"
            ],
            "responses": [
                "You can obtain the certification of SHS completion or enrollment from your current or previous school."
            ]
        },
        {
            "patterns": [
                "Where can I get Form 138 for admission as an incoming first-year student?",
                "Where can I request Form 138 for admission as an incoming first-year student?",
                "Where can I obtain Form 138 for admission as an incoming first-year student?"
            ],
            "responses": [
                "You can obtain Form 138 from your senior high school."
            ]
        },
        {
            "patterns": [
                "Where can I get the admission test permit for admission as an incoming first-year student?",
                "Where can I request the admission test permit for admission as an incoming first-year student?",
                "Where can I obtain the admission test permit for admission as an incoming first-year student?"
            ],
            "responses": [
                "You can obtain the admission test permit from the College Applicant’s Portal."
            ]
        },
        {
            "patterns": [
                "Where can I get a certificate of indigency for admission as an incoming first-year student?",
                "Where can I request a certificate of indigency for admission as an incoming first-year student?",
                "Where can I obtain a certificate of indigency for admission as an incoming first-year student?"
            ],
            "responses": [
                "You can obtain the certificate of indigency from the Office of the Barangay."
            ]
        },
        {
            "patterns": [
                "Where can I get a certificate of tax exemption for admission as an incoming first-year student?",
                "Where can I request a certificate of tax exemption for admission as an incoming first-year student?",
                "Where can I obtain a certificate of tax exemption for admission as an incoming first-year student?"
            ],
            "responses": [
                "You can obtain the certificate of tax exemption from the Bureau of Internal Revenue (BIR)."
            ]
        },
        {
            "patterns": [
                "Where can I get a certification of ALS program completion or enrollment for admission as an incoming first-year student?",
                "Where can I request a certification of ALS program completion or enrollment for admission as an incoming first-year student?",
                "Where can I obtain a certification of ALS program completion or enrollment for admission as an incoming first-year student?"
            ],
            "responses": [
                "You can obtain the certification of ALS program completion or enrollment from the ALS graduates' current or previous school."
            ]
        },
        {
            "patterns": [
                "Where can I get a certificate of tribe membership for admission as an incoming first-year student?",
                "Where can I request a certificate of tribe membership for admission as an incoming first-year student?",
                "Where can I obtain a certificate of tribe membership for admission as an incoming first-year student?"
            ],
            "responses": [
                "You can obtain the certificate of tribe membership from the National Commission on Indigenous People."
            ]
        },
        {
            "patterns": [
                "Where can I get a PWD identification card for admission as an incoming first-year student?",
                "Where can I request a PWD identification card for admission as an incoming first-year student?",
                "Where can I obtain a PWD identification card for admission as an incoming first-year student?"
            ],
            "responses": [
                "You can obtain the PWD identification card from the Persons with Disability Affairs Office (PDAO)."
            ]
        },
        {
            "patterns": [
                "Where can I get a certification confirming my rank in the Top Ten of my graduating class for admission as an incoming first-year student?",
                "Where can I request a certification confirming my rank in the Top Ten of my graduating class for admission as an incoming first-year student?",
                "Where can I obtain a certification confirming my rank in the Top Ten of my graduating class for admission as an incoming first-year student?"
            ],
            "responses": [
                "You can obtain the certification confirming your rank in the Top Ten of your graduating class from your public senior high school, signed by the school principal."
            ]
        },
        {
            "patterns": [
                "How do I apply for admission as an incoming first-year student?",
                "What are the steps for admission as an incoming first-year student?",
                "What is the admission process for incoming first-year students?",
                "How do I complete my admission as an incoming first-year student?",
                "What is the process for admission as an incoming first-year student?"
            ],
            "responses": [
                "To complete your admission as an incoming first-year student, please follow these steps:\n\n1. Fill out the application form and upload the scanned copy of documentary requirements at https://dione.batstate-u.edu.ph/tao/#/application.\n2. Check the college application portal for the schedule of examination.\n3. Take the Admission Test.\n4. Wait for the examination results."
            ]
        },
        {
            "patterns": [
                "How long is the admission process for incoming first-year students?",
                "What is the duration of the admission process for incoming first-year students?",
                "How long does the entire admission process take for incoming first-year students?",
                "How long will it take to complete all the steps for admission as an incoming first-year student?",
                "What is the duration of the entire admission process for incoming first-year students?"
            ],
            "responses": [
                "The admission process for incoming first-year students at BatStateU ARASOF-Nasugbu typically takes about 2 months, 3 weeks, 5 days, 4 hours, 30 minutes to complete."
            ]
        },
        {
            "patterns": [
                "How long does the admission test take for incoming first-year students?",
                "What is the duration of the admission test for incoming first-year students?",
                "How long is the admission test for incoming first-year students?",
                "How much time do I need for the admission test as an incoming first-year student?",
                "What is the time allotted for the admission test for incoming first-year students?"
            ],
            "responses": [
                "The admission test for incoming first-year students at BatStateU ARASOF-Nasugbu typically takes about 2 hours to complete."
            ]
        },
        {
            "patterns": [
                "Is there a fee for the admission process for incoming first-year students?",
                "How much does the admission process cost for incoming first-year students?",
                "What are the fees for the entire admission process for incoming first-year students?",
                "Are there any fees I need to pay during the admission process for incoming first-year students?",
                "How much is the total cost associated with applying for admission as an incoming first-year student?"
            ],
            "responses": [
                "There are no fees associated with the admission process for incoming first-year students. The entire admission process is free of charge."
            ]
        },
        {
            "patterns": [
                "When is the admission test for incoming first-year students?",
                "When is the admission test for college transferees?"
            ],
            "responses": [
                "For the admission test schedule, please check the official pages of the Testing and Admission Office or contact them directly for the most up-to-date information. You can reach the Testing and Admission Office at:\n\nTelephone: +63 43 416-0350 local 216\nEmail: tao.nasugbu@g.batstate-u.edu.ph\nOfficial Facebook Page: https://fb.com/TestingAndAdmissionOffice"
            ]
        },
        {
            "patterns": [
                "When is the release of the admission test results for incoming first-year students?",
                "When is the release of the admission test results for college transferees ?"
            ],
            "responses": [
                "The release date for admission test results will be announced on the official pages of the Testing and Admission Office. For the latest updates, you can contact them directly:\n\nTelephone: +63 43 416-0350 local 216\nEmail: tao.nasugbu@g.batstate-u.edu.ph\nOfficial Facebook Page: https://fb.com/TestingAndAdmissionOffice"
            ]
        },
        {
            "patterns": [
                "When is the admission period for incoming first-year students?"
            ],
            "responses": [
                "For the admission period for incoming first-year students, please refer to the official announcements from the Testing and Admission Office or contact them directly for the most up-to-date information. You can reach the Testing and Admission Office at:\n\nTelephone: +63 43 416-0350 local 216\nEmail: tao.nasugbu@g.batstate-u.edu.ph\nOfficial Facebook Page: https://fb.com/TestingAndAdmissionOffice"
            ]
        },
        {
            "patterns": [
                "When is the deadline for admission for incoming first-year students?"
            ],
            "responses": [
                "For the deadline of admission for incoming first-year students, please refer to the official announcements from the Testing and Admission Office or contact them directly for the most up-to-date information. You can reach the Testing and Admission Office at:\n\nTelephone: +63 43 416-0350 local 216\nEmail: tao.nasugbu@g.batstate-u.edu.ph\nOfficial Facebook Page: https://fb.com/TestingAndAdmissionOffice"
            ]
        },
        {
            "patterns": [
                "Who can I contact for inquiries about the admission process for incoming first-year students?",
                "Who should I reach out to about the admission process for incoming first-year students?",
                "Who do I reach out to for questions about the admission process for incoming first-year students?",
                "How can I contact the Testing and Admission Office for questions regarding the admission process for incoming first-year students?",
                "What is the contact information of the Testing and Admission Office for inquiries related to the admission process for incoming first-year students?"
            ],
            "responses": [
                "For inquiries about the admission process for incoming first-year students, you can contact the Testing and Admission Office. Here are the details:\n\nTelephone: 416-0350 local 216\nEmail: tao.nasugbu@g.batstate-u.edu.ph\nOfficial Facebook Page: https://fb.com/TestingAndAdmissionOffice\n\nPlease feel free to reach out for any questions or assistance regarding the admission process."
            ]
        },
        {
            "patterns": [
                "What are the requirements for admission as a college transferee?",
                "What documents do I need to submit for admission as a college transferee?",
                "What requirements do I need to apply for admission as a college transferee?",
                "What documents should I prepare to apply for admission as a college transferee?",
                "What are the required documents for the admission process for college transferees?"
            ],
            "responses": [
                "To apply for admission as a college transferee at BatStateU ARASOF-Nasugbu, you will need to provide the following requirements:\n\n1. One (1) copy of the Filled-out Application Form (BatStateU-FO-REG-12)\n2. One (1) copy of the Endorsement Letter"
            ]
        },
        {
            "patterns": [
                "Where can I get the BatStateU-FO-REG-12 application form for admission as a college transferee?",
                "Where can I request the BatStateU-FO-REG-12 application form for admission as a college transferee?",
                "Where can I obtain the BatStateU-FO-REG-12 application form for admission as a college transferee?"
            ],
            "responses": [
                "You can obtain the BatStateU-FO-REG-12 application form at the Testing and Admission Office, Registration Services Office, or your college."
            ]
        },
        {
            "patterns": [
                "Where can I get the endorsement letter required for admission as a college transferee?",
                "Where can I request the endorsement letter for admission as a college transferee?",
                "Where can I obtain the endorsement letter for admission as a college transferee?"
            ],
            "responses": [
                "You can obtain the endorsement letter from your college."
            ]
        },
        {
            "patterns": [
                "How do I apply for admission as a college transferee?",
                "What are the steps for admission as a college transferee?",
                "What is the admission process for college transferees?",
                "How do I complete my admission as a college transferee?",
                "What is the process for admission as a college transferee?"
            ],
            "responses": [
                "To complete your admission as an college transferee, please follow these steps:\n\n1. Submit the filled-out application form and TOR to the concerned college.\n2. Proceed to TAO and present the evaluated application documents and Endorsement Letter.\n3. Secure admission test permit\n4. Take the BatStateUCAT on the scheduled date\n5. Receive admission result."
            ]
        },
        {
            "patterns": [
                "How long is the admission process for college transferees?",
                "What is the duration of the admission process for college transferees?",
                "How long does the entire admission process take for college transferees?",
                "How long will it take to complete all the steps for admission as a college transferee?",
                "What is the duration of the entire admission process for college transferees?"
            ],
            "responses": [
                "The admission process for college transferees at BatStateU ARASOF-Nasugbu typically takes about 1 day, 3 hours, and 7 minutes to complete."
            ]
        },
        {
            "patterns": [
                "How long does the admission test take for college transferees?",
                "What is the duration of the admission test for college transferees?",
                "How long is the admission test for college transferees?",
                "How much time do I need for the admission test as a college transferee?",
                "What is the time allotted for the admission test for college transferees?"
            ],
            "responses": [
                "The admission test for college transferees at BatStateU ARASOF-Nasugbu typically takes about 2 hours to complete."
            ]
        },
        {
            "patterns": [
                "Is there a fee for the admission process for college transferees?",
                "How much does the admission process cost for college transferees?",
                "What are the fees for the entire admission process for college transferees?",
                "Are there any fees I need to pay during the admission process for college transferees?",
                "How much is the total cost associated with applying for admission as a college transferee?"
            ],
            "responses": [
                "There are no fees associated with the admission process for college transferees. The entire admission process is free of charge."
            ]
        },
        {
            "patterns": [
                "When is the admission period for college transferees ?",
                "When is the admission period for foreign applicants?",
                "When is the admission period for applicants to the Laboratory School?",
                "When is the admission period for Kindergarten applicants to the Laboratory School?",
                "When is the admission period for Elementary applicants to the Laboratory School?",
                "When is the admission period for Grade 7 applicants to the Laboratory School?"
            ],
            "responses": [
                "For the admission period, please refer to the official announcements from the Testing and Admission Office or contact them directly for the most up-to-date information. You can reach the Testing and Admission Office at:\n\nTelephone: +63 43 416-0350 local 216\nEmail: tao.nasugbu@g.batstate-u.edu.ph\nOfficial Facebook Page: https://fb.com/TestingAndAdmissionOffice"
            ]
        },
        {
            "patterns": [
                "When is the deadline for admission for college transferees ?",
                "When is the deadline for admission for foreign applicants?",
                "When is the deadline for admission to the Laboratory School?",
                "When is the deadline for Kindergarten admission to the Laboratory School?",
                "When is the deadline for Elementary admission to the Laboratory School?",
                "When is the deadline for Grade 7 admission to the Laboratory School?"
            ],
            "responses": [
                "For the deadline of admission, please refer to the official announcements from the Testing and Admission Office or contact them directly for the most up-to-date information. You can reach the Testing and Admission Office at:\n\nTelephone: +63 43 416-0350 local 216\nEmail: tao.nasugbu@g.batstate-u.edu.ph\nOfficial Facebook Page: https://fb.com/TestingAndAdmissionOffice"
            ]
        },
        {
            "patterns": [
                "Who can I contact for inquiries about the admission process for college transferees ?",
                "Who should I reach out to about the admission process for college transferees ?",
                "Who do I reach out to for questions about the admission process for college transferees ?",
                "How can I contact the Testing and Admission Office for questions regarding the admission process for college transferees ?",
                "What is the contact information of the Testing and Admission Office for inquiries related to the admission process for college transferees ?"
            ],
            "responses": [
                "For inquiries about the admission process for college transferees, you can contact the Testing and Admission Office. Here are the details:\n\nTelephone: 416-0350 local 216\nEmail: tao.nasugbu@g.batstate-u.edu.ph\nOfficial Facebook Page: https://fb.com/TestingAndAdmissionOffice\n\nPlease feel free to reach out for any questions or assistance regarding the admission process."
            ]
        },
        {
            "patterns": [
                "What are the requirements for admission as a foreign applicant?",
                "What documents do I need to submit for admission as a foreign applicant?",
                "What requirements do I need to apply for admission as a foreign applicant?",
                "What documents should I prepare to apply for admission as a foreign applicant?",
                "What are the required documents for the admission process for foreign applicant?"
            ],
            "responses": [
                "To apply for admission as a foreign applicant at BatStateU ARASOF-Nasugbu, you will need to provide the following requirements:\n\n1. One (1) copy of Application Form BatStateU-FO-EAO-01 \n2. One (1) copy of the Endorsement Letter"
            ]
        },
        {
            "patterns": [
                "Where can I get the BatStateU-FO-EAO-01 application form for admission as a foreign applicant?",
                "Where can I request theBatStateU-FO-EAO-01 application form for admission as a foreign applicant?",
                "Where can I obtain the BatStateU-FO-EAO-01 application form for admission as a foreign applicant?"
            ],
            "responses": [
                "You can obtain the BatStateU-FO-EAO-01 application form at the Testing and Admission Office, or the university website."
            ]
        },
        {
            "patterns": [
                "Where can I get the endorsement letter required for admission as a foreign applicant?",
                "Where can I request the endorsement letter for admission as a foreign applicant?",
                "Where can I obtain the endorsement letter for admission as a foreign applicant?"
            ],
            "responses": [
                "You can obtain the endorsement letter from the External Affairs Office."
            ]
        },
        {
            "patterns": [
                "How do I apply for admission as a foreign applicant?",
                "What are the steps for admission as a foreign applicant?",
                "What is the admission process for foreign applicant?",
                "How do I complete my admission as a foreign applicant?",
                "What is the process for admission as a foreign applicant?"
            ],
            "responses": [
                "To complete your admission as an foreign applicant, please follow these steps:\n\n1. Submit the application form and other requirements.\n2. Submit the evaluated application form and Endorsement Letter to Testing and Admission Office.\n3. Secure Notice of Admission"
            ]
        },
        {
            "patterns": [
                "How long is the admission process for foreign applicants?",
                "What is the duration of the admission process for foreign applicants?",
                "How long does the entire admission process take for foreign applicants?",
                "How long will it take to complete all the steps for admission as a foreign applicant?",
                "What is the duration of the entire admission process for foreign applicants?"
            ],
            "responses": [
                "The admission process for foreign applicants at BatStateU ARASOF-Nasugbu typically takes about 7 days to complete."
            ]
        },
        {
            "patterns": [
                "Is there a fee for the admission process for foreign applicants?",
                "How much does the admission process cost for foreign applicants?",
                "What are the fees for the entire admission process for foreign applicants?",
                "Are there any fees I need to pay during the admission process for foreign applicants?",
                "How much is the total cost associated with applying for admission as a foreign applicant?"
            ],
            "responses": [
                "There are no fees associated with the admission process for foreign applicants. The entire admission process is free of charge."
            ]
        },
        {
            "patterns": [
                "Who can I contact for inquiries about the admission process for foreign applicants?",
                "Who should I reach out to about the admission process for foreign applicants?",
                "Who do I reach out to for questions about the admission process for foreign applicants?",
                "How can I contact the Testing and Admission Office for questions regarding the admission process for foreign applicants?",
                "What is the contact information of the Testing and Admission Office for inquiries related to the admission process for foreign applicants?"
            ],
            "responses": [
                "For inquiries about the admission process for foreign applicants, you can contact the Testing and Admission Office. Here are the details:\n\nTelephone: 416-0350 local 216\nEmail: tao.nasugbu@g.batstate-u.edu.ph\nOfficial Facebook Page: https://fb.com/TestingAndAdmissionOffice\n\nPlease feel free to reach out for any questions or assistance regarding the admission process."
            ]
        },
        {
            "patterns": [
                "What are the requirements for admission to the Laboratory School ?",
                "What documents do I need to submit for admission to the Laboratory School?",
                "What requirements do I need to apply for admission to the Laboratory School?",
                "What documents should I prepare to apply for admission to the Laboratory School?",
                "What are the required documents for the admission process to the Laboratory School?"
            ],
            "responses": [
                "To apply for admission to the Laboratory School at BatStateU ARASOF-Nasugbu, you will need to provide the following requirements:\n\n1. One (1) copy of Filled Out Application Form (BatStateU-FO-TAO-01-A_Application-Form-for-Integrated-School-and-Laboratory-SchoolAdmission) \n2. Admission Test Permit.\n3. 2 recent 2” x 2” pictures of good quality, white background \n4. Birth Certificate - 1 Original, 1 Photocopy (For Kindergarten Applicants)\n5. Previous report card based on current grade level (For Grade 7 applicants) (Original and 1 Photocopy)\n6. One (1) copy of Official Receipt\n\n"
            ]
        },
        {
            "patterns": [
                "What are the requirements for admission as a Kindergarten applicant?",
                "What documents do I need to submit for admission as a Kindergarten applicant?",
                "What requirements do I need to apply for admission as a Kindergarten applicant?",
                "What documents should I prepare to apply for admission as a Kindergarten applicant?",
                "What are the required documents for the admission process for Kindergarten applicants?"
            ],
            "responses": [
                "To apply for admission as a Kindergarten applicant at BatStateU ARASOF-Nasugbu, you will need to provide the following requirements:\n\n1. One (1) copy of Filled Out Application Form (BatStateU-FO-TAO-01-A_Application-Form-for-Integrated-School-and-Laboratory-SchoolAdmission) \n2. Admission Test Permit.\n3. 2 recent 2” x 2” pictures of good quality, white background \n4. Birth Certificate - 1 Original, 1 Photocopy\n5. One (1) copy of Official Receipt"
            ]
        },
        {
            "patterns": [
                "What are the requirements for admission as an Elementary applicant?",
                "What documents do I need to submit for admission as an Elementary applicant?",
                "What requirements do I need to apply for admission as an Elementary applicant?",
                "What documents should I prepare to apply for admission as an Elementary applicant?",
                "What are the required documents for the admission process for Elementary applicants?"
            ],
            "responses": [
                "To apply for admission as a Elementary applicant at BatStateU ARASOF-Nasugbu, you will need to provide the following requirements:\n\n1. One (1) copy of Filled Out Application Form (BatStateU-FO-TAO-01-A_Application-Form-for-Integrated-School-and-Laboratory-SchoolAdmission) \n2. Admission Test Permit.\n3. 2 recent 2” x 2” pictures of good quality, white background \n4. Previous report card based on current grade level (Original and 1 Photocopy)\n5. One (1) copy of Official Receipt"
            ]
        },
        {
            "patterns": [
                "What are the requirements for admission as a Grade 7 applicant?",
                "What documents do I need to submit for admission as a Grade 7 applicant?",
                "What requirements do I need to apply for admission as a Grade 7 applicant?",
                "What documents should I prepare to apply for admission as a Grade 7 applicant?",
                "What are the required documents for the admission process for Grade 7 applicants?"
            ],
            "responses": [
                "To apply for admission as a Grade 7 applicant at BatStateU ARASOF-Nasugbu, you will need to provide the following requirements:\n\n1. One (1) copy of Filled Out Application Form (BatStateU-FO-TAO-01-A_Application-Form-for-Integrated-School-and-Laboratory-SchoolAdmission) \n2. Admission Test Permit.\n3. 2 recent 2” x 2” pictures of good quality, white background \n4. Previous report card based on current grade level (Original and 1 Photocopy)\n5. One (1) copy of Official Receipt"
            ]
        },
        {
            "patterns": [
                "Who is eligible to apply for the Laboratory School?",
                "Who can apply for Laboratory School?"
            ],
            "responses": [
                "Applicants eligible for the Laboratory School at BatStateU ARASOF-Nasugbu include:\n\n1. Kindergarten applicants who are at least 5 years old.\n2. Incoming Grade 1 applicants.\n3. Grade 2 to Grade 6 transferee applicants.\n4. Incoming Grade 7 applicants."
            ]
        },
        {
            "patterns": [
                "Who is eligible to apply for Kindergarten?",
                "Who can apply for Kindergarten?"
            ],
            "responses": [
                "Applicants eligible for Kindergarten must be at least 5 years old."
            ]
        },
        {
            "patterns": [
                "Who is eligible to apply for Elementary?",
                "Who can apply for Elementary?"
            ],
            "responses": [
                "Applicants eligible for Elementary include:\n\n1. Incoming Grade 1 students.\n2. Transferee students from Grade 2 to Grade 6."
            ]
        },
        {
            "patterns": [
                "Who is eligible to apply for Grade 7?",
                "Who can apply for Grade 7?"
            ],
            "responses": [
                "Incoming Grade 7 applicants are eligible to apply for the Laboratory School."
            ]
        },
        {
            "patterns": [
                "Where can I get the Application Form for admission to the Laboratory School?",
                "Where can I request the Application Form for admission to the Laboratory School?",
                "Where can I obtain the Application Form for admission to the Laboratory School?"
            ],
            "responses": [
                "You can obtain the BatStateU-FO-TAO-01-A application form at the Testing and Admission Office."
            ]
        },
        {
            "patterns": [
                "Where can I get the Admission Test Permit for the Laboratory School?",
                "Where can I request the Admission Test Permit for the Laboratory School?",
                "Where can I obtain the Admission Test Permit for the Laboratory School?"
            ],
            "responses": [
                "You can obtain the Admission Test Permit at the Testing and Admission Office."
            ]
        },
        {
            "patterns": [
                "Where can I get the Birth Certificate required for admission to the Laboratory School?",
                "Where can I request the Birth Certificate for admission to the Laboratory School?",
                "Where can I obtain the Birth Certificate for admission to the Laboratory School?"
            ],
            "responses": [
                "You can obtain the Birth Certificate from the Philippine Statistics Authority."
            ]
        },
        {
            "patterns": [
                "Where can I get the previous report card required for admission to the Laboratory School?",
                "Where can I request the previous report card for admission to the Laboratory School?",
                "Where can I obtain the previous report card for admission to the Laboratory School?"
            ],
            "responses": [
                "You can obtain the previous report card based on the current grade level from the Registration Services Office at your current school."
            ]
        },
        {
            "patterns": [
                "Where can I get the Official Receipt for admission to the Laboratory School?",
                "Where can I request the Official Receipt for admission to the Laboratory School?",
                "Where can I obtain the Official Receipt for admission to the Laboratory School?"
            ],
            "responses": [
                "You can obtain the Official Receipt from the Cashiering Office."
            ]
        },
        {
            "patterns": [
                "How do I apply for admission to the Laboratory School?",
                "What are the steps for admission to the Laboratory School?",
                "What is the admission process for the Laboratory School?",
                "How do I complete my admission to the Laboratory School?",
                "What is the process for admission to the Laboratory School?"
            ],
            "responses": [
                "To complete your admission to the Laboratory School, please follow these steps:\n\n1. Submit the filled-out application form and other documentary requirements.\n2. Pay the testing fee\n3. Secure an Admission Test Permit "
            ]
        },
        {
            "patterns": [
                "How do I apply for admission to Kindergarten?",
                "What are the steps for admission to Kindergarten?",
                "What is the admission process for Kindergarten?",
                "How do I complete my admission to Kindergarten?",
                "What is the process for admission to Kindergarten?"
            ],
            "responses": [
                "To complete your admission to Kindergarten at the Laboratory School, please follow these steps:\n\n1. Submit the filled-out application form and other documentary requirements.\n2. Pay the testing fee\n3. Secure an Admission Test Permit "
            ]
        },
        {
            "patterns": [
                "How do I apply for admission to Elementary?",
                "What are the steps for admission to Elementary?",
                "What is the admission process for Elementary?",
                "How do I complete my admission to Elementary?",
                "What is the process for admission to Elementary?"
            ],
            "responses": [
                "To complete your admission to Elementary at the Laboratory School, please follow these steps:\n\n1. Submit the filled-out application form and other documentary requirements.\n2. Pay the testing fee\n3. Secure an Admission Test Permit "
            ]
        },
        {
            "patterns": [
                "How do I apply for admission to Grade 7?",
                "What are the steps for admission to Grade 7?",
                "What is the admission process for Grade 7?",
                "How do I complete my admission to Grade 7?",
                "What is the process for admission to Grade 7?"
            ],
            "responses": [
                "To complete your admission to Grade 7 at the Laboratory School, please follow these steps:\n\n1. Submit the filled-out application form and other documentary requirements.\n2. Pay the testing fee\n3. Secure an Admission Test Permit "
            ]
        },
        {
            "patterns": [
                "How long is the admission process for applicants to the Laboratory School?",
                "What is the duration of the admission process for applicants to the Laboratory School?",
                "How long does the entire admission process take for applicants to the Laboratory School?",
                "How long will it take to complete all the steps for admission to the Laboratory School?",
                "What is the duration of the entire admission process for applicants to the Laboratory School?"
            ],
            "responses": [
                "The admission process for applicants to the Laboratory School at BatStateU ARASOF-Nasugbu typically takes about 9 minutes to complete."
            ]
        },
        {
            "patterns": [
                "Is there a fee for the admission process to the Laboratory School?",
                "How much does the admission process cost for applicants to the Laboratory School?",
                "What are the fees for the entire admission process to the Laboratory School?",
                "Are there any fees I need to pay during the admission process to the Laboratory School?",
                "How much is the total cost associated with applying for admission to the Laboratory School?"
            ],
            "responses": [
                "There is a fee of 250 PHP for the testing fee required for the admission process to the Laboratory School. Other than this, there are no additional fees for the entire admission process."
            ]
        },
        {
            "patterns": [
                "Who can I contact for inquiries about the admission process to the Laboratory School?",
                "Who should I reach out to about the admission process to the Laboratory School?",
                "Who do I reach out to for questions about the admission process to the Laboratory School?",
                "How can I contact the Testing and Admission Office for questions regarding the admission process to the Laboratory School?",
                "What is the contact information of the Testing and Admission Office for inquiries related to the admission process to the Laboratory School?"
            ],
            "responses": [
                "For inquiries about the admission process to the Laboratory School, you can contact the Testing and Admission Office. Here are the details:\n\nTelephone: 416-0350 local 216\nEmail: tao.nasugbu@g.batstate-u.edu.ph\nOfficial Facebook Page: https://fb.com/TestingAndAdmissionOffice\n\nPlease feel free to reach out for any questions or assistance regarding the admission process."
            ]
        },
        {
            "patterns": [
                "Who can I contact for inquiries about the Kindergarten admission process to the Laboratory School?",
                "Who should I reach out to about the Kindergarten admission process to the Laboratory School?",
                "Who do I reach out to for questions about the Kindergarten admission process to the Laboratory School?",
                "How can I contact the Testing and Admission Office for questions regarding the Kindergarten admission process to the Laboratory School?",
                "What is the contact information of the Testing and Admission Office for inquiries related to the Kindergarten admission process to the Laboratory School?"
            ],
            "responses": [
                "For inquiries about the admission process for Kindergarten, you can contact the Testing and Admission Office. Here are the details:\n\nTelephone: 416-0350 local 216\nEmail: tao.nasugbu@g.batstate-u.edu.ph\nOfficial Facebook Page: https://fb.com/TestingAndAdmissionOffice\n\nPlease feel free to reach out for any questions or assistance regarding the admission process."
            ]
        },
        {
            "patterns": [
                "Who can I contact for inquiries about the Elementary admission process to the Laboratory School?",
                "Who should I reach out to about the Elementary admission process to the Laboratory School?",
                "Who do I reach out to for questions about the Elementary admission process to the Laboratory School?",
                "How can I contact the Testing and Admission Office for questions regarding the Elementary admission process to the Laboratory School?",
                "What is the contact information of the Testing and Admission Office for inquiries related to the Elementary admission process to the Laboratory School?"
            ],
            "responses": [
                "For inquiries about the admission process for Elementary, you can contact the Testing and Admission Office. Here are the details:\n\nTelephone: 416-0350 local 216\nEmail: tao.nasugbu@g.batstate-u.edu.ph\nOfficial Facebook Page: https://fb.com/TestingAndAdmissionOffice\n\nPlease feel free to reach out for any questions or assistance regarding the admission process."
            ]
        },
        {
            "patterns": [
                "Who can I contact for inquiries about the Grade 7 admission process to the Laboratory School?",
                "Who should I reach out to about the Grade 7 admission process to the Laboratory School?",
                "Who do I reach out to for questions about the Grade 7 admission process to the Laboratory School?",
                "How can I contact the Testing and Admission Office for questions regarding the Grade 7 admission process to the Laboratory School?",
                "What is the contact information of the Testing and Admission Office for inquiries related to the Grade 7 admission process to the Laboratory School?"
            ],
            "responses": [
                "For inquiries about the admission process for Grade 7, you can contact the Testing and Admission Office. Here are the details:\n\nTelephone: 416-0350 local 216\nEmail: tao.nasugbu@g.batstate-u.edu.ph\nOfficial Facebook Page: https://fb.com/TestingAndAdmissionOffice\n\nPlease feel free to reach out for any questions or assistance regarding the admission process."
            ]
        },
        {
            "patterns": [
                "What are the requirements for enrollment as a new student?",
                "What documents do I need to submit for enrollment as a new student?",
                "What requirements do I need to apply for enrollment as a new student?",
                "What documents should I prepare to apply for enrollment as a new student?",
                "What are the required documents for the enrollment process for new students?"
            ],
            "responses": [
                "To enroll as a new student at BatStateU ARASOF-Nasugbu, you need to prepare the following documents for each step of the enrollment process:\n\nSecuring Admission Test\n1. One (1) copy of Grades Form 1 (for Regular Admission) / Grades Form 2 (for ALS)\n2. One (1) certified true copy of Junior High School and Senior High School Form 137\n3. Certification of completion of SHS and respective strand or enrolment therein, if not completed (1 photocopy)\n4. For Alternative Admission Program (AAP) applicants:\n - Indigent Applicants: Certificate of Indigency and Certificate of Tax -Exemption.\n - ALS Applicants: Certification of completion of the ALS program (or proof of enrollment if not completed).\n - Indigenous People: Certificate of Tribe Membership.\n - PWD: PWD Identification card.\n - Iskolar ng Bayan Applicants: Certification from the public high school, duly signed by the school principal, of the rank of the applicant in the Top Ten of the graduating (Grade 12) class\n5. Two recent 2” x 2” pictures with a white background.\n6. Form 138 (if the student is graduate of SHS) (1 Original) \n7. Admission Test Permit (1 Original) \n\nSecuring Pre-enrollment Medical Examination\n1. Medical/Dental Form (1 original, accomplished)\n2. Chest X-ray Reading-validity is 6 months from date of examination (1 original) \n3. Blood Type Result or any valid ID with blood type (1 original) \n4. Drug Test - validity is 1 year from date of examination (1 original) \n\nSecuring Registration\n1. Report Card/Form 138 (1 Original)\n2. Certificate of Good Moral Character (1 Original)\n3. PSA Birth Certificate/Marriage Certificate for Married Female Enrollees (1 Original)\n4. Notice of Admission (1 Original)"
            ]
        },
        {
            "patterns": [
                "What are the requirements for admission as a new student?",
                "What documents do I need to submit for admission as a new student?",
                "What requirements do I need to apply for admission as a new student?",
                "What documents should I prepare to apply for admission as a new student?",
                "What are the required documents for the admission process for new students?"
            ],
            "responses": [
                "To apply for admission as a new college student at BatStateU ARASOF-Nasugbu, you will need to provide the following requirements:\n\n1. One (1) copy of Grades Form 1 (for Regular Admission) / Grades Form 2 (for ALS)\n2. One (1) certified true copy of Junior High School and Senior High School Form 137\n3. Certification of completion of SHS and respective strand or enrollment therein, if not completed (1 photocopy)\n4. Two (2) copies of recent 2” x 2” pictures with a white background\n5. Form 138 (if the student is a graduate of SHS) – 1 Original\n6. Admission Test Permit – 1 Original\n\nAdditional Requirements for Admission under AAP:\n\nIndigent Applicants:\n  1. Certificate of Indigency of Parent/Guardian\n  2. Certificate of Tax Exemption\n\nAlternative Learning System (ALS):\n  1. Certification of completion of ALS program or enrollment\n\nIndigenous People:\n  1. Certificate of Tribe Membership or equivalent certification\n\nPWD:\n  1. PWD Identification card\n\nIskolar ng Bayan:\n  1. Certification from the public high school, signed by the school principal, confirming the applicant's rank in the Top Ten of the graduating (Grade 12) class"
            ]
        },
        {
            "patterns": [
                "Where can I get Grades Form 1 for enrollment as a new student?",
                "Where can I request Grades Form 1 for enrollment as a new student?",
                "Where can I obtain Grades Form 1 for enrollment as a new student?"
            ],
            "responses": [
                "You can obtain Grades Form 1 from the College Admission portal: https://dione.batstate-u.edu.ph/tao/#/application."
            ]
        },
        {
            "patterns": [
                "Where can I get Grades Form 2 for enrollment as a new student?",
                "Where can I request Grades Form 2 for enrollment as a new student?",
                "Where can I obtain Grades Form 2 for enrollment as a new student?"
            ],
            "responses": [
                "You can obtain Grades Form 2 from the College Admission portal: https://dione.batstate-u.edu.ph/tao/#/application."
            ]
        },
        {
            "patterns": [
                "Where can I get Form 137 for enrollment as a new student?",
                "Where can I request Form 137 for enrollment as a new student?",
                "Where can I obtain Form 137 for enrollment as a new student?"
            ],
            "responses": [
                "You can obtain Form 137 from your current or previous school."
            ]
        },
        {
            "patterns": [
                "Where can I get a certification of SHS completion or enrollment for enrollment as a new student?",
                "Where can I request a certification of SHS completion or enrollment for enrollment as a new student?",
                "Where can I obtain a certification of SHS completion or enrollment for enrollment as a new student?"
            ],
            "responses": [
                "You can obtain the Certification of Completion of Senior High School from your current or previous school."
            ]
        },
        {
            "patterns": [
                "Where can I get a Certificate of Indigency for enrollment as a new student?",
                "Where can I request a Certificate of Indigency for enrollment as a new student?",
                "Where can I obtain a Certificate of Indigency for enrollment as a new student?"
            ],
            "responses": [
                "You can obtain the Certificate of Indigency from the Office of the Barangay."
            ]
        },
        {
            "patterns": [
                "Where can I get a Certificate of Tax Exemption for enrollment as a new student?",
                "Where can I request a Certificate of Tax Exemption for enrollment as a new student?",
                "Where can I obtain a Certificate of Tax Exemption for enrollment as a new student?"
            ],
            "responses": [
                "You can obtain the Certificate of Tax Exemption from the Bureau of Internal Revenue (BIR)."
            ]
        },
        {
            "patterns": [
                "Where can I get a certification of completion of the ALS program for enrollment as a new student?",
                "Where can I request a certification of completion of the ALS program for enrollment as a new student?",
                "Where can I obtain a certification of completion of the ALS program for enrollment as a new student?"
            ],
            "responses": [
                "You can obtain the Certification of Completion for ALS from your current or previous school."
            ]
        },
        {
            "patterns": [
                "Where can I get a Certification of Tribe Membership for enrollment as a new student?",
                "Where can I request a Certification of Tribe Membership for enrollment as a new student?",
                "Where can I obtain a Certification of Tribe Membership for enrollment as a new student?"
            ],
            "responses": [
                "You can obtain the Certificate of Tribe Membership from the National Commission on Indigenous Peoples (NCIP)."
            ]
        },
        {
            "patterns": [
                "Where can I get a PWD Identification Card for enrollment as a new student?",
                "Where can I request a PWD Identification Card for enrollment as a new student?",
                "Where can I obtain a PWD Identification Card for enrollment as a new student?"
            ],
            "responses": [
                "You can obtain a PWD Identification Card from the Persons with Disabilities Affairs Office (PDAO)."
            ]
        },
        {
            "patterns": [
                "Where can I get a certification of my Top Ten Rank for enrollment as a new student? ",
                "Where can I request a certification of my Top Ten Rank for enrollment as a new student?",
                "Where can I obtain a certification of my Top Ten Rank for enrollment as a new student?"
            ],
            "responses": [
                "You can obtain a certification of your Top Ten Rank for enrollment as a new student from your public senior high school."
            ]
        },
        {
            "patterns": [
                "Where can I get Form 138 for enrollment as a new student?",
                "Where can I request Form 138 for enrollment as a new student?",
                "Where can I obtain Form 138 for enrollment as a new student?"
            ],
            "responses": [
                "You can obtain Form 138 from your previous school."
            ]
        },
        {
            "patterns": [
                "Where can I get the admission test permit for enrollment as a new student?",
                "Where can I request the admission test permit for enrollment as a new student?",
                "Where can I obtain the admission test permit for enrollment as a new student?"
            ],
            "responses": [
                "You can obtain the Admission Test Permit from BatStateU ARASOF-Nasugbu, issued after completing the initial requirements."
            ]
        },
        {
            "patterns": [
                "Where can I get the Medical Form for enrollment as a new student?",
                "Where can I request the Medical Form for enrollment as a new student?",
                "Where can I obtain the Medical Form for enrollment as a new student?"
            ],
            "responses": [
                "You can obtain the Medical Form from the Health Services Office or the College Applicant’s Portal."
            ]
        },
        {
            "patterns": [
                "Where can I get the Dental Form for enrollment as a new student?",
                "Where can I request the Dental Form for enrollment as a new student?",
                "Where can I obtain the Dental Form for enrollment as a new student?"
            ],
            "responses": [
                "You can obtain the Dental Form from the Health Services Office or the College Applicant’s Portal."
            ]
        },
        {
            "patterns": [
                "Where can I get a chest X-ray reading for enrollment as a new student?",
                "Where can I request a chest X-ray reading for enrollment as a new student?",
                "Where can I obtain a chest X-ray reading for enrollment as a new student?"
            ],
            "responses": [
                "You can obtain a Chest X-ray Reading from a hospital or DOH-assisted laboratory."
            ]
        },
        {
            "patterns": [
                "Where can I get a blood type result for enrollment as a new student?",
                "Where can I request a blood type result for enrollment as a new student?",
                "Where can I obtain a blood type result for enrollment as a new student?"
            ],
            "responses": [
                "You can obtain your Blood Type Result from a hospital or DOH-assisted laboratory."
            ]
        },
        {
            "patterns": [
                "Where can I get a drug test result for enrollment as a new student?",
                "Where can I request a drug test result for enrollment as a new student?",
                "Where can I obtain a drug test result for enrollment as a new student?"
            ],
            "responses": [
                "You can obtain a Drug Test from a hospital or DOH-assisted laboratory."
            ]
        },
        {
            "patterns": [
                "Where can I get report card for enrollment as a new student?",
                "Where can I request report card for enrollment as a new student?",
                "Where can I obtain report card for enrollment as a new student?"
            ],
            "responses": [
                "You can obtain your Report Card from your previous school."
            ]
        },
        {
            "patterns": [
                "Where can I get a Certificate of Good Moral Character for enrollment as a new student?",
                "Where can I request a Certificate of Good Moral Character for enrollment as a new student?",
                "Where can I obtain a Certificate of Good Moral Character for enrollment as a new student?",
                "Where can I get the Certificate of Good Moral Character for enrollment as a transferee from other HEIs?",
                "Where can I request the Certificate of Good Moral Character for enrollment as a transferee from other HEIs?",
                "Where can I obtain the Certificate of Good Moral Character for enrollment as as a transferee from other HEIs?"
            ],
            "responses": [
                "You can obtain the Certificate of Good Moral Character from your previous school."
            ]
        },
        {
            "patterns": [
                "Where can I get a PSA Birth Certificate for enrollment as a new student?",
                "Where can I request a PSA Birth Certificate for enrollment as a new student?",
                "Where can I obtain a PSA Birth Certificate for enrollment as a new student?",
                "Where can I get my Birth Certificate for enrollment as a transferee from other HEIs?",
                "Where can I request my Birth Certificate for enrollment as a transferee from other HEIs?",
                "Where can I obtain my Birth Certificate for enrollment as a transferee from other HEIs?"
            ],
            "responses": [
                "You can obtain your Birth Certificate from the Philippine Statistics Authority (PSA)."
            ]
        },
        {
            "patterns": [
                "Where can I get the Notice of Admission for enrollment as a new student?",
                "Where can I request the Notice of Admission for enrollment as a new student?",
                "Where can I obtain the Notice of Admission for enrollment as a new student?"
            ],
            "responses": [
                "You can obtain the Notice of Admission from the Testing and Admission Office or the College Applicant’s Portal."
            ]
        },
        {
            "patterns": [
                "How do I apply for enrollment as a new student?",
                "What are the steps for enrollment as a new student?",
                "What is the enrollment process for new students?",
                "How do I complete my enrollment as a new student?",
                "What is the process for enrollment as a new student?"
            ],
            "responses": [
                "To complete your enrollment as a new student, please follow these steps:\n\n1. Fill out the application form and upload the scanned copy of documentary requirements at https://dione.batstate-u.edu.ph/tao/#/application.\n2. Check the college application portal for the schedule of examination.\n3. Take the Admission Test.\n4. Wait for the examination results.\n5. Pre-register if interested to enroll in the program qualified for through the college applicant’s portal.\n6. Go to the Online Appointment System for the Health Services Office to schedule a pre-enrollment medical examination.\n7. Sign in the Transaction Logsheet.\n8. Submit the required documents.\n9. Open Medical/Dental Form in the Student Portal.\n10. Undergo Medical/Dental Examination/Evaluation.\n11. Sign out on the Transaction Logsheet.\n12. Submit the complete set of enrollment documents to the Registration Services Office.\n13. Receive proof of enrollment.\n14. Log in to the Student’s Portal."
            ]
        },
        {
            "patterns": [
                "How long is the enrollment process for new students?",
                "What is the duration of the enrollment process for new students?",
                "How long does the entire enrollment process take for new students?",
                "How long will it take to complete all the steps for enrollment as a new student?",
                "What is the duration of the entire enrollment process for new students?"
            ],
            "responses": [
                "The enrollment process for new students at BatStateU ARASOF-Nasugbu typically takes about 5 months, 15 days, 2 hours, and 55 minutes to complete."
            ]
        },
        {
            "patterns": [
                "How long does the admission test take for new students?",
                "What is the duration of the admission test for new students?",
                "How long is the admission test for new students?",
                "How much time do I need for the admission test as a new student?",
                "What is the time allotted for the admission test for new students?"
            ],
            "responses": [
                "The admission test for new students at BatStateU ARASOF-Nasugbu typically takes about 2 hours to complete."
            ]
        },
        {
            "patterns": [
                "Is there a fee for the enrollment process for new students?",
                "How much does the enrollment process cost for new students?",
                "What are the fees for the entire enrollment process for new students?",
                "Are there any fees I need to pay during the enrollment process for new students?",
                "How much is the total cost associated with applying for enrollment as a new student?"
            ],
            "responses": [
                "There are no fees associated with the enrollment process for new students. The entire enrollment process is free of charge."
            ]
        },
        {
            "patterns": [
                "When is the admission test for new students?",
                "When is the admission test for transferees from other HEIs?"
            ],
            "responses": [
                "For the admission test schedule, please check the official pages of the Testing and Admission Office or contact them directly for the most up-to-date information. You can reach the Testing and Admission Office at:\n\nTelephone: 416-0350 local 216\nEmail: tao.nasugbu@g.batstate-u.edu.ph\nOfficial Facebook Page: https://fb.com/TestingAndAdmissionOffice"
            ]
        },
        {
            "patterns": [
                "When is the release of the admission test results for new students?",
                "When is the release of the admission test results for transferees from other HEIs?"
            ],
            "responses": [
                "The release date for admission test results will be announced on the official pages of the Testing and Admission Office. For the latest updates, you can contact them directly:\n\nTelephone: 416-0350 local 216\nEmail: tao.nasugbu@g.batstate-u.edu.ph\nOfficial Facebook Page: https://fb.com/TestingAndAdmissionOffice"
            ]
        },
        {
            "patterns": [
                "When is the enrollment period for new students?",
                "When is the enrollment period for shifters from another BatStateU campus?",
                "When is the enrollment period for transferees from another BatStateU campus?",
                "When is the enrollment period for transferees from other HEIs?",
                "When is the enrollment period for regular students?",
                "When is the enrollment period for irregular students?",
                "When is the enrollment period for overstaying students?",
                "When is the enrollment period for returnee students?",
                "When is the enrollment period for late enrollees?"
            ],
            "responses": [
                "For the enrollment period, please refer to the official announcements from the Registrar's Office or contact them directly for the most up-to-date information. You can reach the Registrar's Office at:\n\nTelephone: (043) 416-0350 local 214\nEmail: registrar.nasugbu@g.batstate-u.edu.ph"
            ]
        },
        {
            "patterns": [
                "When is the deadline for enrollment for new students?"
            ],
            "responses": [
                "For the deadline of enrollment, please refer to the official announcements from the Registrar's Office or contact them directly for the most up-to-date information. You can reach the Registrar's Office at:\n\nTelephone: (043) 416-0350 local 214\nEmail: registrar.nasugbu@g.batstate- u.edu.ph"
            ]
        },
        {
            "patterns": [
                "Who can I contact for inquiries about the enrollment process for new students?",
                "Who should I reach out to about the admission requirements for new students?",
                "Who do I reach out to for questions about the admission requirements for new students?",
                "How can I contact the Testing and Admission Office for questions regarding the admission process for new students?",
                "What is the contact information of the Testing and Admission Office for inquiries related to the admission process for new students?"
            ],
            "responses": [
                "For inquiries about admission requirements and the admission process for new students, you can contact the Testing and Admission Office. Here are the details:\n\nTelephone: 416-0350 local 216\nEmail: tao.nasugbu@g.batstate-u.edu.ph\nOfficial Facebook Page: https://fb.com/TestingAndAdmissionOffice\n\nPlease feel free to reach out for any questions or assistance regarding admission requirements or the application process."
            ]
        },
        {
            "patterns": [
                "Who should I reach out to about the enrollment process for new students?",
                "Who do I reach out to for questions about the enrollment process for new students?",
                "How can I contact the Registrar's Office for questions regarding enrollment precoess for new students?",
                "What is the contact information of the Registrar's Office for inquiries related to enrollment process for new students?"
            ],
            "responses": [
                "For inquiries about enrollment process for new students, you can contact the Registrar's Office. Here are the details:\n\nTelephone: (043) 416-0350 local 214\nEmail: registrar.nasugbu@g.batstate- u.edu.ph\n\nPlease feel free to reach out for any questions or assistance regarding enrollment process."
            ]
        },
        {
            "patterns": [
                "What are the requirements for enrollment as a shifter from another BatStateU campus?",
                "What documents do I need to submit for enrollment as a shifter from another BatStateU campus?",
                "What requirements do I need to apply for enrollment as a shifter from another BatStateU campus?",
                "What documents should I prepare to apply for enrollment as a shifter from another BatStateU campus?",
                "What are the required documents for the enrollment process for shifters from another BatStateU campus?"
            ],
            "responses": [
                "To enroll as a shifter from another BatStateU campus, please prepare the following documents:\n\n1. Application Form for Shifter/Transferee (1 Original): From the Registration Services Office or Student Portal.\n2. Student Clearance (1 Original): From the Concerned College/Department.\n3. Parent’s Consent (1 Original): From the Parent/Guardian of the Student.\n4. Report of Grades (1 Certified True Copy): From the Student Portal or Registration Services.\n5. Student ID: From the Student Portal.\n6. Student’s Copy of Exit Interview Form (1 Clear Copy): From the Guidance and Counseling Office (for transferees only).\n\nConditional Requirement: In case, the student cannot personally process:\n - Authorization letter stating the processes to be undertaken by the representative (1 Original)\n - Clear photocopy of student ID (1 copy) and any valid ID of the representative (1 copy), with three (3) specimen signatures"
            ]
        },
        {
            "patterns": [
                "What are the requirements for enrollment as a transferee from another BatStateU campus?",
                "What documents do I need to submit for enrollment as a transferee from another BatStateU campus?",
                "What requirements do I need to apply for enrollment as a transferee from another BatStateU campus?",
                "What documents should I prepare to apply for enrollment as a transferee from another BatStateU campus?",
                "What are the required documents for the enrollment process for transferees from another BatStateU campus?"
            ],
            "responses": [
                "To enroll as a transferee from another BatStateU campus, please prepare the following documents:\n\n1. Application Form for Shifter/Transferee (1 Original): From the Registration Services Office or Student Portal.\n2. Student Clearance (1 Original): From the Concerned College/Department.\n3. Parent’s Consent (1 Original): From the Parent/Guardian of the Student.\n4. Report of Grades (1 Certified True Copy): From the Student Portal or Registration Services.\n5. Student ID: From the Student Portal.\n6. Student’s Copy of Exit Interview Form (1 Clear Copy): From the Guidance and Counseling Office (for transferees only).\n\nConditional Requirement: In case, the student cannot personally process:\n - Authorization letter stating the processes to be undertaken by the representative (1 Original)\n - Clear photocopy of student ID (1 copy) and any valid ID of the representative (1 copy), with three (3) specimen signatures"
            ]
        },
        {
            "patterns": [
                "Where can I get the Application Form for enrollment as a shifter from another BatStateU campus?",
                "Where can I request the Application Form for enrollment as a shifter from another BatStateU campus?",
                "Where can I obtain the Application Form for enrollment as a shifter from another BatStateU campus?",
                "Where can I get the Application Form for enrollment as a transferee from another BatStateU campus?",
                "Where can I request the Application Form for enrollment as a transferee from another BatStateU campus?",
                "Where can I obtain the Application Form for enrollment as a transferee from another BatStateU campus?"
            ],
            "responses": [
                "You can obtain the Application Form for Shifter/Transferee from the Registration Services Office or the Student Portal."
            ]
        },
        {
            "patterns": [
                "Where can I get the Student Clearance for enrollment as a shifter from another BatStateU campus?",
                "Where can I request the Student Clearance for enrollment as a shifter from another BatStateU campus?",
                "Where can I obtain the Student Clearance for enrollment as a shifter from another BatStateU campus?",
                "Where can I get the Student Clearance for enrollment as a transferee from another BatStateU campus?",
                "Where can I request the Student Clearance for enrollment as a transferee from another BatStateU campus?",
                "Where can I obtain the Student Clearance for enrollment as a transferee from another BatStateU campus?"
            ],
            "responses": [
                "You can obtain the Student Clearance from the Concerned College/Department."
            ]
        },
        {
            "patterns": [
                "Where can I get the Report of Grades for enrollment as a shifter from another BatStateU campus?",
                "Where can I request the Report of Grades for enrollment as a shifter from another BatStateU campus?",
                "Where can I obtain the Report of Grades for enrollment as a shifter from another BatStateU campus?",
                "Where can I get the Report of Grades for enrollment as a transferee from another BatStateU campus?",
                "Where can I request the Report of Grades for enrollment as a transferee from another BatStateU campus?",
                "Where can I obtain the Report of Grades for enrollment as a transferee from another BatStateU campus?"
            ],
            "responses": [
                "You can obtain the Report of Grades from the Student Portal or Registration Services."
            ]
        },
        {
            "patterns": [
                "Where can I get the Student ID for enrollment as a shifter from another BatStateU campus?",
                "Where can I request the Student ID for enrollment as a shifter from another BatStateU campus?",
                "Where can I obtain the Student ID for enrollment as a shifter from another BatStateU campus?",
                "Where can I get the Student ID for enrollment as a transferee from another BatStateU campus?",
                "Where can I request the Student ID for enrollment as a transferee from another BatStateU campus?",
                "Where can I obtain the Student ID for enrollment as a transferee from another BatStateU campus?"
            ],
            "responses": [
                "You can obtain the Student ID from the Student Portal."
            ]
        },
        {
            "patterns": [
                "Where can I get the Exit Interview Form for enrollment as a transferee from another BatStateU campus?",
                "Where can I request the Exit Interview Form for enrollment as a transferee from another BatStateU campus?",
                "Where can I obtain the Exit Interview Form for enrollment as a transferee from another BatStateU campus?"
            ],
            "responses": [
                "You can obtain the Exit Interview Form from the Guidance and Counseling Office"
            ]
        },
        {
            "patterns": [
                "How do I apply for enrollment as a shifter from another BatStateU campus?",
                "What are the steps for enrollment as a shifter from another BatStateU campus?",
                "What is the enrollment process for shifters from another BatStateU campus?",
                "How do I complete my enrollment as a shifter from another BatStateU campus?",
                "What is the process for enrollment as a shifter from another BatStateU campus?"
            ],
            "responses": [
                "To complete your enrollment as a shifter from another BatStateU Campus, please follow these steps:\n\n1. Proceed to the Registration Services Office for authentication of report of grades\n2. Proceed to the admitting college for initial evaluation.\n3. Bring the approved application form to the Registration Services Office"
            ]
        },
        {
            "patterns": [
                "How do I apply for enrollment as a transferee from another BatStateU campus?",
                "What are the steps for enrollment as a transferee from another BatStateU campus?",
                "What is the enrollment process for transferees from another BatStateU campus?",
                "How do I complete my enrollment as a transferee from another BatStateU campus?",
                "What is the process for enrollment as a transferee from another BatStateU campus?"
            ],
            "responses": [
                "To complete your enrollment as a transferee from another BatStateU campus, please follow these steps:\n\n1. Proceed to the Registration Services Office for authentication of report of grades\n2. Proceed to the admitting college for initial evaluation.\n3. Bring the approved application form to the Registration Services Office"
            ]
        },
        {
            "patterns": [
                "How long is the enrollment process for shifters from another BatStateU campus?",
                "What is the duration of the enrollment process for shifters from another BatStateU campus?",
                "How long does the entire enrollment process take for shifters from another BatStateU campus?",
                "How long will it take to complete all the steps for enrollment as a shifter from another BatStateU campus?",
                "What is the duration of the entire enrollment process for shifters from another BatStateU campus?",
                "How long is the enrollment process for transferees from another BatStateU campus?",
                "What is the duration of the enrollment process for transferees from another BatStateU campus?",
                "How long does the entire enrollment process take for transferees from another BatStateU campus?",
                "How long will it take to complete all the steps for enrollment as a transferee from another BatStateU campus?",
                "What is the duration of the entire enrollment process for transferees from another BatStateU campus?"
            ],
            "responses": [
                "The enrollment process for shifters and transferees from another BatStateU campus typically takes about 2 hours to complete."
            ]
        },
        {
            "patterns": [
                "Is there a fee for the enrollment process for shifters from another BatStateU campus?",
                "How much does the enrollment process cost for shifters from another BatStateU campus?",
                "What are the fees for the entire enrollment process for shifters from another BatStateU campus?",
                "Are there any fees I need to pay during the enrollment process for shifters from another BatStateU campus?",
                "How much is the total cost associated with applying for enrollment as a shifter from another BatStateU campus?",
                "Is there a fee for the enrollment process for transferees from another BatStateU campus?",
                "How much does the enrollment process cost for transferees from another BatStateU campus?",
                "What are the fees for the entire enrollment process for transferees from another BatStateU campus?",
                "Are there any fees I need to pay during the enrollment process for transferees from another BatStateU campus?",
                "How much is the total cost associated with applying for enrollment as a transferee from another BatStateU campus?"
            ],
            "responses": [
                "There is a fee of Php 20 per page for authentication documents associated with the enrollment process for shifters and transferees from another BatStateU campus."
            ]
        },
        {
            "patterns": [
                "When is the enrollment date for shifters from another BatStateU campus?",
                "When is the enrollment date for transferees from another BatStateU campus?",
                "When is the enrollment date for regular students?",
                "When is the enrollment date for irregular students?",
                "When is the enrollment date for overstaying students?",
                "When is the enrollment date for returnee students?",
                "When is the enrollment date for late enrollees?"
            ],
            "responses": [
                "For the enrollment date, please refer to the official announcements from the Registrar's Office or contact them directly for the most up-to-date information. You can reach the Registrar's Office at:\n\nTelephone: (043) 416-0350 local 214\nEmail: registrar.nasugbu@g.batstate-u.edu.ph"
            ]
        },
        {
            "patterns": [
                "When is the deadline for enrollment for shifters from another BatStateU campus?",
                "When is the deadline for enrollment for transferees from another BatStateU campus?",
                "When is the deadline for enrollment for transferees from other HEIs?",
                "When is the deadline of enrollment for regular students?",
                "When is the deadline of enrollment for irregular students?",
                "When is the deadline for enrollment for overstaying students?",
                "When is the deadline for enrollment for returnee students?",
                "When is the deadline for late enrollment?"
            ],
            "responses": [
                "For the deadline of enrollment, please refer to the official announcements from the Registrar's Office or contact them directly for the most up-to-date information. You can reach the Registrar's Office at:\n\nTelephone: (043) 416-0350 local 214\nEmail: registrar.nasugbu@g.batstate-u.edu.ph"
            ]
        },
        {
            "patterns": [
                "Who can I contact for inquiries about the enrollment process for shifters from another BatStateU campus?",
                "Who should I reach out to about the enrollment process for shifters from another BatStateU campus?",
                "Who do I contact for questions about the enrollment process for shifters from another BatStateU campus?",
                "How can I contact the Registrar's Office for questions regarding the enrollment process for shifters from another BatStateU campus?",
                "What is the contact information for the Registrar's Office for inquiries related to the enrollment process for shifters from another BatStateU campus?",
                "Who can I contact for inquiries about the enrollment process for transferees from another BatStateU campus?",
                "Who should I reach out to about the enrollment process for transferees from another BatStateU campus?",
                "Who do I contact for questions about the enrollment process for transferees from another BatStateU campus?",
                "How can I contact the Registrar's Office for questions regarding the enrollment process for transferees from another BatStateU campus?",
                "What is the contact information of the Registrar's Office for inquiries related to the enrollment process for transferees from another BatStateU campus?"
            ],
            "responses": [
                "For inquiries about the enrollment process for shifters / transferees from another BatStateU campus, you can contact the Registrar's Office. Here are the details:\n\nTelephone: (043) 416-0350 local 214\nEmail: registrar.nasugbu@g.batstate-u.edu.ph\n\nPlease feel free to reach out for any questions or assistance regarding enrollment process."
            ]
        },
        {
            "patterns": [
                "What are the requirements for enrollment as a transferee from other Higher Education Institutions (HEIs)?",
                "What documents do I need to submit for enrollment as a transferee from other Higher Education Institutions (HEIs)?",
                "What requirements do I need to apply for enrollment as a transferee from other Higher Education Institutions (HEIs)?",
                "What documents should I prepare to apply for enrollment as a transferee from other Higher Education Institutions (HEIs)?",
                "What are the required documents for the enrollment process for transferees from other Higher Education Institutions (HEIs)?"
            ],
            "responses": [
                "To enroll as a transferee from other Higher Education Institutions (HEIs) at BatStateU ARASOF-Nasugbu, please prepare the following documents for each step of the enrollment process:\n\nAdmission Requirements\n1. Accomplished Application Form for Shifter/Transferee (1 Original)\n2. Transcript of Records (1 Original)\n3. Certificate of General Weighted Average (GWA)\n4. Certificate of Course Description (if necessary)\n5. Student ID or Any Valid Identification Card\n\nHealth Services Requirements\n1. Notice of Admission (1 Original)\n2. Medical/Dental Form (1 Original)\n3. Chest X-ray Reading (valid for 6 months from date of examination, 1 Original)\n4. Blood Type Result or any valid ID with blood type (1 Original)\n5. Drug Test (valid for 1 year from date of examination, 1 Original)\n\nRegistration Services Requirements\n1. Stamped Notice of Admission (1 Original)\n2. Approved Application Form for Shifter/Transferee (1 Original)\n3. Program Curriculum (1 Clear Copy)\n4. Certificate of Transfer Credential/Honorable Dismissal (1 Original)\n5. Transcript of Records (1 Original)\n6. Clear Copy of PSA/NSO Birth Certificate or Marriage Contract (for married female enrollees, 1 Copy)\n7. Certificate of Good Moral Character (1 Original)\n\nConditional Requirement: In case, the student cannot personally process:\n - Authorization letter stating the processes to be undertaken by the representative (1 Original)\n - Clear photocopy of student ID (1 copy) and any valid ID of the representative (1 copy), with three (3) specimen signatures"
            ]
        },
        {
            "patterns": [
                "What are the requirements for the admission process as a transferee from other Higher Education Institutions (HEIs)?",
                "What documents do I need to submit for the admission process as a transferee from other Higher Education Institutions (HEIs)?",
                "What requirements do I need to apply for the admission as a transferee from other HEIs?",
                "What documents should I prepare for the admission process as a transferee from other HEIs?",
                "What are the required documents for the admission process for transferees from other Higher Education Institutions (HEIs)?"
            ],
            "responses": [
                "For the admission process as a transferee from other Higher Education Institutions (HEIs) at BatStateU ARASOF-Nasugbu, prepare the following documents:\n\n1. Accomplished Application Form for Shifter/Transferee (1 Original): From the Registration Services Office\n2. Transcript of Records (1 Original): From your previous school\n3. Certificate of General Weighted Average (GWA): From your previous school\n4. Certificate of Course Description (if necessary): From your previous school\n5. Student ID or Any Valid Identification Card: From your previous school or government agency"
            ]
        },
        {
            "patterns": [
                "Where can I get the Accomplished Application Form for Shifter for enrollment as a transferee from other HEIs?",
                "Where can I request the Accomplished Application Form for Shifter for enrollment as a transferee from other HEIs?",
                "Where can I obtain the Accomplished Application Form for Shifter for enrollment as a transferee from other HEIs?",
                "Where can I get the Accomplished Application Form for Transferee for enrollment as a transferee from other HEIs?",
                "Where can I request the Accomplished Application Form for Transferee for enrollment as a transferee from other HEIs?",
                "Where can I obtain the Accomplished Application Form for Transferee for enrollment as a transferee from other HEIs?"
            ],
            "responses": [
                "You can obtain the Accomplished Application Form for Shifter/Transferee from the Registration Services Office."
            ]
        },
        {
            "patterns": [
                "Where can I get the Transcript of Records for enrollment as a transferee from other HEIs?",
                "Where can I request the Transcript of Records for enrollment as a transferee from other HEIs?",
                "Where can I obtain the Transcript of Records for enrollment as a transferee from other HEIs?"
            ],
            "responses": [
                "You can obtain the Transcript of Records from your previous school."
            ]
        },
        {
            "patterns": [
                "Where can I get the Certificate of General Weighted Average (GWA) for enrollment as a transferee from other HEIs?",
                "Where can I request the Certificate of General Weighted Average (GWA) for enrollment as a transferee from other HEIs?",
                "Where can I obtain the Certificate of General Weighted Average (GWA) for enrollment as a transferee from other HEIs?"
            ],
            "responses": [
                "You can obtain the Certificate of General Weighted Average (GWA) from your previous school."
            ]
        },
        {
            "patterns": [
                "Where can I get the Certificate of Course Description for enrollment as a transferee from other HEIs?",
                "Where can I request the Certificate of Course Description for enrollment as a transferee from other HEIs?",
                "Where can I obtain the Certificate of Course Description for enrollment as a transferee from other HEIs?"
            ],
            "responses": [
                "You can obtain the Certificate of Course Description from your previous school."
            ]
        },
        {
            "patterns": [
                "Where can I get a Student ID or any valid Identification Card for enrollment as a transferee from other HEIs?",
                "Where can I request a Student ID or any valid Identification Card for enrollment as a transferee from other HEIs?",
                "Where can I obtain a Student ID or any valid Identification Card for enrollment as a transferee from other HEIs?"
            ],
            "responses": [
                "You can obtain a Student ID or any valid Identification Card from your previous school or a government agency."
            ]
        },
        {
            "patterns": [
                "Where can I get the Notice of Admission for enrollment as a transferee from other HEIs?",
                "Where can I request the Notice of Admission for enrollment as a transferee from other HEIs?",
                "Where can I obtain the Notice of Admission for enrollment as a transferee from other HEIs?"
            ],
            "responses": [
                "You can obtain the Notice of Admission from the Testing and Admission Office."
            ]
        },
        {
            "patterns": [
                "Where can I get the Medical Form for enrollment as a transferee from other HEIs?",
                "Where can I request the Medical Form for enrollment as a transferee from other HEIs?",
                "Where can I obtain the Medical Form for enrollment as a transferee from other HEIs?",
                "Where can I get the Dental Form for enrollment as a transferee from other HEIs?",
                "Where can I request the Dental Form for enrollment as a transferee from other HEIs?",
                "Where can I obtain the Dental Form for enrollment as a transferee from other HEIs?"
            ],
            "responses": [
                "You can obtain the Medical/Dental Form from the Health Services office."
            ]
        },
        {
            "patterns": [
                "Where can I get the Chest X-ray Reading for enrollment as a transferee from other HEIs?",
                "Where can I request the Chest X-ray Reading for enrollment as a transferee from other HEIs?",
                "Where can I obtain the Chest X-ray Reading for enrollment as a transferee from other HEIs?"
            ],
            "responses": [
                "You can obtain the Chest X-ray Reading from a hospital or DOH-accredited laboratory."
            ]
        },
        {
            "patterns": [
                "Where can I get the Blood Type Result for enrollment as a transferee from other HEIs?",
                "Where can I request the Blood Type Result for enrollment as a transferee from other HEIs?",
                "Where can I obtain the Blood Type Result for enrollment as a transferee from other HEIs?"
            ],
            "responses": [
                "You can obtain the Blood Type Result from a hospital or DOH-accredited laboratory."
            ]
        },
        {
            "patterns": [
                "Where can I get the Drug Test for enrollment as a transferee from other HEIs?",
                "Where can I request the Drug Test for enrollment as a transferee from other HEIs?",
                "Where can I obtain the Drug Test for enrollment as a transferee from other HEIs?"
            ],
            "responses": [
                "You can obtain the Drug Test from a hospital or DOH-accredited laboratory."
            ]
        },
        {
            "patterns": [
                "Where can I get the Stamped Notice of Admission for enrollment as a transferee from other HEIs?",
                "Where can I request the Stamped Notice of Admission for enrollment as a transferee from other HEIs?",
                "Where can I obtain the Stamped Notice of Admission for enrollment as a transferee from other HEIs?"
            ],
            "responses": [
                "You can obtain the Stamped Notice of Admission from Health Services."
            ]
        },
        {
            "patterns": [
                "Where can I get the Approved Application Form for Shifter/Transferee for enrollment as a transferee from other HEIs?",
                "Where can I request the Approved Application Form for Shifter/Transferee for enrollment as a transferee from other HEIs?",
                "Where can I obtain the Approved Application Form for Shifter/Transferee for enrollment as a transferee from other HEIs?"
            ],
            "responses": [
                "You can obtain the Approved Application Form for Shifter/Transferee from the Admitting College/Department."
            ]
        },
        {
            "patterns": [
                "Where can I get the Program Curriculum for enrollment as a transferee from other HEIs?",
                "Where can I request the Program Curriculum for enrollment as a transferee from other HEIs?",
                "Where can I obtain the Program Curriculum for enrollment as a transferee from other HEIs?"
            ],
            "responses": [
                "You can obtain the Program Curriculum from the Admitting College/Department."
            ]
        },
        {
            "patterns": [
                "Where can I get the Certificate of Transfer Credential for enrollment as a transferee from other HEIs?",
                "Where can I request the Certificate of Transfer Credential for enrollment as a transferee from other HEIs?",
                "Where can I obtain the Certificate of Transfer Credential for enrollment as a transferee from other HEIs?"
            ],
            "responses": [
                "You can obtain the Certificate of Transfer Credential from your previous school."
            ]
        },
        {
            "patterns": [
                "Where can I get the Honorable Dismissal for enrollment as a transferee from other HEIs?",
                "Where can I request the Honorable Dismissal for enrollment as a transferee from other HEIs?",
                "Where can I obtain the Honorable Dismissal for enrollment as a transferee from other HEIs?"
            ],
            "responses": [
                "You can obtain the Honorable Dismissal from your previous school."
            ]
        },
        {
            "patterns": [
                "How do I apply for enrollment as a transferee from other Higher Education Institution (HEI)?",
                "What are the steps for enrollment as a transferee from other Higher Education Institution (HEI)?",
                "What is the enrollment process for transferees from other Higher Education Institution (HEI)?",
                "How do I complete my enrollment as a transferee from other Higher Education Institution (HEI)?",
                "What is the process for enrollment as a transferee from other Higher Education Institution (HEI)?"
            ],
            "responses": [
                "To complete your enrollment as a transferee from other HEIs, please follow these steps:\n\n1. Inquire onsite, thru email or call the Testing and Admission Office (TAO) for inquiries. \n - Email: tao.nasugbu@g.batstate-u.edu.ph\n - Contact Number: (043) 416-0350 local 2016\n2. Secure an Application Form for Shifter/Transferee from the Registration Services Office or request thru the official email address\n - Email: registrar.nasugbu@g.batstate- u.edu.ph\n3. Proceed to the admitting college for the evaluation of academic records\n4. Proceed to Testing and Admission Office (TAO) for the BatStateU College Admission Test\n5. Proceed to the admitting college for endorsement to the Campus Registrar\n6. Proceed to Health Services Office at the chosen schedule/appointment and do the following:\n - 6.1 Sign in the Transaction Logbook in the office lobby\n - 6.2 Submit the required documents\n - 6.3 Accomplish Medical/Dental Form\n - 6.4 Undergo Medical/Dental Examination/ Evaluation\n - 6.5 Sign out on the Transaction Logbook\n - 6.6 Receive the stamped Notice of Admission (NOA)\n7. Submit the following document for enrollment:\n - Approved Application Form for Shifter/Transferee\n - Program Curriculum\n - Stamped Notice of Admission\n - Original Transcript of Records\n - Certificate of Transfer Credentials\n - Clear Copy of PSA/NSO Birth Certificate/ Marriage Certificate if Married female\n"
            ]
        },
        {
            "patterns": [
                "How long is the enrollment process for transferees from other HEIs?",
                "What is the duration of the enrollment process for transferees from other HEIs?",
                "How long does the entire enrollment process take for transferees from other HEIs?",
                "How long will it take to complete all the steps for enrollment as a transferee from other HEIs?",
                "What is the duration of the entire enrollment process for transferees from other HEIs?"
            ],
            "responses": [
                "The enrollment process for transferees from other HEIs typically takes about 1 day, 7 hours, and 25 minutes to complete."
            ]
        },
        {
            "patterns": [
                "Is there a fee for the enrollment process for transferees from other HEIs)?",
                "How much does the enrollment process cost for transferees from other HEIs?",
                "What are the fees for the entire enrollment process for transferees from other HEIs?",
                "Are there any fees I need to pay during the enrollment process for transferees from other HEIs?",
                "How much is the total cost associated with applying for enrollment as a transferee from other HEIs?"
            ],
            "responses": [
                "There are no fees associated with the enrollment process for transferees from other HEIs. The entire enrollment process is free of charge."
            ]
        },
        {
            "patterns": [
                "What are the important dates for the enrollment process for transferees from other HEIs?"
            ],
            "responses": [
                "For important dates regarding the enrollment process, please refer to the official announcements from the Registrar's Office or contact them directly for the most up-to-date information. You can reach the Registrar's Office at:\n\nTelephone: (043) 416-0350 local 214\nEmail: registrar.nasugbu@g.batstate- u.edu.ph"
            ]
        },
        {
            "patterns": [
                "What are the key dates I should be aware of during the enrollment process for transferees from other HEIs?"
            ],
            "responses": [
                "For key dates regarding the enrollment process, please refer to the official announcements from the Registrar's Office or contact them directly for the most up-to-date information. You can reach the Registrar's Office at:\n\nTelephone: (043) 416-0350 local 214\nEmail: registrar.nasugbu@g.batstate- u.edu.ph"
            ]
        },
        {
            "patterns": [
                "Who can I contact for inquiries about the enrollment process for transferees from other Higher Education Institutions (HEIs)?",
                "Who should I reach out to about the enrollment process for transferees from other Higher Education Institutions (HEIs)?",
                "Who do I contact for questions about the enrollment process for transferees from other Higher Education Institutions (HEIs)?",
                "How can I contact the Registrar's Office for questions regarding the enrollment process for transferees from other Higher Education Institutions (HEIs)?",
                "What is the contact information of the Registrar's Office for inquiries related to the enrollment process for transferees from other Higher Education Institutions (HEIs)?"
            ],
            "responses": [
                "For inquiries about the enrollment process for transferees from other HEIs, you can contact the Registrar's Office. Here are the details:\n\nTelephone: (043) 416-0350 local 214\nEmail: registrar.nasugbu@g.batstate- u.edu.ph\n\nPlease feel free to reach out for any questions or assistance regarding enrollment process."
            ]
        },
        {
            "patterns": [
                "What are the requirements for enrollment as a regular student?",
                "What documents do I need to submit for enrollment as a regular student?",
                "What requirements do I need to apply for enrollment as a regular student?",
                "What documents should I prepare to apply for enrollment as a regular student?",
                "What are the required documents for the enrollment process for regular students?"
            ],
            "responses": [
                "To enroll as a regular student at BatStateU ARASOF-Nasugbu, you need to complete the following requirement for the enrollment process:\n\n1. Online Clearance: From the Student Portal"
            ]
        },
        {
            "patterns": [
                "Where can I get the Online Clearance for enrollment as a regular student?",
                "Where can I request the Online Clearance for enrollment as a regular student?",
                "Where can I obtain the Online Clearance for enrollment as a regular student?"
            ],
            "responses": [
                "You can accomplish the Online Clearance through the Student Portal"
            ]
        },
        {
            "patterns": [
                "How do I apply for enrollment as a regular student?",
                "What are the steps for enrollment as a regular student?",
                "What is the enrollment process for regular students?",
                "How do I complete my enrollment as a regular student?",
                "What is the process for enrollment as a regular student?"
            ],
            "responses": [
                "To complete your enrollment as a regular student, please follow these steps:\n\n1. Log in to the Student Portal, then click the link Online Registration and complete the enrollment steps.\n 1.1 Click Step 1 for Scholarship if applicable. \n 1.2 Click Step 2 for Adding of courses:\n  - Click \"Load Proposed Subjects\" to view the possible courses to enroll.\n  - Click the \"Select Subject\" tab to add subjects and find the schedule.\n  - Then, click \"Add\" and continue the process until all subjects/courses are added.\n 1.3 Click Step 3 for viewing of added subjects/courses.\n 1.4 Click Step 4 for Assessment.\n 1.5 Click Step 5 for Enrollment Confirmation."
            ]
        },
        {
            "patterns": [
                "How long is the enrollment process for regular students?",
                "What is the duration of the enrollment process for regular students?",
                "How long does the entire enrollment process take for regular students?",
                "How long will it take to complete all the steps for enrollment as a regular student?",
                "What is the duration of the entire enrollment process for regular students?"
            ],
            "responses": [
                "The enrollment process for regular students at BatStateU ARASOF-Nasugbu typically takes about 10 minutes to complete."
            ]
        },
        {
            "patterns": [
                "Is there a fee for the enrollment process for regular students?",
                "How much does the enrollment process cost for regular students?",
                "What are the fees for the entire enrollment process for regular students?",
                "Are there any fees I need to pay during the enrollment process for regular students?",
                "How much is the total cost associated with applying for enrollment as a regular student?"
            ],
            "responses": [
                "There are no fees associated with the enrollment process for regular students. The entire enrollment process is free of charge."
            ]
        },
        {
            "patterns": [
                "Who can I contact for inquiries about the enrollment process for regular students?",
                "Who should I reach out to about the enrollment process for regular students?",
                "Who do I reach out to for questions about the enrollment process for regular students?",
                "How can I contact the Registrar's Office for questions regarding the enrollment process for regular students?",
                "What is the contact information of the Registrar's Office for inquiries related to the enrollment process for regular students?"
            ],
            "responses": [
                "For inquiries about the enrollment process for regular students, you can contact the Registrar's Office. Here are the details:\n\nTelephone: (043) 416-0350 local 214\nEmail: registrar.nasugbu@g.batstate-u.edu.ph\n\nPlease feel free to reach out for any questions or assistance regarding enrollment process."
            ]
        },
        {
            "patterns": [
                "What are the requirements for enrollment as a irregular student?",
                "What documents do I need to submit for enrollment as a irregular student?",
                "What requirements do I need to apply for enrollment as a irregular student?",
                "What documents should I prepare to apply for enrollment as a irregular student?",
                "What are the required documents for the enrollment process for irregular students?"
            ],
            "responses": [
                "To enroll as an irregular student at BatStateU ARASOF-Nasugbu, please prepare the following documents:\n\n1. Report of Grades (1 Original): From the Student Portal or Registration Services Office.\n2. Proposal Slip (1 Original): From the College/Department.\n3. Program of Study (1 Clear Copy): From the College/Department.\n4. Student ID: From the Student Portal or ICT Department.\n\nConditional Requirement: In case, the student cannot personally process:\n - Authorization letter stating the processes to be undertaken by the representative (1 Original)\n - Clear photocopy of student ID (1 copy) and any valid ID of the representative (1 copy), with three (3) specimen signatures"
            ]
        },
        {
            "patterns": [
                "Where can I get the Report of Grades for enrollment as an irregular student?",
                "Where can I request the Report of Grades for enrollment as an irregular student?",
                "Where can I obtain the Report of Grades for enrollment as an irregular student?",
                "Where can I get the Report of Grades for enrollment as an overstaying student?",
                "Where can I request the Report of Grades for enrollment as an overstaying student?",
                "Where can I obtain the Report of Grades for enrollment as an overstaying student?",
                "Where can I get the Report of Grades for enrollment as a returnee student?",
                "Where can I request the Report of Grades for enrollment as a returnee student?",
                "Where can I obtain the Report of Grades for enrollment as a returnee student?",
                "Where can I get the Report of Grades for late enrollment?",
                "Where can I request the Report of Grades for late enrollment?",
                "Where can I obtain the Report of Grades for late enrollment?"
            ],
            "responses": [
                "You can obtain the Report of Grades from the Student Portal or the Registration Services Office."
            ]
        },
        {
            "patterns": [
                "Where can I get the Proposal Slip for enrollment as an irregular student?",
                "Where can I request the Proposal Slip for enrollment as an irregular student?",
                "Where can I obtain the Proposal Slip for enrollment as an irregular student?",
                "Where can I get the Proposal Slip for enrollment as an overstaying student?",
                "Where can I request the Proposal Slip for enrollment as an overstaying student?",
                "Where can I obtain the Proposal Slip for enrollment as an overstaying student?",
                "Where can I get the Proposal Slip for enrollment as a returnee student?",
                "Where can I request the Proposal Slip for enrollment as a returnee student?",
                "Where can I obtain the Proposal Slip for enrollment as a returnee student?"
            ],
            "responses": [
                "You can obtain the Proposal Slip from your College or Department."
            ]
        },
        {
            "patterns": [
                "Where can I get the Program of Study for enrollment as an irregular student?",
                "Where can I request the Program of Study for enrollment as an irregular student?",
                "Where can I obtain the Program of Study for enrollment as an irregular student?",
                "Where can I get the Program of Study for enrollment as an overstaying student?",
                "Where can I request the Program of Study for enrollment as an overstaying student?",
                "Where can I obtain the Program of Study for enrollment as an overstaying student?",
                "Where can I get the Program of Study for enrollment as a returnee student?",
                "Where can I request the Program of Study for enrollment as a returnee student?",
                "Where can I obtain the Program of Study for enrollment as a returnee student?",
                "Where can I get the Program of Study for late enrollment?",
                "Where can I request the Program of Study for late enrollment?",
                "Where can I obtain the Program of Study for late enrollment?"
            ],
            "responses": [
                "You can obtain the Program of Study from your College or Department."
            ]
        },
        {
            "patterns": [
                "Where can I get the Student ID for enrollment as an irregular student?",
                "Where can I request the Student ID for enrollment as an irregular student?",
                "Where can I obtain the Student ID for enrollment as an irregular student?",
                "Where can I get the Student ID for enrollment as an overstaying student?",
                "Where can I request the Student ID for enrollment as an overstaying student?",
                "Where can I obtain the Student ID for enrollment as an overstaying student?",
                "Where can I get the Student ID for enrollment as a returnee student?",
                "Where can I request the Student ID for enrollment as a returnee student?",
                "Where can I obtain the Student ID for enrollment as a returnee student?",
                "Where can I get my Student ID for late enrollment?",
                "Where can I request my Student ID for late enrollment?",
                "Where can I obtain my Student ID for late enrollment?"
            ],
            "responses": [
                "You can obtain the Student ID through the Student Portal or the ICT Department."
            ]
        },
        {
            "patterns": [
                "How do I apply for enrollment as a irregular student?",
                "What are the steps for enrollment as a irregular student?",
                "What is the enrollment process for irregular students?",
                "How do I complete my enrollment as a irregular student?",
                "What is the process for enrollment as a irregular student?"
            ],
            "responses": [
                "To complete your enrollment as an irregular student at BatStateU ARASOF-Nasugbu, please follow these steps:\n\n1. Proceed to the college/department for evaluation of Report of Grades \n2. Proceed to the Registration Services Office for the validation of enrolled courses and manual enrollment of other courses"
            ]
        },
        {
            "patterns": [
                "How long is the enrollment process for irregular students?",
                "What is the duration of the enrollment process for irregular students?",
                "How long does the entire enrollment process take for irregular students?",
                "How long will it take to complete all the steps for enrollment as a irregular student?",
                "What is the duration of the entire enrollment process for irregular students?"
            ],
            "responses": [
                "The enrollment process for irregular students at BatStateU ARASOF-Nasugbu typically takes about 1 hour to complete."
            ]
        },
        {
            "patterns": [
                "Is there a fee for the enrollment process for irregular students?",
                "How much does the enrollment process cost for irregular students?",
                "What are the fees for the entire enrollment process for irregular students?",
                "Are there any fees I need to pay during the enrollment process for irregular students?",
                "How much is the total cost associated with applying for enrollment as a irregular student?"
            ],
            "responses": [
                "There are no fees associated with the enrollment process for irregular students. The entire enrollment process is free of charge."
            ]
        },
        {
            "patterns": [
                "Who can I contact for inquiries about the enrollment process for irregular students?",
                "Who should I reach out to about the enrollment process for irregular students?",
                "Who do I reach out to for questions about the enrollment process for irregular students?",
                "How can I contact the Registrar's Office for questions regarding the enrollment process for irregular students?",
                "What is the contact information of the Registrar's Office for inquiries related to the enrollment process for irregular students?"
            ],
            "responses": [
                "For inquiries about the enrollment process for irregular students, you can contact the Registrar's Office. Here are the details:\n\nTelephone: (043) 416-0350 local 214\nEmail: registrar.nasugbu@g.batstate-u.edu.ph\n\nPlease feel free to reach out for any questions or assistance regarding enrollment process."
            ]
        },
        {
            "patterns": [
                "What are the requirements for enrollment as an overstaying student?",
                "What documents do I need to submit for enrollment as an overstaying student?",
                "What requirements do I need to apply for enrollment as an overstaying student?",
                "What documents should I prepare to apply for enrollment as an overstaying student?",
                "What are the required documents for the enrollment process for overstaying students?"
            ],
            "responses": [
                "To enroll as an overstaying  student at BatStateU ARASOF-Nasugbu, please prepare the following documents:\n\n1. Report of Grades (1 Original): From the Student Portal or Registration Services Office.\n2. Proposal Slip (1 Original): From the College/Department.\n3. Program of Study (1 Clear Copy): From the College/Department.\n4. Approved Request for Equivalency (if applicable) (1 Original): From the College/Department.\n5. Official Receipt (1 Original/1 e-receipt): From the Cashiering Office.\n6. Student ID: From the Student Portal or ICT Department\n\nConditional Requirement: In case, the student cannot personally process:\n - Authorization letter stating the processes to be undertaken by the representative (1 Original)\n - Clear photocopy of student ID (1 copy) and any valid ID of the representative (1 copy), with three (3) specimen signatures"
            ]
        },
        {
            "patterns": [
                "Where can I get the Approved Request for Equivalency for enrollment as an overstaying student?",
                "Where can I request the Approved Request for Equivalency for enrollment as an overstaying student?",
                "Where can I obtain the Approved Request for Equivalency for enrollment as an overstaying student?",
                "Where can I get the Approved Request for Equivalency for enrollment as a returnee student?",
                "Where can I request the Approved Request for Equivalency for enrollment as a returnee student?",
                "Where can I obtain the Approved Request for Equivalency for enrollment as a returnee student?"
            ],
            "responses": [
                "You can obtain the Request for Equivalency from your College or Department."
            ]
        },
        {
            "patterns": [
                "Where can I get the Official Receipt for enrollment as an overstaying student?",
                "Where can I request the Official Receipt for enrollment as an overstaying student?",
                "Where can I obtain the Official Receipt for enrollment as an overstaying student?",
                "Where can I get the Official Receipt for enrollment as a returnee student?",
                "Where can I request the Official Receipt for enrollment as a returnee student?",
                "Where can I obtain the Official Receipt for enrollment as a returnee student?"
            ],
            "responses": [
                "You can obtain the Official Reciept from the Cashiering Office."
            ]
        },
        {
            "patterns": [
                "How do I apply for enrollment as an overstaying student?",
                "What are the steps for enrollment as an overstaying student?",
                "What is the enrollment process for overstaying students?",
                "How do I complete my enrollment as an overstaying student?",
                "What is the process for enrollment as an overstaying student?"
            ],
            "responses": [
                "To complete your enrollment as an overstaying student at BatStateU ARASOF-Nasugbu, please follow these steps:\n\n1. Proceed to the college/department for evaluation of Report of Grades \n2. Proceed to the Registration Services Office for enrollment of courses\n3. Submit the required documents to the Accounting Office for assessment\n4. Proceed to the Cashiering Office for payment\n5. Proceed to the Registration Services Office for validation of enrollment"
            ]
        },
        {
            "patterns": [
                "How long is the enrollment process for overstaying students?",
                "What is the duration of the enrollment process for overstaying students?",
                "How long does the entire enrollment process take for overstaying students?",
                "How long will it take to complete all the steps for enrollment as an overstaying student?",
                "What is the duration of the entire enrollment process for overstaying students?"
            ],
            "responses": [
                "The enrollment process for overstaying students at BatStateU ARASOF-Nasugbu typically takes about 1 hour to complete."
            ]
        },
        {
            "patterns": [
                "Is there a fee for the enrollment process for overstaying students?",
                "How much does the enrollment process cost for overstaying students?",
                "What are the fees for the entire enrollment process for overstaying students?",
                "Are there any fees I need to pay during the enrollment process for overstaying students?",
                "How much is the total cost associated with applying for enrollment as an overstaying student?"
            ],
            "responses": [
                "Here are the fees for enrollment as an overstaying student at BatStateU ARASOF-Nasugbu:\n\n- Tuition Fee – Php 250/unit \n- Registration – Php 260\n- Library Fee – PHP 622 \n- Athletic Fee – PHP 380 \n- Publication Fee – Php 380\n- Medical & Dental Fee – Php 380\n- Guidance Fee – Php 260 \n- Laboratory Fee -Php 751 \n- NSTP – Php 375\n- Anti-TB – Php 15 \n- SCUAA – Php 130\n- Cultural Fee – Php 173 \n- Security Fee – Php 173 \n- HEMF – Php 86/unit \n- Internet – Php 300 \n- SSC – Php 25\n- Insurance – Php 50\n**Non-Resident Fee – Php 10,000\n***RLE Fee = (Total Honorarium of Faculty + 30% Indirect Cost)/Total Number of Enrolled Students"
            ]
        },
        {
            "patterns": [
                "Who can I contact for inquiries about the enrollment process for overstaying students?",
                "Who should I reach out to about the enrollment process for overstaying students?",
                "Who do I reach out to for questions about the enrollment process for overstaying students?",
                "How can I contact the Registrar's Office for questions regarding the enrollment process for overstaying students?",
                "What is the contact information of the Registrar's Office for inquiries related to the enrollment process for overstaying students?"
            ],
            "responses": [
                "For inquiries about the enrollment process for overstaying students, you can contact the Registrar's Office. Here are the details:\n\nTelephone: (043) 416-0350 local 214\nEmail: registrar.nasugbu@g.batstate-u.edu.ph\n\nPlease feel free to reach out for any questions or assistance regarding enrollment process."
            ]
        },
        {
            "patterns": [
                "What are the requirements for enrollment as a returnee student?",
                "What documents do I need to submit for enrollment as a returnee student?",
                "What requirements do I need to apply for enrollment as a returnee student?",
                "What documents should I prepare to apply for enrollment as a returnee student?",
                "What are the required documents for the enrollment process for returnee students?"
            ],
            "responses": [
                "To enroll as a returnee student at BatStateU ARASOF-Nasugbu, please prepare the following documents:\n\n1. Report of Grades (1 Certified True Copy): From the Student Portal or Registration Services Office.\n2. Evaluation Form for Returnee ( 1 Original): From the Student Portal or Registration Services Office.\n3. Approved Leave of Absence (LOA), if applicable (1 Clear Copy)\n4. Proposal Slip (1 Original): From the College/Department.\n5. Program of Study (1 Clear Copy): From the College/Department.\n6. Approved Request for Equivalency (if applicable) (1 Original): From the College/Department.\n7. Student ID: From the Student Portal or ICT Department\nProgram Curriculum (1 Clear Copy): From the College/Department.\n\nConditional Requirement: In case, the student cannot personally process:\n - Authorization letter stating the processes to be undertaken by the representative (1 Original)\n - Clear photocopy of student ID (1 copy) and any valid ID of the representative (1 copy), with three (3) specimen signatures"
            ]
        },
        {
            "patterns": [
                "Where can I get the Evaluation Form for enrollment as a returnee student?",
                "Where can I request the Evaluation Form for enrollment as a returnee student?",
                "Where can I obtain the Evaluation Form for enrollment as a returnee student?"
            ],
            "responses": [
                "You can obtain the Evaluation Form for Returnee from the Student Portal or the Registration Services Office."
            ]
        },
        {
            "patterns": [
                "Where can I get the Program Curriculum for enrollment as a returnee student?",
                "Where can I request the Program Curriculum for enrollment as a returnee student?",
                "Where can I obtain the Program Curriculum for enrollment as a returnee student?"
            ],
            "responses": [
                "You can obtain the Program Curriculum from your College or Department."
            ]
        },
        {
            "patterns": [
                "How do I apply for enrollment as a returnee student?",
                "What are the steps for enrollment as a returnee student?",
                "What is the enrollment process for returnee students?",
                "How do I complete my enrollment as a returnee student?",
                "What is the process for enrollment as a returnee student?"
            ],
            "responses": [
                "To complete your enrollment as a returnee student at BatStateU ARASOF-Nasugbu, please follow these steps:\n\n1. Secure an Evaluation Form for Returnee, download the form from Student Portal or request thru the official email address of the Registration Services Office: registrar.nasugbu@g.batstate- u.edu.ph\n2. Submit the Evaluation Form for Returnee to the college/department for evaluation\n3. Proceed to the Registration Services Office for enrollment"
            ]
        },
        {
            "patterns": [
                "How long is the enrollment process for returnee students?",
                "What is the duration of the enrollment process for returnee students?",
                "How long does the entire enrollment process take for returnee students?",
                "How long will it take to complete all the steps for enrollment as a returnee student?",
                "What is the duration of the entire enrollment process for returnee students?"
            ],
            "responses": [
                "The enrollment process for returnee students at BatStateU ARASOF-Nasugbu typically takes about 1 hour to complete."
            ]
        },
        {
            "patterns": [
                "Is there a fee for the enrollment process for returnee students?",
                "How much does the enrollment process cost for returnee students?",
                "What are the fees for the entire enrollment process for returnee students?",
                "Are there any fees I need to pay during the enrollment process for returnee students?",
                "How much is the total cost associated with applying for enrollment as a returnee student?"
            ],
            "responses": [
                "There are no fees associated with the enrollment process for returnee students. The entire enrollment process is free of charge."
            ]
        },
        {
            "patterns": [
                "Who can I contact for inquiries about the enrollment process for returnee students?",
                "Who should I reach out to about the enrollment process for returnee students?",
                "Who do I reach out to for questions about the enrollment process for returnee students?",
                "How can I contact the Registrar's Office for questions regarding the enrollment process for returnee students?",
                "What is the contact information of the Registrar's Office for inquiries related to the enrollment process for returnee students?"
            ],
            "responses": [
                "For inquiries about the enrollment process for returnee students, you can contact the Registrar's Office. Here are the details:\n\nTelephone: (043) 416-0350 local 214\nEmail: registrar.nasugbu@g.batstate-u.edu.ph\n\nPlease feel free to reach out for any questions or assistance regarding enrollment process."
            ]
        },
        {
            "patterns": [
                "What are the requirements for enrollment as a late enrollee?",
                "What documents do I need to submit for enrollment as a late enrollee?",
                "What requirements do I need to apply for enrollment as a late enrollee?",
                "What documents should I prepare to apply for enrollment as a late enrollee?",
                "What are the required documents for the enrollment process for late enrollees at BatStateU ARASOF-Nasugbu?",
                "What are the requirements for late enrollment?",
                "What documents do I need to submit for late enrollment?",
                "What requirements do I need to apply for late enrollment?",
                "What documents should I prepare to apply for late enrollment?",
                "What are the required documents for the late enrollment process?"
            ],
            "responses": [
                "To enroll as a late enrollee at BatStateU ARASOF-Nasugbu, please prepare the following documents:\n\n1. Accommodation Form for Late Enrollment (1 Original): From the College/Department.\n2. Program of Study , if applicable (1 Clear Copy): From the College/Department.\n3. Report of Grades (1 Certified True Copy): From the Student Portal or Registration Services Office.\n4. Student ID: From the Student Portal or ICT Department\n\nConditional Requirement: In case, the student cannot personally process:\n - Authorization letter stating the processes to be undertaken by the representative (1 Original)\n - Clear photocopy of student ID (1 copy) and any valid ID of the representative (1 copy), with three (3) specimen signatures"
            ]
        },
        {
            "patterns": [
                "Where can I get the Accommodation Form for late enrollment?",
                "Where can I request the Accommodation Form for late enrollment?",
                "Where can I obtain the Accommodation Form for late enrollment?"
            ],
            "responses": [
                "You can obtain the Accomodation Form for Late Enrollment from your College or Department."
            ]
        },
        {
            "patterns": [
                "How do I apply for enrollment as a late enrollee?",
                "What are the steps for enrollment as a late enrollee?",
                "What is the enrollment process for late enrollees?",
                "How do I complete my enrollment as a late enrollee?",
                "What is the process for enrollment as a late enrollee?",
                "How do I apply for late enrollment?",
                "What are the steps for late enrollment?",
                "What is the late enrollment process?",
                "How do I complete my late enrollment?",
                "What is the process for late enrollment?"
            ],
            "responses": [
                "To complete your enrollment as a late enrollee at BatStateU ARASOF-Nasugbu, please follow these steps:\n\n1. Proceed to the college/department for evaluation\n2. Proceed to the Vice Chancellor for Academic Affairs for approval\n3. Submit the approved accommodation form to the Registration Services Office for enrollment"
            ]
        },
        {
            "patterns": [
                "How long is the enrollment process for late enrollees?",
                "What is the duration of the enrollment process for late enrollees?",
                "How long does the entire enrollment process take for late enrollees?",
                "How long will it take to complete all the steps for enrollment as a late enrollee?",
                "What is the duration of the entire enrollment process for late enrollees?",
                "How long is the late enrollment process for students?",
                "What is the duration of the late enrollment process?",
                "How long does the entire late enrollment process take?",
                "How long will it take to complete all the steps for late enrollment?",
                "What is the duration of the entire late enrollment process?"
            ],
            "responses": [
                "The enrollment process for late enrollees at BatStateU ARASOF-Nasugbu typically takes about 1 hour to complete."
            ]
        },
        {
            "patterns": [
                "Is there a fee for the enrollment process for late enrollees?",
                "How much does the enrollment process cost for late enrollees?",
                "What are the fees for the entire enrollment process for late enrollees?",
                "Are there any fees I need to pay during the enrollment process for late enrollees?",
                "How much is the total cost associated with applying for enrollment as a late enrollee?",
                "Is there a fee for the late enrollment process?",
                "How much does the late enrollment process cost?",
                "What are the fees for the entire late enrollment process?",
                "Are there any fees I need to pay during the late enrollment process?",
                "How much is the total cost associated with applying for late enrollment?"
            ],
            "responses": [
                "There are no fees associated with the enrollment process for late enrollees. The entire enrollment process is free of charge."
            ]
        },
        {
            "patterns": [
                "Who can I contact for inquiries about the enrollment process for late enrollees?",
                "Who should I reach out to about the enrollment process for late enrollees?",
                "Who do I reach out to for questions about the enrollment process for late enrollees?",
                "How can I contact the Registrar's Office for questions regarding the enrollment process for late enrollees?",
                "What is the contact information of the Registrar's Office for inquiries related to the enrollment process for late enrollees?"
            ],
            "responses": [
                "For inquiries about the enrollment process for late enrollees, you can contact the Registrar's Office. Here are the details:\n\nTelephone: (043) 416-0350 local 214\nEmail: registrar.nasugbu@g.batstate-u.edu.ph\n\nPlease feel free to reach out for any questions or assistance regarding enrollment process."
            ]
        }
    ]
}