{
    "intents": [
        {
            "patterns": [
                "What are the requirements for admission as an incoming first-year college student?",
                "What documents do I need to submit for admission as an incoming first-year college student?",
                "What requirements do I need to apply for admission as an incoming first-year college student?",
                "What documents should I prepare to apply for admission as an incoming first-year college student?",
                "What are the required documents for the admission process for incoming first-year college students?"
            ],
            "responses": [
                "To apply for admission as an incoming first-year college student at BatStateU ARASOF-Nasugbu, you will need to provide the following requirements:\n\n1. One (1) copy of Grades Form 1 (for Regular Admission) / Grades Form 2 (for ALS)\n2. One (1) certified true copy of Junior High School and Senior High School Form 137\n3. Certification of completion of SHS and respective strand or enrollment therein, if not completed (1 photocopy)\n4. Two (2) copies of recent 2” x 2” pictures with a white background\n5. Form 138 (if the student is a graduate of SHS) – 1 Original\n6. Admission Test Permit – 1 Original\n\nAdditional Requirements for Admission under AAP:\n\nIndigent Applicants:\n  1. Certificate of Indigency of Parent/Guardian\n  2. Certificate of Tax Exemption\n\nAlternative Learning System (ALS):\n  1. Certification of completion of ALS program or enrollment\n\nIndigenous People:\n  1. Certificate of Tribe Membership or equivalent certification\n\nPWD:\n  1. PWD Identification card\n\nIskolar ng Bayan:\n  1. Certification from the public high school, signed by the school principal, confirming the applicant's rank in the Top Ten of the graduating (Grade 12) class"
            ]
        },
        {
            "patterns": [
                "Where can I get Grades Form 1 for admission as an incoming first-year student?",
                "Where can I request Grades Form 1 for admission as an incoming first-year student?",
                "Where can I obtain Grades Form 1 for admission as an incoming first-year student?"
            ],
            "responses": [
                "You can get Grades Form 1 from the College Admission portal at https://dione.batstate-u.edu.ph/tao/#/application."
            ]
        },
        {
            "patterns": [
                "Where can I get Grades Form 2 for admission as an incoming first-year student?",
                "Where can I request Grades Form 2 for admission as an incoming first-year student?",
                "Where can I obtain Grades Form 2 for admission as an incoming first-year student?"
            ],
            "responses": [
                "You can get Grades Form 2 from the College Admission portal at https://dione.batstate-u.edu.ph/tao/#/application."
            ]
        },
        {
            "patterns": [
                "Where can I get the Form 137 for admission as an incoming first-year student?",
                "Where can I request the Form 137 for admission as an incoming first-year student?",
                "Where can I obtain the Form 137 for admission as an incoming first-year student?"
            ],
            "responses": [
                "You can obtain the certified true copy of Form 137 from your current or previous school."
            ]
        },
        {
            "patterns": [
                "Where can I get a certification of SHS completion or enrollment for admission as an incoming first-year student?",
                "Where can I request a certification of SHS completion or enrollment for admission as an incoming first-year student?",
                "Where can I obtain a certification of SHS completion or enrollment for admission as an incoming first-year student?"
            ],
            "responses": [
                "You can obtain the certification of SHS completion or enrollment from your current or previous school."
            ]
        },
        {
            "patterns": [
                "Where can I get Form 138 for admission as an incoming first-year student?",
                "Where can I request Form 138 for admission as an incoming first-year student?",
                "Where can I obtain Form 138 for admission as an incoming first-year student?"
            ],
            "responses": [
                "You can obtain Form 138 from your senior high school."
            ]
        },
        {
            "patterns": [
                "Where can I get the admission test permit for admission as an incoming first-year student?",
                "Where can I request the admission test permit for admission as an incoming first-year student?",
                "Where can I obtain the admission test permit for admission as an incoming first-year student?"
            ],
            "responses": [
                "You can obtain the admission test permit from the College Applicant’s Portal."
            ]
        },
        {
            "patterns": [
                "Where can I get a certificate of indigency for admission as an incoming first-year student?",
                "Where can I request a certificate of indigency for admission as an incoming first-year student?",
                "Where can I obtain a certificate of indigency for admission as an incoming first-year student?"
            ],
            "responses": [
                "You can obtain the certificate of indigency from the Office of the Barangay."
            ]
        },
        {
            "patterns": [
                "Where can I get a certificate of tax exemption for admission as an incoming first-year student?",
                "Where can I request a certificate of tax exemption for admission as an incoming first-year student?",
                "Where can I obtain a certificate of tax exemption for admission as an incoming first-year student?"
            ],
            "responses": [
                "You can obtain the certificate of tax exemption from the Bureau of Internal Revenue (BIR)."
            ]
        },
        {
            "patterns": [
                "Where can I get a certification of ALS program completion or enrollment for admission as an incoming first-year student?",
                "Where can I request a certification of ALS program completion or enrollment for admission as an incoming first-year student?",
                "Where can I obtain a certification of ALS program completion or enrollment for admission as an incoming first-year student?"
            ],
            "responses": [
                "You can obtain the certification of ALS program completion or enrollment from the ALS graduates' current or previous school."
            ]
        },
        {
            "patterns": [
                "Where can I get a certificate of tribe membership for admission as an incoming first-year student?",
                "Where can I request a certificate of tribe membership for admission as an incoming first-year student?",
                "Where can I obtain a certificate of tribe membership for admission as an incoming first-year student?"
            ],
            "responses": [
                "You can obtain the certificate of tribe membership from the National Commission on Indigenous People."
            ]
        },
        {
            "patterns": [
                "Where can I get a PWD identification card for admission as an incoming first-year student?",
                "Where can I request a PWD identification card for admission as an incoming first-year student?",
                "Where can I obtain a PWD identification card for admission as an incoming first-year student?"
            ],
            "responses": [
                "You can obtain the PWD identification card from the Persons with Disability Affairs Office (PDAO)."
            ]
        },
        {
            "patterns": [
                "Where can I get a certification confirming my rank in the Top Ten of my graduating class for admission as an incoming first-year student?",
                "Where can I request a certification confirming my rank in the Top Ten of my graduating class for admission as an incoming first-year student?",
                "Where can I obtain a certification confirming my rank in the Top Ten of my graduating class for admission as an incoming first-year student?"
            ],
            "responses": [
                "You can obtain the certification confirming your rank in the Top Ten of your graduating class from your public senior high school, signed by the school principal."
            ]
        },
        {
            "patterns": [
                "How do I apply for admission as an incoming first-year student?",
                "What are the steps for admission as an incoming first-year student?",
                "What is the admission process for incoming first-year students?",
                "How do I complete my admission as an incoming first-year student?",
                "What is the process for admission as an incoming first-year student?"
            ],
            "responses": [
                "To complete your admission as an incoming first-year student, please follow these steps:\n\n1. Fill out the application form and upload the scanned copy of documentary requirements at https://dione.batstate-u.edu.ph/tao/#/application.\n2. Check the college application portal for the schedule of examination.\n3. Take the Admission Test.\n4. Wait for the examination results."
            ]
        },
        {
            "patterns": [
                "How long is the admission process for incoming first-year students?",
                "What is the duration of the admission process for incoming first-year students?",
                "How long does the entire admission process take for incoming first-year students?",
                "How long will it take to complete all the steps for admission as an incoming first-year student?",
                "What is the duration of the entire admission process for incoming first-year students?"
            ],
            "responses": [
                "The admission process for incoming first-year students at BatStateU ARASOF-Nasugbu typically takes about 2 months, 3 weeks, 5 days, 4 hours, 30 minutes to complete."
            ]
        },
        {
            "patterns": [
                "How long does the admission test take for incoming first-year students?",
                "What is the duration of the admission test for incoming first-year students?",
                "How long is the admission test for incoming first-year students?",
                "How much time do I need for the admission test as an incoming first-year student?",
                "What is the time allotted for the admission test for incoming first-year students?"
            ],
            "responses": [
                "The admission test for incoming first-year students at BatStateU ARASOF-Nasugbu typically takes about 2 hours to complete."
            ]
        },
        {
            "patterns": [
                "Is there a fee for the admission process for incoming first-year students?",
                "How much does the admission process cost for incoming first-year students?",
                "What are the fees for the entire admission process for incoming first-year students?",
                "Are there any fees I need to pay during the admission process for incoming first-year students?",
                "How much is the total cost associated with applying for admission as an incoming first-year student?"
            ],
            "responses": [
                "There are no fees associated with the admission process for incoming first-year students. The entire admission process is free of charge."
            ]
        },
        {
            "patterns": [
                "When is the admission test for incoming first-year students?",
                "When is the admission test for college transferees?"
            ],
            "responses": [
                "For the admission test schedule, please check the official pages of the Testing and Admission Office or contact them directly for the most up-to-date information. You can reach the Testing and Admission Office at:\n\nTelephone: +63 43 416-0350 local 216\nEmail: tao.nasugbu@g.batstate-u.edu.ph\nOfficial Facebook Page: https://fb.com/TestingAndAdmissionOffice"
            ]
        },
        {
            "patterns": [
                "When is the release of the admission test results for incoming first-year students?",
                "When is the release of the admission test results for college transferees ?"
            ],
            "responses": [
                "The release date for admission test results will be announced on the official pages of the Testing and Admission Office. For the latest updates, you can contact them directly:\n\nTelephone: +63 43 416-0350 local 216\nEmail: tao.nasugbu@g.batstate-u.edu.ph\nOfficial Facebook Page: https://fb.com/TestingAndAdmissionOffice"
            ]
        },
        {
            "patterns": [
                "When is the admission period for incoming first-year students?"
            ],
            "responses": [
                "For the admission period for incoming first-year students, please refer to the official announcements from the Testing and Admission Office or contact them directly for the most up-to-date information. You can reach the Testing and Admission Office at:\n\nTelephone: +63 43 416-0350 local 216\nEmail: tao.nasugbu@g.batstate-u.edu.ph\nOfficial Facebook Page: https://fb.com/TestingAndAdmissionOffice"
            ]
        },
        {
            "patterns": [
                "When is the deadline for admission for incoming first-year students?"
            ],
            "responses": [
                "For the deadline of admission for incoming first-year students, please refer to the official announcements from the Testing and Admission Office or contact them directly for the most up-to-date information. You can reach the Testing and Admission Office at:\n\nTelephone: +63 43 416-0350 local 216\nEmail: tao.nasugbu@g.batstate-u.edu.ph\nOfficial Facebook Page: https://fb.com/TestingAndAdmissionOffice"
            ]
        },
        {
            "patterns": [
                "Who can I contact for inquiries about the admission process for incoming first-year students?",
                "Who should I reach out to about the admission process for incoming first-year students?",
                "Who do I reach out to for questions about the admission process for incoming first-year students?",
                "How can I contact the Testing and Admission Office for questions regarding the admission process for incoming first-year students?",
                "What is the contact information of the Testing and Admission Office for inquiries related to the admission process for incoming first-year students?"
            ],
            "responses": [
                "For inquiries about the admission process for incoming first-year students, you can contact the Testing and Admission Office. Here are the details:\n\nTelephone: 416-0350 local 216\nEmail: tao.nasugbu@g.batstate-u.edu.ph\nOfficial Facebook Page: https://fb.com/TestingAndAdmissionOffice\n\nPlease feel free to reach out for any questions or assistance regarding the admission process."
            ]
        },
        {
            "patterns": [
                "What are the requirements for admission as a college transferee?",
                "What documents do I need to submit for admission as a college transferee?",
                "What requirements do I need to apply for admission as a college transferee?",
                "What documents should I prepare to apply for admission as a college transferee?",
                "What are the required documents for the admission process for college transferees?"
            ],
            "responses": [
                "To apply for admission as a college transferee at BatStateU ARASOF-Nasugbu, you will need to provide the following requirements:\n\n1. One (1) copy of the Filled-out Application Form (BatStateU-FO-REG-12)\n2. One (1) copy of the Endorsement Letter"
            ]
        },
        {
            "patterns": [
                "Where can I get the BatStateU-FO-REG-12 application form for admission as a college transferee?",
                "Where can I request the BatStateU-FO-REG-12 application form for admission as a college transferee?",
                "Where can I obtain the BatStateU-FO-REG-12 application form for admission as a college transferee?"
            ],
            "responses": [
                "You can obtain the BatStateU-FO-REG-12 application form at the Testing and Admission Office, Registration Services Office, or your college."
            ]
        },
        {
            "patterns": [
                "Where can I get the endorsement letter required for admission as a college transferee?",
                "Where can I request the endorsement letter for admission as a college transferee?",
                "Where can I obtain the endorsement letter for admission as a college transferee?"
            ],
            "responses": [
                "You can obtain the endorsement letter from your college."
            ]
        },
        {
            "patterns": [
                "How do I apply for admission as a college transferee?",
                "What are the steps for admission as a college transferee?",
                "What is the admission process for college transferees?",
                "How do I complete my admission as a college transferee?",
                "What is the process for admission as a college transferee?"
            ],
            "responses": [
                "To complete your admission as an college transferee, please follow these steps:\n\n1. Submit the filled-out application form and TOR to the concerned college.\n2. Proceed to TAO and present the evaluated application documents and Endorsement Letter.\n3. Secure admission test permit\n4. Take the BatStateUCAT on the scheduled date\n5. Receive admission result."
            ]
        },
        {
            "patterns": [
                "How long is the admission process for college transferees?",
                "What is the duration of the admission process for college transferees?",
                "How long does the entire admission process take for college transferees?",
                "How long will it take to complete all the steps for admission as a college transferee?",
                "What is the duration of the entire admission process for college transferees?"
            ],
            "responses": [
                "The admission process for college transferees at BatStateU ARASOF-Nasugbu typically takes about 1 day, 3 hours, and 7 minutes to complete."
            ]
        },
        {
            "patterns": [
                "How long does the admission test take for college transferees?",
                "What is the duration of the admission test for college transferees?",
                "How long is the admission test for college transferees?",
                "How much time do I need for the admission test as a college transferee?",
                "What is the time allotted for the admission test for college transferees?"
            ],
            "responses": [
                "The admission test for college transferees at BatStateU ARASOF-Nasugbu typically takes about 2 hours to complete."
            ]
        },
        {
            "patterns": [
                "Is there a fee for the admission process for college transferees?",
                "How much does the admission process cost for college transferees?",
                "What are the fees for the entire admission process for college transferees?",
                "Are there any fees I need to pay during the admission process for college transferees?",
                "How much is the total cost associated with applying for admission as a college transferee?"
            ],
            "responses": [
                "There are no fees associated with the admission process for college transferees. The entire admission process is free of charge."
            ]
        },
        {
            "patterns": [
                "When is the admission period for college transferees ?",
                "When is the admission period for foreign applicants?",
                "When is the admission period for applicants to the Laboratory School?",
                "When is the admission period for Kindergarten applicants to the Laboratory School?",
                "When is the admission period for Elementary applicants to the Laboratory School?",
                "When is the admission period for Grade 7 applicants to the Laboratory School?"
            ],
            "responses": [
                "For the admission period, please refer to the official announcements from the Testing and Admission Office or contact them directly for the most up-to-date information. You can reach the Testing and Admission Office at:\n\nTelephone: +63 43 416-0350 local 216\nEmail: tao.nasugbu@g.batstate-u.edu.ph\nOfficial Facebook Page: https://fb.com/TestingAndAdmissionOffice"
            ]
        },
        {
            "patterns": [
                "When is the deadline for admission for college transferees ?",
                "When is the deadline for admission for foreign applicants?",
                "When is the deadline for admission to the Laboratory School?",
                "When is the deadline for Kindergarten admission to the Laboratory School?",
                "When is the deadline for Elementary admission to the Laboratory School?",
                "When is the deadline for Grade 7 admission to the Laboratory School?"
            ],
            "responses": [
                "For the deadline of admission, please refer to the official announcements from the Testing and Admission Office or contact them directly for the most up-to-date information. You can reach the Testing and Admission Office at:\n\nTelephone: +63 43 416-0350 local 216\nEmail: tao.nasugbu@g.batstate-u.edu.ph\nOfficial Facebook Page: https://fb.com/TestingAndAdmissionOffice"
            ]
        },
        {
            "patterns": [
                "Who can I contact for inquiries about the admission process for college transferees ?",
                "Who should I reach out to about the admission process for college transferees ?",
                "Who do I reach out to for questions about the admission process for college transferees ?",
                "How can I contact the Testing and Admission Office for questions regarding the admission process for college transferees ?",
                "What is the contact information of the Testing and Admission Office for inquiries related to the admission process for college transferees ?"
            ],
            "responses": [
                "For inquiries about the admission process for college transferees, you can contact the Testing and Admission Office. Here are the details:\n\nTelephone: 416-0350 local 216\nEmail: tao.nasugbu@g.batstate-u.edu.ph\nOfficial Facebook Page: https://fb.com/TestingAndAdmissionOffice\n\nPlease feel free to reach out for any questions or assistance regarding the admission process."
            ]
        },
        {
            "patterns": [
                "What are the requirements for admission as a foreign applicant?",
                "What documents do I need to submit for admission as a foreign applicant?",
                "What requirements do I need to apply for admission as a foreign applicant?",
                "What documents should I prepare to apply for admission as a foreign applicant?",
                "What are the required documents for the admission process for foreign applicant?"
            ],
            "responses": [
                "To apply for admission as a foreign applicant at BatStateU ARASOF-Nasugbu, you will need to provide the following requirements:\n\n1. One (1) copy of Application Form BatStateU-FO-EAO-01 \n2. One (1) copy of the Endorsement Letter"
            ]
        },
        {
            "patterns": [
                "Where can I get the BatStateU-FO-EAO-01 application form for admission as a foreign applicant?",
                "Where can I request theBatStateU-FO-EAO-01 application form for admission as a foreign applicant?",
                "Where can I obtain the BatStateU-FO-EAO-01 application form for admission as a foreign applicant?"
            ],
            "responses": [
                "You can obtain the BatStateU-FO-EAO-01 application form at the Testing and Admission Office, or the university website."
            ]
        },
        {
            "patterns": [
                "Where can I get the endorsement letter required for admission as a foreign applicant?",
                "Where can I request the endorsement letter for admission as a foreign applicant?",
                "Where can I obtain the endorsement letter for admission as a foreign applicant?"
            ],
            "responses": [
                "You can obtain the endorsement letter from the External Affairs Office."
            ]
        },
        {
            "patterns": [
                "How do I apply for admission as a foreign applicant?",
                "What are the steps for admission as a foreign applicant?",
                "What is the admission process for foreign applicant?",
                "How do I complete my admission as a foreign applicant?",
                "What is the process for admission as a foreign applicant?"
            ],
            "responses": [
                "To complete your admission as an foreign applicant, please follow these steps:\n\n1. Submit the application form and other requirements.\n2. Submit the evaluated application form and Endorsement Letter to Testing and Admission Office.\n3. Secure Notice of Admission"
            ]
        },
        {
            "patterns": [
                "How long is the admission process for foreign applicants?",
                "What is the duration of the admission process for foreign applicants?",
                "How long does the entire admission process take for foreign applicants?",
                "How long will it take to complete all the steps for admission as a foreign applicant?",
                "What is the duration of the entire admission process for foreign applicants?"
            ],
            "responses": [
                "The admission process for foreign applicants at BatStateU ARASOF-Nasugbu typically takes about 7 days to complete."
            ]
        },
        {
            "patterns": [
                "Is there a fee for the admission process for foreign applicants?",
                "How much does the admission process cost for foreign applicants?",
                "What are the fees for the entire admission process for foreign applicants?",
                "Are there any fees I need to pay during the admission process for foreign applicants?",
                "How much is the total cost associated with applying for admission as a foreign applicant?"
            ],
            "responses": [
                "There are no fees associated with the admission process for foreign applicants. The entire admission process is free of charge."
            ]
        },
        {
            "patterns": [
                "Who can I contact for inquiries about the admission process for foreign applicants?",
                "Who should I reach out to about the admission process for foreign applicants?",
                "Who do I reach out to for questions about the admission process for foreign applicants?",
                "How can I contact the Testing and Admission Office for questions regarding the admission process for foreign applicants?",
                "What is the contact information of the Testing and Admission Office for inquiries related to the admission process for foreign applicants?"
            ],
            "responses": [
                "For inquiries about the admission process for foreign applicants, you can contact the Testing and Admission Office. Here are the details:\n\nTelephone: 416-0350 local 216\nEmail: tao.nasugbu@g.batstate-u.edu.ph\nOfficial Facebook Page: https://fb.com/TestingAndAdmissionOffice\n\nPlease feel free to reach out for any questions or assistance regarding the admission process."
            ]
        },
        {
            "patterns": [
                "What are the requirements for admission to the Laboratory School ?",
                "What documents do I need to submit for admission to the Laboratory School?",
                "What requirements do I need to apply for admission to the Laboratory School?",
                "What documents should I prepare to apply for admission to the Laboratory School?",
                "What are the required documents for the admission process to the Laboratory School?"
            ],
            "responses": [
                "To apply for admission to the Laboratory School at BatStateU ARASOF-Nasugbu, you will need to provide the following requirements:\n\n1. One (1) copy of Filled Out Application Form (BatStateU-FO-TAO-01-A_Application-Form-for-Integrated-School-and-Laboratory-SchoolAdmission) \n2. Admission Test Permit.\n3. 2 recent 2” x 2” pictures of good quality, white background \n4. Birth Certificate - 1 Original, 1 Photocopy (For Kindergarten Applicants)\n5. Previous report card based on current grade level (For Grade 7 applicants) (Original and 1 Photocopy)\n6. One (1) copy of Official Receipt\n\n"
            ]
        },
        {
            "patterns": [
                "What are the requirements for admission as a Kindergarten applicant?",
                "What documents do I need to submit for admission as a Kindergarten applicant?",
                "What requirements do I need to apply for admission as a Kindergarten applicant?",
                "What documents should I prepare to apply for admission as a Kindergarten applicant?",
                "What are the required documents for the admission process for Kindergarten applicants?"
            ],
            "responses": [
                "To apply for admission as a Kindergarten applicant at BatStateU ARASOF-Nasugbu, you will need to provide the following requirements:\n\n1. One (1) copy of Filled Out Application Form (BatStateU-FO-TAO-01-A_Application-Form-for-Integrated-School-and-Laboratory-SchoolAdmission) \n2. Admission Test Permit.\n3. 2 recent 2” x 2” pictures of good quality, white background \n4. Birth Certificate - 1 Original, 1 Photocopy\n5. One (1) copy of Official Receipt"
            ]
        },
        {
            "patterns": [
                "What are the requirements for admission as an Elementary applicant?",
                "What documents do I need to submit for admission as an Elementary applicant?",
                "What requirements do I need to apply for admission as an Elementary applicant?",
                "What documents should I prepare to apply for admission as an Elementary applicant?",
                "What are the required documents for the admission process for Elementary applicants?"
            ],
            "responses": [
                "To apply for admission as a Elementary applicant at BatStateU ARASOF-Nasugbu, you will need to provide the following requirements:\n\n1. One (1) copy of Filled Out Application Form (BatStateU-FO-TAO-01-A_Application-Form-for-Integrated-School-and-Laboratory-SchoolAdmission) \n2. Admission Test Permit.\n3. 2 recent 2” x 2” pictures of good quality, white background \n4. Previous report card based on current grade level (Original and 1 Photocopy)\n5. One (1) copy of Official Receipt"
            ]
        },
        {
            "patterns": [
                "What are the requirements for admission as a Grade 7 applicant?",
                "What documents do I need to submit for admission as a Grade 7 applicant?",
                "What requirements do I need to apply for admission as a Grade 7 applicant?",
                "What documents should I prepare to apply for admission as a Grade 7 applicant?",
                "What are the required documents for the admission process for Grade 7 applicants?"
            ],
            "responses": [
                "To apply for admission as a Grade 7 applicant at BatStateU ARASOF-Nasugbu, you will need to provide the following requirements:\n\n1. One (1) copy of Filled Out Application Form (BatStateU-FO-TAO-01-A_Application-Form-for-Integrated-School-and-Laboratory-SchoolAdmission) \n2. Admission Test Permit.\n3. 2 recent 2” x 2” pictures of good quality, white background \n4. Previous report card based on current grade level (Original and 1 Photocopy)\n5. One (1) copy of Official Receipt"
            ]
        },
        {
            "patterns": [
                "Who is eligible to apply for the Laboratory School?",
                "Who can apply for Laboratory School?"
            ],
            "responses": [
                "Applicants eligible for the Laboratory School at BatStateU ARASOF-Nasugbu include:\n\n1. Kindergarten applicants who are at least 5 years old.\n2. Incoming Grade 1 applicants.\n3. Grade 2 to Grade 6 transferee applicants.\n4. Incoming Grade 7 applicants."
            ]
        },
        {
            "patterns": [
                "Who is eligible to apply for Kindergarten?",
                "Who can apply for Kindergarten?"
            ],
            "responses": [
                "Applicants eligible for Kindergarten must be at least 5 years old."
            ]
        },
        {
            "patterns": [
                "Who is eligible to apply for Elementary?",
                "Who can apply for Elementary?"
            ],
            "responses": [
                "Applicants eligible for Elementary include:\n\n1. Incoming Grade 1 students.\n2. Transferee students from Grade 2 to Grade 6."
            ]
        },
        {
            "patterns": [
                "Who is eligible to apply for Grade 7?",
                "Who can apply for Grade 7?"
            ],
            "responses": [
                "Incoming Grade 7 applicants are eligible to apply for the Laboratory School."
            ]
        },
        {
            "patterns": [
                "Where can I get the Application Form for admission to the Laboratory School?",
                "Where can I request the Application Form for admission to the Laboratory School?",
                "Where can I obtain the Application Form for admission to the Laboratory School?"
            ],
            "responses": [
                "You can obtain the BatStateU-FO-TAO-01-A application form at the Testing and Admission Office."
            ]
        },
        {
            "patterns": [
                "Where can I get the Admission Test Permit for the Laboratory School?",
                "Where can I request the Admission Test Permit for the Laboratory School?",
                "Where can I obtain the Admission Test Permit for the Laboratory School?"
            ],
            "responses": [
                "You can obtain the Admission Test Permit at the Testing and Admission Office."
            ]
        },
        {
            "patterns": [
                "Where can I get the Birth Certificate required for admission to the Laboratory School?",
                "Where can I request the Birth Certificate for admission to the Laboratory School?",
                "Where can I obtain the Birth Certificate for admission to the Laboratory School?"
            ],
            "responses": [
                "You can obtain the Birth Certificate from the Philippine Statistics Authority."
            ]
        },
        {
            "patterns": [
                "Where can I get the previous report card required for admission to the Laboratory School?",
                "Where can I request the previous report card for admission to the Laboratory School?",
                "Where can I obtain the previous report card for admission to the Laboratory School?"
            ],
            "responses": [
                "You can obtain the previous report card based on the current grade level from the Registration Services Office at your current school."
            ]
        },
        {
            "patterns": [
                "Where can I get the Official Receipt for admission to the Laboratory School?",
                "Where can I request the Official Receipt for admission to the Laboratory School?",
                "Where can I obtain the Official Receipt for admission to the Laboratory School?"
            ],
            "responses": [
                "You can obtain the Official Receipt from the Cashiering Office."
            ]
        },
        {
            "patterns": [
                "How do I apply for admission to the Laboratory School?",
                "What are the steps for admission to the Laboratory School?",
                "What is the admission process for the Laboratory School?",
                "How do I complete my admission to the Laboratory School?",
                "What is the process for admission to the Laboratory School?"
            ],
            "responses": [
                "To complete your admission to the Laboratory School, please follow these steps:\n\n1. Submit the filled-out application form and other documentary requirements.\n2. Pay the testing fee\n3. Secure an Admission Test Permit "
            ]
        },
        {
            "patterns": [
                "How do I apply for admission to Kindergarten?",
                "What are the steps for admission to Kindergarten?",
                "What is the admission process for Kindergarten?",
                "How do I complete my admission to Kindergarten?",
                "What is the process for admission to Kindergarten?"
            ],
            "responses": [
                "To complete your admission to Kindergarten at the Laboratory School, please follow these steps:\n\n1. Submit the filled-out application form and other documentary requirements.\n2. Pay the testing fee\n3. Secure an Admission Test Permit "
            ]
        },
        {
            "patterns": [
                "How do I apply for admission to Elementary?",
                "What are the steps for admission to Elementary?",
                "What is the admission process for Elementary?",
                "How do I complete my admission to Elementary?",
                "What is the process for admission to Elementary?"
            ],
            "responses": [
                "To complete your admission to Elementary at the Laboratory School, please follow these steps:\n\n1. Submit the filled-out application form and other documentary requirements.\n2. Pay the testing fee\n3. Secure an Admission Test Permit "
            ]
        },
        {
            "patterns": [
                "How do I apply for admission to Grade 7?",
                "What are the steps for admission to Grade 7?",
                "What is the admission process for Grade 7?",
                "How do I complete my admission to Grade 7?",
                "What is the process for admission to Grade 7?"
            ],
            "responses": [
                "To complete your admission to Grade 7 at the Laboratory School, please follow these steps:\n\n1. Submit the filled-out application form and other documentary requirements.\n2. Pay the testing fee\n3. Secure an Admission Test Permit "
            ]
        },
        {
            "patterns": [
                "How long is the admission process for applicants to the Laboratory School?",
                "What is the duration of the admission process for applicants to the Laboratory School?",
                "How long does the entire admission process take for applicants to the Laboratory School?",
                "How long will it take to complete all the steps for admission to the Laboratory School?",
                "What is the duration of the entire admission process for applicants to the Laboratory School?"
            ],
            "responses": [
                "The admission process for applicants to the Laboratory School at BatStateU ARASOF-Nasugbu typically takes about 9 minutes to complete."
            ]
        },
        {
            "patterns": [
                "Is there a fee for the admission process to the Laboratory School?",
                "How much does the admission process cost for applicants to the Laboratory School?",
                "What are the fees for the entire admission process to the Laboratory School?",
                "Are there any fees I need to pay during the admission process to the Laboratory School?",
                "How much is the total cost associated with applying for admission to the Laboratory School?"
            ],
            "responses": [
                "There is a fee of 250 PHP for the testing fee required for the admission process to the Laboratory School. Other than this, there are no additional fees for the entire admission process."
            ]
        },
        {
            "patterns": [
                "Who can I contact for inquiries about the admission process to the Laboratory School?",
                "Who should I reach out to about the admission process to the Laboratory School?",
                "Who do I reach out to for questions about the admission process to the Laboratory School?",
                "How can I contact the Testing and Admission Office for questions regarding the admission process to the Laboratory School?",
                "What is the contact information of the Testing and Admission Office for inquiries related to the admission process to the Laboratory School?"
            ],
            "responses": [
                "For inquiries about the admission process to the Laboratory School, you can contact the Testing and Admission Office. Here are the details:\n\nTelephone: 416-0350 local 216\nEmail: tao.nasugbu@g.batstate-u.edu.ph\nOfficial Facebook Page: https://fb.com/TestingAndAdmissionOffice\n\nPlease feel free to reach out for any questions or assistance regarding the admission process."
            ]
        },
        {
            "patterns": [
                "Who can I contact for inquiries about the Kindergarten admission process to the Laboratory School?",
                "Who should I reach out to about the Kindergarten admission process to the Laboratory School?",
                "Who do I reach out to for questions about the Kindergarten admission process to the Laboratory School?",
                "How can I contact the Testing and Admission Office for questions regarding the Kindergarten admission process to the Laboratory School?",
                "What is the contact information of the Testing and Admission Office for inquiries related to the Kindergarten admission process to the Laboratory School?"
            ],
            "responses": [
                "For inquiries about the admission process for Kindergarten, you can contact the Testing and Admission Office. Here are the details:\n\nTelephone: 416-0350 local 216\nEmail: tao.nasugbu@g.batstate-u.edu.ph\nOfficial Facebook Page: https://fb.com/TestingAndAdmissionOffice\n\nPlease feel free to reach out for any questions or assistance regarding the admission process."
            ]
        },
        {
            "patterns": [
                "Who can I contact for inquiries about the Elementary admission process to the Laboratory School?",
                "Who should I reach out to about the Elementary admission process to the Laboratory School?",
                "Who do I reach out to for questions about the Elementary admission process to the Laboratory School?",
                "How can I contact the Testing and Admission Office for questions regarding the Elementary admission process to the Laboratory School?",
                "What is the contact information of the Testing and Admission Office for inquiries related to the Elementary admission process to the Laboratory School?"
            ],
            "responses": [
                "For inquiries about the admission process for Elementary, you can contact the Testing and Admission Office. Here are the details:\n\nTelephone: 416-0350 local 216\nEmail: tao.nasugbu@g.batstate-u.edu.ph\nOfficial Facebook Page: https://fb.com/TestingAndAdmissionOffice\n\nPlease feel free to reach out for any questions or assistance regarding the admission process."
            ]
        },
        {
            "patterns": [
                "Who can I contact for inquiries about the Grade 7 admission process to the Laboratory School?",
                "Who should I reach out to about the Grade 7 admission process to the Laboratory School?",
                "Who do I reach out to for questions about the Grade 7 admission process to the Laboratory School?",
                "How can I contact the Testing and Admission Office for questions regarding the Grade 7 admission process to the Laboratory School?",
                "What is the contact information of the Testing and Admission Office for inquiries related to the Grade 7 admission process to the Laboratory School?"
            ],
            "responses": [
                "For inquiries about the admission process for Grade 7, you can contact the Testing and Admission Office. Here are the details:\n\nTelephone: 416-0350 local 216\nEmail: tao.nasugbu@g.batstate-u.edu.ph\nOfficial Facebook Page: https://fb.com/TestingAndAdmissionOffice\n\nPlease feel free to reach out for any questions or assistance regarding the admission process."
            ]
        },
        {
            "patterns": [
                "What are the requirements for enrollment as a new student?",
                "What documents do I need to submit for enrollment as a new student?",
                "What requirements do I need to apply for enrollment as a new student?",
                "What documents should I prepare to apply for enrollment as a new student?",
                "What are the required documents for the enrollment process for new students?"
            ],
            "responses": [
                "To enroll as a new student at BatStateU ARASOF-Nasugbu, you need to prepare the following documents for each step of the enrollment process:\n\nSecuring Admission Test\n1. One (1) copy of Grades Form 1 (for Regular Admission) / Grades Form 2 (for ALS)\n2. One (1) certified true copy of Junior High School and Senior High School Form 137\n3. Certification of completion of SHS and respective strand or enrolment therein, if not completed (1 photocopy)\n4. For Alternative Admission Program (AAP) applicants:\n - Indigent Applicants: Certificate of Indigency and Certificate of Tax -Exemption.\n - ALS Applicants: Certification of completion of the ALS program (or proof of enrollment if not completed).\n - Indigenous People: Certificate of Tribe Membership.\n - PWD: PWD Identification card.\n - Iskolar ng Bayan Applicants: Certification from the public high school, duly signed by the school principal, of the rank of the applicant in the Top Ten of the graduating (Grade 12) class\n5. Two recent 2” x 2” pictures with a white background.\n6. Form 138 (if the student is graduate of SHS) (1 Original) \n7. Admission Test Permit (1 Original) \n\nSecuring Pre-enrollment Medical Examination\n1. Medical/Dental Form (1 original, accomplished)\n2. Chest X-ray Reading-validity is 6 months from date of examination (1 original) \n3. Blood Type Result or any valid ID with blood type (1 original) \n4. Drug Test - validity is 1 year from date of examination (1 original) \n\nSecuring Registration\n1. Report Card/Form 138 (1 Original)\n2. Certificate of Good Moral Character (1 Original)\n3. PSA Birth Certificate/Marriage Certificate for Married Female Enrollees (1 Original)\n4. Notice of Admission (1 Original)"
            ]
        },
        {
            "patterns": [
                "What are the requirements for admission as a new student?",
                "What documents do I need to submit for admission as a new student?",
                "What requirements do I need to apply for admission as a new student?",
                "What documents should I prepare to apply for admission as a new student?",
                "What are the required documents for the admission process for new students?"
            ],
            "responses": [
                "To apply for admission as a new college student at BatStateU ARASOF-Nasugbu, you will need to provide the following requirements:\n\n1. One (1) copy of Grades Form 1 (for Regular Admission) / Grades Form 2 (for ALS)\n2. One (1) certified true copy of Junior High School and Senior High School Form 137\n3. Certification of completion of SHS and respective strand or enrollment therein, if not completed (1 photocopy)\n4. Two (2) copies of recent 2” x 2” pictures with a white background\n5. Form 138 (if the student is a graduate of SHS) – 1 Original\n6. Admission Test Permit – 1 Original\n\nAdditional Requirements for Admission under AAP:\n\nIndigent Applicants:\n  1. Certificate of Indigency of Parent/Guardian\n  2. Certificate of Tax Exemption\n\nAlternative Learning System (ALS):\n  1. Certification of completion of ALS program or enrollment\n\nIndigenous People:\n  1. Certificate of Tribe Membership or equivalent certification\n\nPWD:\n  1. PWD Identification card\n\nIskolar ng Bayan:\n  1. Certification from the public high school, signed by the school principal, confirming the applicant's rank in the Top Ten of the graduating (Grade 12) class"
            ]
        },
        {
            "patterns": [
                "Where can I get Grades Form 1 for enrollment as a new student?",
                "Where can I request Grades Form 1 for enrollment as a new student?",
                "Where can I obtain Grades Form 1 for enrollment as a new student?"
            ],
            "responses": [
                "You can obtain Grades Form 1 from the College Admission portal: https://dione.batstate-u.edu.ph/tao/#/application."
            ]
        },
        {
            "patterns": [
                "Where can I get Grades Form 2 for enrollment as a new student?",
                "Where can I request Grades Form 2 for enrollment as a new student?",
                "Where can I obtain Grades Form 2 for enrollment as a new student?"
            ],
            "responses": [
                "You can obtain Grades Form 2 from the College Admission portal: https://dione.batstate-u.edu.ph/tao/#/application."
            ]
        },
        {
            "patterns": [
                "Where can I get Form 137 for enrollment as a new student?",
                "Where can I request Form 137 for enrollment as a new student?",
                "Where can I obtain Form 137 for enrollment as a new student?"
            ],
            "responses": [
                "You can obtain Form 137 from your current or previous school."
            ]
        },
        {
            "patterns": [
                "Where can I get a certification of SHS completion or enrollment for enrollment as a new student?",
                "Where can I request a certification of SHS completion or enrollment for enrollment as a new student?",
                "Where can I obtain a certification of SHS completion or enrollment for enrollment as a new student?"
            ],
            "responses": [
                "You can obtain the Certification of Completion of Senior High School from your current or previous school."
            ]
        },
        {
            "patterns": [
                "Where can I get a Certificate of Indigency for enrollment as a new student?",
                "Where can I request a Certificate of Indigency for enrollment as a new student?",
                "Where can I obtain a Certificate of Indigency for enrollment as a new student?"
            ],
            "responses": [
                "You can obtain the Certificate of Indigency from the Office of the Barangay."
            ]
        },
        {
            "patterns": [
                "Where can I get a Certificate of Tax Exemption for enrollment as a new student?",
                "Where can I request a Certificate of Tax Exemption for enrollment as a new student?",
                "Where can I obtain a Certificate of Tax Exemption for enrollment as a new student?"
            ],
            "responses": [
                "You can obtain the Certificate of Tax Exemption from the Bureau of Internal Revenue (BIR)."
            ]
        },
        {
            "patterns": [
                "Where can I get a certification of completion of the ALS program for enrollment as a new student?",
                "Where can I request a certification of completion of the ALS program for enrollment as a new student?",
                "Where can I obtain a certification of completion of the ALS program for enrollment as a new student?"
            ],
            "responses": [
                "You can obtain the Certification of Completion for ALS from your current or previous school."
            ]
        },
        {
            "patterns": [
                "Where can I get a Certification of Tribe Membership for enrollment as a new student?",
                "Where can I request a Certification of Tribe Membership for enrollment as a new student?",
                "Where can I obtain a Certification of Tribe Membership for enrollment as a new student?"
            ],
            "responses": [
                "You can obtain the Certificate of Tribe Membership from the National Commission on Indigenous Peoples (NCIP)."
            ]
        },
        {
            "patterns": [
                "Where can I get a PWD Identification Card for enrollment as a new student?",
                "Where can I request a PWD Identification Card for enrollment as a new student?",
                "Where can I obtain a PWD Identification Card for enrollment as a new student?"
            ],
            "responses": [
                "You can obtain a PWD Identification Card from the Persons with Disabilities Affairs Office (PDAO)."
            ]
        },
        {
            "patterns": [
                "Where can I get a certification of my Top Ten Rank for enrollment as a new student? ",
                "Where can I request a certification of my Top Ten Rank for enrollment as a new student?",
                "Where can I obtain a certification of my Top Ten Rank for enrollment as a new student?"
            ],
            "responses": [
                "You can obtain a certification of your Top Ten Rank for enrollment as a new student from your public senior high school."
            ]
        },
        {
            "patterns": [
                "Where can I get Form 138 for enrollment as a new student?",
                "Where can I request Form 138 for enrollment as a new student?",
                "Where can I obtain Form 138 for enrollment as a new student?"
            ],
            "responses": [
                "You can obtain Form 138 from your previous school."
            ]
        },
        {
            "patterns": [
                "Where can I get the admission test permit for enrollment as a new student?",
                "Where can I request the admission test permit for enrollment as a new student?",
                "Where can I obtain the admission test permit for enrollment as a new student?"
            ],
            "responses": [
                "You can obtain the Admission Test Permit from BatStateU ARASOF-Nasugbu, issued after completing the initial requirements."
            ]
        },
        {
            "patterns": [
                "Where can I get the Medical Form for enrollment as a new student?",
                "Where can I request the Medical Form for enrollment as a new student?",
                "Where can I obtain the Medical Form for enrollment as a new student?"
            ],
            "responses": [
                "You can obtain the Medical Form from the Health Services Office or the College Applicant’s Portal."
            ]
        },
        {
            "patterns": [
                "Where can I get the Dental Form for enrollment as a new student?",
                "Where can I request the Dental Form for enrollment as a new student?",
                "Where can I obtain the Dental Form for enrollment as a new student?"
            ],
            "responses": [
                "You can obtain the Dental Form from the Health Services Office or the College Applicant’s Portal."
            ]
        },
        {
            "patterns": [
                "Where can I get a chest X-ray reading for enrollment as a new student?",
                "Where can I request a chest X-ray reading for enrollment as a new student?",
                "Where can I obtain a chest X-ray reading for enrollment as a new student?"
            ],
            "responses": [
                "You can obtain a Chest X-ray Reading from a hospital or DOH-assisted laboratory."
            ]
        },
        {
            "patterns": [
                "Where can I get a blood type result for enrollment as a new student?",
                "Where can I request a blood type result for enrollment as a new student?",
                "Where can I obtain a blood type result for enrollment as a new student?"
            ],
            "responses": [
                "You can obtain your Blood Type Result from a hospital or DOH-assisted laboratory."
            ]
        },
        {
            "patterns": [
                "Where can I get a drug test result for enrollment as a new student?",
                "Where can I request a drug test result for enrollment as a new student?",
                "Where can I obtain a drug test result for enrollment as a new student?"
            ],
            "responses": [
                "You can obtain a Drug Test from a hospital or DOH-assisted laboratory."
            ]
        },
        {
            "patterns": [
                "Where can I get report card for enrollment as a new student?",
                "Where can I request report card for enrollment as a new student?",
                "Where can I obtain report card for enrollment as a new student?"
            ],
            "responses": [
                "You can obtain your Report Card from your previous school."
            ]
        },
        {
            "patterns": [
                "Where can I get a Certificate of Good Moral Character for enrollment as a new student?",
                "Where can I request a Certificate of Good Moral Character for enrollment as a new student?",
                "Where can I obtain a Certificate of Good Moral Character for enrollment as a new student?",
                "Where can I get the Certificate of Good Moral Character for enrollment as a transferee from other HEIs?",
                "Where can I request the Certificate of Good Moral Character for enrollment as a transferee from other HEIs?",
                "Where can I obtain the Certificate of Good Moral Character for enrollment as as a transferee from other HEIs?"
            ],
            "responses": [
                "You can obtain the Certificate of Good Moral Character from your previous school."
            ]
        },
        {
            "patterns": [
                "Where can I get a PSA Birth Certificate for enrollment as a new student?",
                "Where can I request a PSA Birth Certificate for enrollment as a new student?",
                "Where can I obtain a PSA Birth Certificate for enrollment as a new student?",
                "Where can I get my Birth Certificate for enrollment as a transferee from other HEIs?",
                "Where can I request my Birth Certificate for enrollment as a transferee from other HEIs?",
                "Where can I obtain my Birth Certificate for enrollment as a transferee from other HEIs?"
            ],
            "responses": [
                "You can obtain your Birth Certificate from the Philippine Statistics Authority (PSA)."
            ]
        },
        {
            "patterns": [
                "Where can I get the Notice of Admission for enrollment as a new student?",
                "Where can I request the Notice of Admission for enrollment as a new student?",
                "Where can I obtain the Notice of Admission for enrollment as a new student?"
            ],
            "responses": [
                "You can obtain the Notice of Admission from the Testing and Admission Office or the College Applicant’s Portal."
            ]
        },
        {
            "patterns": [
                "How do I apply for enrollment as a new student?",
                "What are the steps for enrollment as a new student?",
                "What is the enrollment process for new students?",
                "How do I complete my enrollment as a new student?",
                "What is the process for enrollment as a new student?"
            ],
            "responses": [
                "To complete your enrollment as a new student, please follow these steps:\n\n1. Fill out the application form and upload the scanned copy of documentary requirements at https://dione.batstate-u.edu.ph/tao/#/application.\n2. Check the college application portal for the schedule of examination.\n3. Take the Admission Test.\n4. Wait for the examination results.\n5. Pre-register if interested to enroll in the program qualified for through the college applicant’s portal.\n6. Go to the Online Appointment System for the Health Services Office to schedule a pre-enrollment medical examination.\n7. Sign in the Transaction Logsheet.\n8. Submit the required documents.\n9. Open Medical/Dental Form in the Student Portal.\n10. Undergo Medical/Dental Examination/Evaluation.\n11. Sign out on the Transaction Logsheet.\n12. Submit the complete set of enrollment documents to the Registration Services Office.\n13. Receive proof of enrollment.\n14. Log in to the Student’s Portal."
            ]
        },
        {
            "patterns": [
                "How long is the enrollment process for new students?",
                "What is the duration of the enrollment process for new students?",
                "How long does the entire enrollment process take for new students?",
                "How long will it take to complete all the steps for enrollment as a new student?",
                "What is the duration of the entire enrollment process for new students?"
            ],
            "responses": [
                "The enrollment process for new students at BatStateU ARASOF-Nasugbu typically takes about 5 months, 15 days, 2 hours, and 55 minutes to complete."
            ]
        },
        {
            "patterns": [
                "How long does the admission test take for new students?",
                "What is the duration of the admission test for new students?",
                "How long is the admission test for new students?",
                "How much time do I need for the admission test as a new student?",
                "What is the time allotted for the admission test for new students?"
            ],
            "responses": [
                "The admission test for new students at BatStateU ARASOF-Nasugbu typically takes about 2 hours to complete."
            ]
        },
        {
            "patterns": [
                "Is there a fee for the enrollment process for new students?",
                "How much does the enrollment process cost for new students?",
                "What are the fees for the entire enrollment process for new students?",
                "Are there any fees I need to pay during the enrollment process for new students?",
                "How much is the total cost associated with applying for enrollment as a new student?"
            ],
            "responses": [
                "There are no fees associated with the enrollment process for new students. The entire enrollment process is free of charge."
            ]
        },
        {
            "patterns": [
                "When is the admission test for new students?",
                "When is the admission test for transferees from other HEIs?"
            ],
            "responses": [
                "For the admission test schedule, please check the official pages of the Testing and Admission Office or contact them directly for the most up-to-date information. You can reach the Testing and Admission Office at:\n\nTelephone: 416-0350 local 216\nEmail: tao.nasugbu@g.batstate-u.edu.ph\nOfficial Facebook Page: https://fb.com/TestingAndAdmissionOffice"
            ]
        },
        {
            "patterns": [
                "When is the release of the admission test results for new students?",
                "When is the release of the admission test results for transferees from other HEIs?"
            ],
            "responses": [
                "The release date for admission test results will be announced on the official pages of the Testing and Admission Office. For the latest updates, you can contact them directly:\n\nTelephone: 416-0350 local 216\nEmail: tao.nasugbu@g.batstate-u.edu.ph\nOfficial Facebook Page: https://fb.com/TestingAndAdmissionOffice"
            ]
        },
        {
            "patterns": [
                "When is the enrollment period for new students?",
                "When is the enrollment period for shifters from another BatStateU campus?",
                "When is the enrollment period for transferees from another BatStateU campus?",
                "When is the enrollment period for transferees from other HEIs?",
                "When is the enrollment period for regular students?",
                "When is the enrollment period for irregular students?",
                "When is the enrollment period for overstaying students?",
                "When is the enrollment period for returnee students?",
                "When is the enrollment period for late enrollees?"
            ],
            "responses": [
                "For the enrollment period, please refer to the official announcements from the Registrar's Office or contact them directly for the most up-to-date information. You can reach the Registrar's Office at:\n\nTelephone: (043) 416-0350 local 214\nEmail: registrar.nasugbu@g.batstate-u.edu.ph"
            ]
        },
        {
            "patterns": [
                "When is the deadline for enrollment for new students?"
            ],
            "responses": [
                "For the deadline of enrollment, please refer to the official announcements from the Registrar's Office or contact them directly for the most up-to-date information. You can reach the Registrar's Office at:\n\nTelephone: (043) 416-0350 local 214\nEmail: registrar.nasugbu@g.batstate- u.edu.ph"
            ]
        },
        {
            "patterns": [
                "Who can I contact for inquiries about the enrollment process for new students?",
                "Who should I reach out to about the admission requirements for new students?",
                "Who do I reach out to for questions about the admission requirements for new students?",
                "How can I contact the Testing and Admission Office for questions regarding the admission process for new students?",
                "What is the contact information of the Testing and Admission Office for inquiries related to the admission process for new students?"
            ],
            "responses": [
                "For inquiries about admission requirements and the admission process for new students, you can contact the Testing and Admission Office. Here are the details:\n\nTelephone: 416-0350 local 216\nEmail: tao.nasugbu@g.batstate-u.edu.ph\nOfficial Facebook Page: https://fb.com/TestingAndAdmissionOffice\n\nPlease feel free to reach out for any questions or assistance regarding admission requirements or the application process."
            ]
        },
        {
            "patterns": [
                "Who should I reach out to about the enrollment process for new students?",
                "Who do I reach out to for questions about the enrollment process for new students?",
                "How can I contact the Registrar's Office for questions regarding enrollment precoess for new students?",
                "What is the contact information of the Registrar's Office for inquiries related to enrollment process for new students?"
            ],
            "responses": [
                "For inquiries about enrollment process for new students, you can contact the Registrar's Office. Here are the details:\n\nTelephone: (043) 416-0350 local 214\nEmail: registrar.nasugbu@g.batstate- u.edu.ph\n\nPlease feel free to reach out for any questions or assistance regarding enrollment process."
            ]
        },
        {
            "patterns": [
                "What are the requirements for enrollment as a shifter from another BatStateU campus?",
                "What documents do I need to submit for enrollment as a shifter from another BatStateU campus?",
                "What requirements do I need to apply for enrollment as a shifter from another BatStateU campus?",
                "What documents should I prepare to apply for enrollment as a shifter from another BatStateU campus?",
                "What are the required documents for the enrollment process for shifters from another BatStateU campus?"
            ],
            "responses": [
                "To enroll as a shifter from another BatStateU campus, please prepare the following documents:\n\n1. Application Form for Shifter/Transferee (1 Original): From the Registration Services Office or Student Portal.\n2. Student Clearance (1 Original): From the Concerned College/Department.\n3. Parent’s Consent (1 Original): From the Parent/Guardian of the Student.\n4. Report of Grades (1 Certified True Copy): From the Student Portal or Registration Services.\n5. Student ID: From the Student Portal.\n6. Student’s Copy of Exit Interview Form (1 Clear Copy): From the Guidance and Counseling Office (for transferees only).\n\nConditional Requirement: In case, the student cannot personally process:\n - Authorization letter stating the processes to be undertaken by the representative (1 Original)\n - Clear photocopy of student ID (1 copy) and any valid ID of the representative (1 copy), with three (3) specimen signatures"
            ]
        },
        {
            "patterns": [
                "What are the requirements for enrollment as a transferee from another BatStateU campus?",
                "What documents do I need to submit for enrollment as a transferee from another BatStateU campus?",
                "What requirements do I need to apply for enrollment as a transferee from another BatStateU campus?",
                "What documents should I prepare to apply for enrollment as a transferee from another BatStateU campus?",
                "What are the required documents for the enrollment process for transferees from another BatStateU campus?"
            ],
            "responses": [
                "To enroll as a transferee from another BatStateU campus, please prepare the following documents:\n\n1. Application Form for Shifter/Transferee (1 Original): From the Registration Services Office or Student Portal.\n2. Student Clearance (1 Original): From the Concerned College/Department.\n3. Parent’s Consent (1 Original): From the Parent/Guardian of the Student.\n4. Report of Grades (1 Certified True Copy): From the Student Portal or Registration Services.\n5. Student ID: From the Student Portal.\n6. Student’s Copy of Exit Interview Form (1 Clear Copy): From the Guidance and Counseling Office (for transferees only).\n\nConditional Requirement: In case, the student cannot personally process:\n - Authorization letter stating the processes to be undertaken by the representative (1 Original)\n - Clear photocopy of student ID (1 copy) and any valid ID of the representative (1 copy), with three (3) specimen signatures"
            ]
        },
        {
            "patterns": [
                "Where can I get the Application Form for enrollment as a shifter from another BatStateU campus?",
                "Where can I request the Application Form for enrollment as a shifter from another BatStateU campus?",
                "Where can I obtain the Application Form for enrollment as a shifter from another BatStateU campus?",
                "Where can I get the Application Form for enrollment as a transferee from another BatStateU campus?",
                "Where can I request the Application Form for enrollment as a transferee from another BatStateU campus?",
                "Where can I obtain the Application Form for enrollment as a transferee from another BatStateU campus?"
            ],
            "responses": [
                "You can obtain the Application Form for Shifter/Transferee from the Registration Services Office or the Student Portal."
            ]
        },
        {
            "patterns": [
                "Where can I get the Student Clearance for enrollment as a shifter from another BatStateU campus?",
                "Where can I request the Student Clearance for enrollment as a shifter from another BatStateU campus?",
                "Where can I obtain the Student Clearance for enrollment as a shifter from another BatStateU campus?",
                "Where can I get the Student Clearance for enrollment as a transferee from another BatStateU campus?",
                "Where can I request the Student Clearance for enrollment as a transferee from another BatStateU campus?",
                "Where can I obtain the Student Clearance for enrollment as a transferee from another BatStateU campus?"
            ],
            "responses": [
                "You can obtain the Student Clearance from the Concerned College/Department."
            ]
        },
        {
            "patterns": [
                "Where can I get the Report of Grades for enrollment as a shifter from another BatStateU campus?",
                "Where can I request the Report of Grades for enrollment as a shifter from another BatStateU campus?",
                "Where can I obtain the Report of Grades for enrollment as a shifter from another BatStateU campus?",
                "Where can I get the Report of Grades for enrollment as a transferee from another BatStateU campus?",
                "Where can I request the Report of Grades for enrollment as a transferee from another BatStateU campus?",
                "Where can I obtain the Report of Grades for enrollment as a transferee from another BatStateU campus?"
            ],
            "responses": [
                "You can obtain the Report of Grades from the Student Portal or Registration Services."
            ]
        },
        {
            "patterns": [
                "Where can I get the Student ID for enrollment as a shifter from another BatStateU campus?",
                "Where can I request the Student ID for enrollment as a shifter from another BatStateU campus?",
                "Where can I obtain the Student ID for enrollment as a shifter from another BatStateU campus?",
                "Where can I get the Student ID for enrollment as a transferee from another BatStateU campus?",
                "Where can I request the Student ID for enrollment as a transferee from another BatStateU campus?",
                "Where can I obtain the Student ID for enrollment as a transferee from another BatStateU campus?"
            ],
            "responses": [
                "You can obtain the Student ID from the Student Portal."
            ]
        },
        {
            "patterns": [
                "Where can I get the Exit Interview Form for enrollment as a transferee from another BatStateU campus?",
                "Where can I request the Exit Interview Form for enrollment as a transferee from another BatStateU campus?",
                "Where can I obtain the Exit Interview Form for enrollment as a transferee from another BatStateU campus?"
            ],
            "responses": [
                "You can obtain the Exit Interview Form from the Guidance and Counseling Office"
            ]
        },
        {
            "patterns": [
                "How do I apply for enrollment as a shifter from another BatStateU campus?",
                "What are the steps for enrollment as a shifter from another BatStateU campus?",
                "What is the enrollment process for shifters from another BatStateU campus?",
                "How do I complete my enrollment as a shifter from another BatStateU campus?",
                "What is the process for enrollment as a shifter from another BatStateU campus?"
            ],
            "responses": [
                "To complete your enrollment as a shifter from another BatStateU Campus, please follow these steps:\n\n1. Proceed to the Registration Services Office for authentication of report of grades\n2. Proceed to the admitting college for initial evaluation.\n3. Bring the approved application form to the Registration Services Office"
            ]
        },
        {
            "patterns": [
                "How do I apply for enrollment as a transferee from another BatStateU campus?",
                "What are the steps for enrollment as a transferee from another BatStateU campus?",
                "What is the enrollment process for transferees from another BatStateU campus?",
                "How do I complete my enrollment as a transferee from another BatStateU campus?",
                "What is the process for enrollment as a transferee from another BatStateU campus?"
            ],
            "responses": [
                "To complete your enrollment as a transferee from another BatStateU campus, please follow these steps:\n\n1. Proceed to the Registration Services Office for authentication of report of grades\n2. Proceed to the admitting college for initial evaluation.\n3. Bring the approved application form to the Registration Services Office"
            ]
        },
        {
            "patterns": [
                "How long is the enrollment process for shifters from another BatStateU campus?",
                "What is the duration of the enrollment process for shifters from another BatStateU campus?",
                "How long does the entire enrollment process take for shifters from another BatStateU campus?",
                "How long will it take to complete all the steps for enrollment as a shifter from another BatStateU campus?",
                "What is the duration of the entire enrollment process for shifters from another BatStateU campus?",
                "How long is the enrollment process for transferees from another BatStateU campus?",
                "What is the duration of the enrollment process for transferees from another BatStateU campus?",
                "How long does the entire enrollment process take for transferees from another BatStateU campus?",
                "How long will it take to complete all the steps for enrollment as a transferee from another BatStateU campus?",
                "What is the duration of the entire enrollment process for transferees from another BatStateU campus?"
            ],
            "responses": [
                "The enrollment process for shifters and transferees from another BatStateU campus typically takes about 2 hours to complete."
            ]
        },
        {
            "patterns": [
                "Is there a fee for the enrollment process for shifters from another BatStateU campus?",
                "How much does the enrollment process cost for shifters from another BatStateU campus?",
                "What are the fees for the entire enrollment process for shifters from another BatStateU campus?",
                "Are there any fees I need to pay during the enrollment process for shifters from another BatStateU campus?",
                "How much is the total cost associated with applying for enrollment as a shifter from another BatStateU campus?",
                "Is there a fee for the enrollment process for transferees from another BatStateU campus?",
                "How much does the enrollment process cost for transferees from another BatStateU campus?",
                "What are the fees for the entire enrollment process for transferees from another BatStateU campus?",
                "Are there any fees I need to pay during the enrollment process for transferees from another BatStateU campus?",
                "How much is the total cost associated with applying for enrollment as a transferee from another BatStateU campus?"
            ],
            "responses": [
                "There is a fee of Php 20 per page for authentication documents associated with the enrollment process for shifters and transferees from another BatStateU campus."
            ]
        },
        {
            "patterns": [
                "When is the enrollment date for shifters from another BatStateU campus?",
                "When is the enrollment date for transferees from another BatStateU campus?",
                "When is the enrollment date for regular students?",
                "When is the enrollment date for irregular students?",
                "When is the enrollment date for overstaying students?",
                "When is the enrollment date for returnee students?",
                "When is the enrollment date for late enrollees?"
            ],
            "responses": [
                "For the enrollment date, please refer to the official announcements from the Registrar's Office or contact them directly for the most up-to-date information. You can reach the Registrar's Office at:\n\nTelephone: (043) 416-0350 local 214\nEmail: registrar.nasugbu@g.batstate-u.edu.ph"
            ]
        },
        {
            "patterns": [
                "When is the deadline for enrollment for shifters from another BatStateU campus?",
                "When is the deadline for enrollment for transferees from another BatStateU campus?",
                "When is the deadline for enrollment for transferees from other HEIs?",
                "When is the deadline of enrollment for regular students?",
                "When is the deadline of enrollment for irregular students?",
                "When is the deadline for enrollment for overstaying students?",
                "When is the deadline for enrollment for returnee students?",
                "When is the deadline for late enrollment?"
            ],
            "responses": [
                "For the deadline of enrollment, please refer to the official announcements from the Registrar's Office or contact them directly for the most up-to-date information. You can reach the Registrar's Office at:\n\nTelephone: (043) 416-0350 local 214\nEmail: registrar.nasugbu@g.batstate-u.edu.ph"
            ]
        },
        {
            "patterns": [
                "Who can I contact for inquiries about the enrollment process for shifters from another BatStateU campus?",
                "Who should I reach out to about the enrollment process for shifters from another BatStateU campus?",
                "Who do I contact for questions about the enrollment process for shifters from another BatStateU campus?",
                "How can I contact the Registrar's Office for questions regarding the enrollment process for shifters from another BatStateU campus?",
                "What is the contact information for the Registrar's Office for inquiries related to the enrollment process for shifters from another BatStateU campus?",
                "Who can I contact for inquiries about the enrollment process for transferees from another BatStateU campus?",
                "Who should I reach out to about the enrollment process for transferees from another BatStateU campus?",
                "Who do I contact for questions about the enrollment process for transferees from another BatStateU campus?",
                "How can I contact the Registrar's Office for questions regarding the enrollment process for transferees from another BatStateU campus?",
                "What is the contact information of the Registrar's Office for inquiries related to the enrollment process for transferees from another BatStateU campus?"
            ],
            "responses": [
                "For inquiries about the enrollment process for shifters / transferees from another BatStateU campus, you can contact the Registrar's Office. Here are the details:\n\nTelephone: (043) 416-0350 local 214\nEmail: registrar.nasugbu@g.batstate-u.edu.ph\n\nPlease feel free to reach out for any questions or assistance regarding enrollment process."
            ]
        },
        {
            "patterns": [
                "What are the requirements for enrollment as a transferee from other Higher Education Institutions (HEIs)?",
                "What documents do I need to submit for enrollment as a transferee from other Higher Education Institutions (HEIs)?",
                "What requirements do I need to apply for enrollment as a transferee from other Higher Education Institutions (HEIs)?",
                "What documents should I prepare to apply for enrollment as a transferee from other Higher Education Institutions (HEIs)?",
                "What are the required documents for the enrollment process for transferees from other Higher Education Institutions (HEIs)?"
            ],
            "responses": [
                "To enroll as a transferee from other Higher Education Institutions (HEIs) at BatStateU ARASOF-Nasugbu, please prepare the following documents for each step of the enrollment process:\n\nAdmission Requirements\n1. Accomplished Application Form for Shifter/Transferee (1 Original)\n2. Transcript of Records (1 Original)\n3. Certificate of General Weighted Average (GWA)\n4. Certificate of Course Description (if necessary)\n5. Student ID or Any Valid Identification Card\n\nHealth Services Requirements\n1. Notice of Admission (1 Original)\n2. Medical/Dental Form (1 Original)\n3. Chest X-ray Reading (valid for 6 months from date of examination, 1 Original)\n4. Blood Type Result or any valid ID with blood type (1 Original)\n5. Drug Test (valid for 1 year from date of examination, 1 Original)\n\nRegistration Services Requirements\n1. Stamped Notice of Admission (1 Original)\n2. Approved Application Form for Shifter/Transferee (1 Original)\n3. Program Curriculum (1 Clear Copy)\n4. Certificate of Transfer Credential/Honorable Dismissal (1 Original)\n5. Transcript of Records (1 Original)\n6. Clear Copy of PSA/NSO Birth Certificate or Marriage Contract (for married female enrollees, 1 Copy)\n7. Certificate of Good Moral Character (1 Original)\n\nConditional Requirement: In case, the student cannot personally process:\n - Authorization letter stating the processes to be undertaken by the representative (1 Original)\n - Clear photocopy of student ID (1 copy) and any valid ID of the representative (1 copy), with three (3) specimen signatures"
            ]
        },
        {
            "patterns": [
                "What are the requirements for the admission process as a transferee from other Higher Education Institutions (HEIs)?",
                "What documents do I need to submit for the admission process as a transferee from other Higher Education Institutions (HEIs)?",
                "What requirements do I need to apply for the admission as a transferee from other HEIs?",
                "What documents should I prepare for the admission process as a transferee from other HEIs?",
                "What are the required documents for the admission process for transferees from other Higher Education Institutions (HEIs)?"
            ],
            "responses": [
                "For the admission process as a transferee from other Higher Education Institutions (HEIs) at BatStateU ARASOF-Nasugbu, prepare the following documents:\n\n1. Accomplished Application Form for Shifter/Transferee (1 Original): From the Registration Services Office\n2. Transcript of Records (1 Original): From your previous school\n3. Certificate of General Weighted Average (GWA): From your previous school\n4. Certificate of Course Description (if necessary): From your previous school\n5. Student ID or Any Valid Identification Card: From your previous school or government agency"
            ]
        },
        {
            "patterns": [
                "Where can I get the Accomplished Application Form for Shifter for enrollment as a transferee from other HEIs?",
                "Where can I request the Accomplished Application Form for Shifter for enrollment as a transferee from other HEIs?",
                "Where can I obtain the Accomplished Application Form for Shifter for enrollment as a transferee from other HEIs?",
                "Where can I get the Accomplished Application Form for Transferee for enrollment as a transferee from other HEIs?",
                "Where can I request the Accomplished Application Form for Transferee for enrollment as a transferee from other HEIs?",
                "Where can I obtain the Accomplished Application Form for Transferee for enrollment as a transferee from other HEIs?"
            ],
            "responses": [
                "You can obtain the Accomplished Application Form for Shifter/Transferee from the Registration Services Office."
            ]
        },
        {
            "patterns": [
                "Where can I get the Transcript of Records for enrollment as a transferee from other HEIs?",
                "Where can I request the Transcript of Records for enrollment as a transferee from other HEIs?",
                "Where can I obtain the Transcript of Records for enrollment as a transferee from other HEIs?"
            ],
            "responses": [
                "You can obtain the Transcript of Records from your previous school."
            ]
        },
        {
            "patterns": [
                "Where can I get the Certificate of General Weighted Average (GWA) for enrollment as a transferee from other HEIs?",
                "Where can I request the Certificate of General Weighted Average (GWA) for enrollment as a transferee from other HEIs?",
                "Where can I obtain the Certificate of General Weighted Average (GWA) for enrollment as a transferee from other HEIs?"
            ],
            "responses": [
                "You can obtain the Certificate of General Weighted Average (GWA) from your previous school."
            ]
        },
        {
            "patterns": [
                "Where can I get the Certificate of Course Description for enrollment as a transferee from other HEIs?",
                "Where can I request the Certificate of Course Description for enrollment as a transferee from other HEIs?",
                "Where can I obtain the Certificate of Course Description for enrollment as a transferee from other HEIs?"
            ],
            "responses": [
                "You can obtain the Certificate of Course Description from your previous school."
            ]
        },
        {
            "patterns": [
                "Where can I get a Student ID or any valid Identification Card for enrollment as a transferee from other HEIs?",
                "Where can I request a Student ID or any valid Identification Card for enrollment as a transferee from other HEIs?",
                "Where can I obtain a Student ID or any valid Identification Card for enrollment as a transferee from other HEIs?"
            ],
            "responses": [
                "You can obtain a Student ID or any valid Identification Card from your previous school or a government agency."
            ]
        },
        {
            "patterns": [
                "Where can I get the Notice of Admission for enrollment as a transferee from other HEIs?",
                "Where can I request the Notice of Admission for enrollment as a transferee from other HEIs?",
                "Where can I obtain the Notice of Admission for enrollment as a transferee from other HEIs?"
            ],
            "responses": [
                "You can obtain the Notice of Admission from the Testing and Admission Office."
            ]
        },
        {
            "patterns": [
                "Where can I get the Medical Form for enrollment as a transferee from other HEIs?",
                "Where can I request the Medical Form for enrollment as a transferee from other HEIs?",
                "Where can I obtain the Medical Form for enrollment as a transferee from other HEIs?",
                "Where can I get the Dental Form for enrollment as a transferee from other HEIs?",
                "Where can I request the Dental Form for enrollment as a transferee from other HEIs?",
                "Where can I obtain the Dental Form for enrollment as a transferee from other HEIs?"
            ],
            "responses": [
                "You can obtain the Medical/Dental Form from the Health Services office."
            ]
        },
        {
            "patterns": [
                "Where can I get the Chest X-ray Reading for enrollment as a transferee from other HEIs?",
                "Where can I request the Chest X-ray Reading for enrollment as a transferee from other HEIs?",
                "Where can I obtain the Chest X-ray Reading for enrollment as a transferee from other HEIs?"
            ],
            "responses": [
                "You can obtain the Chest X-ray Reading from a hospital or DOH-accredited laboratory."
            ]
        },
        {
            "patterns": [
                "Where can I get the Blood Type Result for enrollment as a transferee from other HEIs?",
                "Where can I request the Blood Type Result for enrollment as a transferee from other HEIs?",
                "Where can I obtain the Blood Type Result for enrollment as a transferee from other HEIs?"
            ],
            "responses": [
                "You can obtain the Blood Type Result from a hospital or DOH-accredited laboratory."
            ]
        },
        {
            "patterns": [
                "Where can I get the Drug Test for enrollment as a transferee from other HEIs?",
                "Where can I request the Drug Test for enrollment as a transferee from other HEIs?",
                "Where can I obtain the Drug Test for enrollment as a transferee from other HEIs?"
            ],
            "responses": [
                "You can obtain the Drug Test from a hospital or DOH-accredited laboratory."
            ]
        },
        {
            "patterns": [
                "Where can I get the Stamped Notice of Admission for enrollment as a transferee from other HEIs?",
                "Where can I request the Stamped Notice of Admission for enrollment as a transferee from other HEIs?",
                "Where can I obtain the Stamped Notice of Admission for enrollment as a transferee from other HEIs?"
            ],
            "responses": [
                "You can obtain the Stamped Notice of Admission from Health Services."
            ]
        },
        {
            "patterns": [
                "Where can I get the Approved Application Form for Shifter/Transferee for enrollment as a transferee from other HEIs?",
                "Where can I request the Approved Application Form for Shifter/Transferee for enrollment as a transferee from other HEIs?",
                "Where can I obtain the Approved Application Form for Shifter/Transferee for enrollment as a transferee from other HEIs?"
            ],
            "responses": [
                "You can obtain the Approved Application Form for Shifter/Transferee from the Admitting College/Department."
            ]
        },
        {
            "patterns": [
                "Where can I get the Program Curriculum for enrollment as a transferee from other HEIs?",
                "Where can I request the Program Curriculum for enrollment as a transferee from other HEIs?",
                "Where can I obtain the Program Curriculum for enrollment as a transferee from other HEIs?"
            ],
            "responses": [
                "You can obtain the Program Curriculum from the Admitting College/Department."
            ]
        },
        {
            "patterns": [
                "Where can I get the Certificate of Transfer Credential for enrollment as a transferee from other HEIs?",
                "Where can I request the Certificate of Transfer Credential for enrollment as a transferee from other HEIs?",
                "Where can I obtain the Certificate of Transfer Credential for enrollment as a transferee from other HEIs?"
            ],
            "responses": [
                "You can obtain the Certificate of Transfer Credential from your previous school."
            ]
        },
        {
            "patterns": [
                "Where can I get the Honorable Dismissal for enrollment as a transferee from other HEIs?",
                "Where can I request the Honorable Dismissal for enrollment as a transferee from other HEIs?",
                "Where can I obtain the Honorable Dismissal for enrollment as a transferee from other HEIs?"
            ],
            "responses": [
                "You can obtain the Honorable Dismissal from your previous school."
            ]
        },
        {
            "patterns": [
                "How do I apply for enrollment as a transferee from other Higher Education Institution (HEI)?",
                "What are the steps for enrollment as a transferee from other Higher Education Institution (HEI)?",
                "What is the enrollment process for transferees from other Higher Education Institution (HEI)?",
                "How do I complete my enrollment as a transferee from other Higher Education Institution (HEI)?",
                "What is the process for enrollment as a transferee from other Higher Education Institution (HEI)?"
            ],
            "responses": [
                "To complete your enrollment as a transferee from other HEIs, please follow these steps:\n\n1. Inquire onsite, thru email or call the Testing and Admission Office (TAO) for inquiries. \n - Email: tao.nasugbu@g.batstate-u.edu.ph\n - Contact Number: (043) 416-0350 local 2016\n2. Secure an Application Form for Shifter/Transferee from the Registration Services Office or request thru the official email address\n - Email: registrar.nasugbu@g.batstate- u.edu.ph\n3. Proceed to the admitting college for the evaluation of academic records\n4. Proceed to Testing and Admission Office (TAO) for the BatStateU College Admission Test\n5. Proceed to the admitting college for endorsement to the Campus Registrar\n6. Proceed to Health Services Office at the chosen schedule/appointment and do the following:\n - 6.1 Sign in the Transaction Logbook in the office lobby\n - 6.2 Submit the required documents\n - 6.3 Accomplish Medical/Dental Form\n - 6.4 Undergo Medical/Dental Examination/ Evaluation\n - 6.5 Sign out on the Transaction Logbook\n - 6.6 Receive the stamped Notice of Admission (NOA)\n7. Submit the following document for enrollment:\n - Approved Application Form for Shifter/Transferee\n - Program Curriculum\n - Stamped Notice of Admission\n - Original Transcript of Records\n - Certificate of Transfer Credentials\n - Clear Copy of PSA/NSO Birth Certificate/ Marriage Certificate if Married female\n"
            ]
        },
        {
            "patterns": [
                "How long is the enrollment process for transferees from other HEIs?",
                "What is the duration of the enrollment process for transferees from other HEIs?",
                "How long does the entire enrollment process take for transferees from other HEIs?",
                "How long will it take to complete all the steps for enrollment as a transferee from other HEIs?",
                "What is the duration of the entire enrollment process for transferees from other HEIs?"
            ],
            "responses": [
                "The enrollment process for transferees from other HEIs typically takes about 1 day, 7 hours, and 25 minutes to complete."
            ]
        },
        {
            "patterns": [
                "Is there a fee for the enrollment process for transferees from other HEIs)?",
                "How much does the enrollment process cost for transferees from other HEIs?",
                "What are the fees for the entire enrollment process for transferees from other HEIs?",
                "Are there any fees I need to pay during the enrollment process for transferees from other HEIs?",
                "How much is the total cost associated with applying for enrollment as a transferee from other HEIs?"
            ],
            "responses": [
                "There are no fees associated with the enrollment process for transferees from other HEIs. The entire enrollment process is free of charge."
            ]
        },
        {
            "patterns": [
                "What are the important dates for the enrollment process for transferees from other HEIs?"
            ],
            "responses": [
                "For important dates regarding the enrollment process, please refer to the official announcements from the Registrar's Office or contact them directly for the most up-to-date information. You can reach the Registrar's Office at:\n\nTelephone: (043) 416-0350 local 214\nEmail: registrar.nasugbu@g.batstate- u.edu.ph"
            ]
        },
        {
            "patterns": [
                "What are the key dates I should be aware of during the enrollment process for transferees from other HEIs?"
            ],
            "responses": [
                "For key dates regarding the enrollment process, please refer to the official announcements from the Registrar's Office or contact them directly for the most up-to-date information. You can reach the Registrar's Office at:\n\nTelephone: (043) 416-0350 local 214\nEmail: registrar.nasugbu@g.batstate- u.edu.ph"
            ]
        },
        {
            "patterns": [
                "Who can I contact for inquiries about the enrollment process for transferees from other Higher Education Institutions (HEIs)?",
                "Who should I reach out to about the enrollment process for transferees from other Higher Education Institutions (HEIs)?",
                "Who do I contact for questions about the enrollment process for transferees from other Higher Education Institutions (HEIs)?",
                "How can I contact the Registrar's Office for questions regarding the enrollment process for transferees from other Higher Education Institutions (HEIs)?",
                "What is the contact information of the Registrar's Office for inquiries related to the enrollment process for transferees from other Higher Education Institutions (HEIs)?"
            ],
            "responses": [
                "For inquiries about the enrollment process for transferees from other HEIs, you can contact the Registrar's Office. Here are the details:\n\nTelephone: (043) 416-0350 local 214\nEmail: registrar.nasugbu@g.batstate- u.edu.ph\n\nPlease feel free to reach out for any questions or assistance regarding enrollment process."
            ]
        },
        {
            "patterns": [
                "What are the requirements for enrollment as a regular student?",
                "What documents do I need to submit for enrollment as a regular student?",
                "What requirements do I need to apply for enrollment as a regular student?",
                "What documents should I prepare to apply for enrollment as a regular student?",
                "What are the required documents for the enrollment process for regular students?"
            ],
            "responses": [
                "To enroll as a regular student at BatStateU ARASOF-Nasugbu, you need to complete the following requirement for the enrollment process:\n\n1. Online Clearance: From the Student Portal"
            ]
        },
        {
            "patterns": [
                "Where can I get the Online Clearance for enrollment as a regular student?",
                "Where can I request the Online Clearance for enrollment as a regular student?",
                "Where can I obtain the Online Clearance for enrollment as a regular student?"
            ],
            "responses": [
                "You can accomplish the Online Clearance through the Student Portal"
            ]
        },
        {
            "patterns": [
                "How do I apply for enrollment as a regular student?",
                "What are the steps for enrollment as a regular student?",
                "What is the enrollment process for regular students?",
                "How do I complete my enrollment as a regular student?",
                "What is the process for enrollment as a regular student?"
            ],
            "responses": [
                "To complete your enrollment as a regular student, please follow these steps:\n\n1. Log in to the Student Portal, then click the link Online Registration and complete the enrollment steps.\n 1.1 Click Step 1 for Scholarship if applicable. \n 1.2 Click Step 2 for Adding of courses:\n  - Click \"Load Proposed Subjects\" to view the possible courses to enroll.\n  - Click the \"Select Subject\" tab to add subjects and find the schedule.\n  - Then, click \"Add\" and continue the process until all subjects/courses are added.\n 1.3 Click Step 3 for viewing of added subjects/courses.\n 1.4 Click Step 4 for Assessment.\n 1.5 Click Step 5 for Enrollment Confirmation."
            ]
        },
        {
            "patterns": [
                "How long is the enrollment process for regular students?",
                "What is the duration of the enrollment process for regular students?",
                "How long does the entire enrollment process take for regular students?",
                "How long will it take to complete all the steps for enrollment as a regular student?",
                "What is the duration of the entire enrollment process for regular students?"
            ],
            "responses": [
                "The enrollment process for regular students at BatStateU ARASOF-Nasugbu typically takes about 10 minutes to complete."
            ]
        },
        {
            "patterns": [
                "Is there a fee for the enrollment process for regular students?",
                "How much does the enrollment process cost for regular students?",
                "What are the fees for the entire enrollment process for regular students?",
                "Are there any fees I need to pay during the enrollment process for regular students?",
                "How much is the total cost associated with applying for enrollment as a regular student?"
            ],
            "responses": [
                "There are no fees associated with the enrollment process for regular students. The entire enrollment process is free of charge."
            ]
        },
        {
            "patterns": [
                "Who can I contact for inquiries about the enrollment process for regular students?",
                "Who should I reach out to about the enrollment process for regular students?",
                "Who do I reach out to for questions about the enrollment process for regular students?",
                "How can I contact the Registrar's Office for questions regarding the enrollment process for regular students?",
                "What is the contact information of the Registrar's Office for inquiries related to the enrollment process for regular students?"
            ],
            "responses": [
                "For inquiries about the enrollment process for regular students, you can contact the Registrar's Office. Here are the details:\n\nTelephone: (043) 416-0350 local 214\nEmail: registrar.nasugbu@g.batstate-u.edu.ph\n\nPlease feel free to reach out for any questions or assistance regarding enrollment process."
            ]
        },
        {
            "patterns": [
                "What are the requirements for enrollment as a irregular student?",
                "What documents do I need to submit for enrollment as a irregular student?",
                "What requirements do I need to apply for enrollment as a irregular student?",
                "What documents should I prepare to apply for enrollment as a irregular student?",
                "What are the required documents for the enrollment process for irregular students?"
            ],
            "responses": [
                "To enroll as an irregular student at BatStateU ARASOF-Nasugbu, please prepare the following documents:\n\n1. Report of Grades (1 Original): From the Student Portal or Registration Services Office.\n2. Proposal Slip (1 Original): From the College/Department.\n3. Program of Study (1 Clear Copy): From the College/Department.\n4. Student ID: From the Student Portal or ICT Department.\n\nConditional Requirement: In case, the student cannot personally process:\n - Authorization letter stating the processes to be undertaken by the representative (1 Original)\n - Clear photocopy of student ID (1 copy) and any valid ID of the representative (1 copy), with three (3) specimen signatures"
            ]
        },
        {
            "patterns": [
                "Where can I get the Report of Grades for enrollment as an irregular student?",
                "Where can I request the Report of Grades for enrollment as an irregular student?",
                "Where can I obtain the Report of Grades for enrollment as an irregular student?",
                "Where can I get the Report of Grades for enrollment as an overstaying student?",
                "Where can I request the Report of Grades for enrollment as an overstaying student?",
                "Where can I obtain the Report of Grades for enrollment as an overstaying student?",
                "Where can I get the Report of Grades for enrollment as a returnee student?",
                "Where can I request the Report of Grades for enrollment as a returnee student?",
                "Where can I obtain the Report of Grades for enrollment as a returnee student?",
                "Where can I get the Report of Grades for late enrollment?",
                "Where can I request the Report of Grades for late enrollment?",
                "Where can I obtain the Report of Grades for late enrollment?"
            ],
            "responses": [
                "You can obtain the Report of Grades from the Student Portal or the Registration Services Office."
            ]
        },
        {
            "patterns": [
                "Where can I get the Proposal Slip for enrollment as an irregular student?",
                "Where can I request the Proposal Slip for enrollment as an irregular student?",
                "Where can I obtain the Proposal Slip for enrollment as an irregular student?",
                "Where can I get the Proposal Slip for enrollment as an overstaying student?",
                "Where can I request the Proposal Slip for enrollment as an overstaying student?",
                "Where can I obtain the Proposal Slip for enrollment as an overstaying student?",
                "Where can I get the Proposal Slip for enrollment as a returnee student?",
                "Where can I request the Proposal Slip for enrollment as a returnee student?",
                "Where can I obtain the Proposal Slip for enrollment as a returnee student?"
            ],
            "responses": [
                "You can obtain the Proposal Slip from your College or Department."
            ]
        },
        {
            "patterns": [
                "Where can I get the Program of Study for enrollment as an irregular student?",
                "Where can I request the Program of Study for enrollment as an irregular student?",
                "Where can I obtain the Program of Study for enrollment as an irregular student?",
                "Where can I get the Program of Study for enrollment as an overstaying student?",
                "Where can I request the Program of Study for enrollment as an overstaying student?",
                "Where can I obtain the Program of Study for enrollment as an overstaying student?",
                "Where can I get the Program of Study for enrollment as a returnee student?",
                "Where can I request the Program of Study for enrollment as a returnee student?",
                "Where can I obtain the Program of Study for enrollment as a returnee student?",
                "Where can I get the Program of Study for late enrollment?",
                "Where can I request the Program of Study for late enrollment?",
                "Where can I obtain the Program of Study for late enrollment?"
            ],
            "responses": [
                "You can obtain the Program of Study from your College or Department."
            ]
        },
        {
            "patterns": [
                "Where can I get the Student ID for enrollment as an irregular student?",
                "Where can I request the Student ID for enrollment as an irregular student?",
                "Where can I obtain the Student ID for enrollment as an irregular student?",
                "Where can I get the Student ID for enrollment as an overstaying student?",
                "Where can I request the Student ID for enrollment as an overstaying student?",
                "Where can I obtain the Student ID for enrollment as an overstaying student?",
                "Where can I get the Student ID for enrollment as a returnee student?",
                "Where can I request the Student ID for enrollment as a returnee student?",
                "Where can I obtain the Student ID for enrollment as a returnee student?",
                "Where can I get my Student ID for late enrollment?",
                "Where can I request my Student ID for late enrollment?",
                "Where can I obtain my Student ID for late enrollment?",
                "Where can I get the Student ID for canceling enrolled courses?",
                "Where can I request the Student ID for canceling enrolled courses?",
                "Where can I obtain the Student ID for canceling enrolled courses?",
                "Where can I get the Student ID required for the cancellation of enrollment for first-year students?",
                "Where can I request the Student ID required for the cancellation of enrollment for first-year students?",
                "Where can I obtain the Student ID required for the cancellation of enrollment for first-year students?"
            ],
            "responses": [
                "You can obtain the Student ID through the Student Portal or the ICT Department."
            ]
        },
        {
            "patterns": [
                "How do I apply for enrollment as a irregular student?",
                "What are the steps for enrollment as a irregular student?",
                "What is the enrollment process for irregular students?",
                "How do I complete my enrollment as a irregular student?",
                "What is the process for enrollment as a irregular student?"
            ],
            "responses": [
                "To complete your enrollment as an irregular student at BatStateU ARASOF-Nasugbu, please follow these steps:\n\n1. Proceed to the college/department for evaluation of Report of Grades \n2. Proceed to the Registration Services Office for the validation of enrolled courses and manual enrollment of other courses"
            ]
        },
        {
            "patterns": [
                "How long is the enrollment process for irregular students?",
                "What is the duration of the enrollment process for irregular students?",
                "How long does the entire enrollment process take for irregular students?",
                "How long will it take to complete all the steps for enrollment as a irregular student?",
                "What is the duration of the entire enrollment process for irregular students?"
            ],
            "responses": [
                "The enrollment process for irregular students at BatStateU ARASOF-Nasugbu typically takes about 1 hour to complete."
            ]
        },
        {
            "patterns": [
                "Is there a fee for the enrollment process for irregular students?",
                "How much does the enrollment process cost for irregular students?",
                "What are the fees for the entire enrollment process for irregular students?",
                "Are there any fees I need to pay during the enrollment process for irregular students?",
                "How much is the total cost associated with applying for enrollment as a irregular student?"
            ],
            "responses": [
                "There are no fees associated with the enrollment process for irregular students. The entire enrollment process is free of charge."
            ]
        },
        {
            "patterns": [
                "Who can I contact for inquiries about the enrollment process for irregular students?",
                "Who should I reach out to about the enrollment process for irregular students?",
                "Who do I reach out to for questions about the enrollment process for irregular students?",
                "How can I contact the Registrar's Office for questions regarding the enrollment process for irregular students?",
                "What is the contact information of the Registrar's Office for inquiries related to the enrollment process for irregular students?"
            ],
            "responses": [
                "For inquiries about the enrollment process for irregular students, you can contact the Registrar's Office. Here are the details:\n\nTelephone: (043) 416-0350 local 214\nEmail: registrar.nasugbu@g.batstate-u.edu.ph\n\nPlease feel free to reach out for any questions or assistance regarding enrollment process."
            ]
        },
        {
            "patterns": [
                "What are the requirements for enrollment as an overstaying student?",
                "What documents do I need to submit for enrollment as an overstaying student?",
                "What requirements do I need to apply for enrollment as an overstaying student?",
                "What documents should I prepare to apply for enrollment as an overstaying student?",
                "What are the required documents for the enrollment process for overstaying students?"
            ],
            "responses": [
                "To enroll as an overstaying  student at BatStateU ARASOF-Nasugbu, please prepare the following documents:\n\n1. Report of Grades (1 Original): From the Student Portal or Registration Services Office.\n2. Proposal Slip (1 Original): From the College/Department.\n3. Program of Study (1 Clear Copy): From the College/Department.\n4. Approved Request for Equivalency (if applicable) (1 Original): From the College/Department.\n5. Official Receipt (1 Original/1 e-receipt): From the Cashiering Office.\n6. Student ID: From the Student Portal or ICT Department\n\nConditional Requirement: In case, the student cannot personally process:\n - Authorization letter stating the processes to be undertaken by the representative (1 Original)\n - Clear photocopy of student ID (1 copy) and any valid ID of the representative (1 copy), with three (3) specimen signatures"
            ]
        },
        {
            "patterns": [
                "Where can I get the Approved Request for Equivalency for enrollment as an overstaying student?",
                "Where can I request the Approved Request for Equivalency for enrollment as an overstaying student?",
                "Where can I obtain the Approved Request for Equivalency for enrollment as an overstaying student?",
                "Where can I get the Approved Request for Equivalency for enrollment as a returnee student?",
                "Where can I request the Approved Request for Equivalency for enrollment as a returnee student?",
                "Where can I obtain the Approved Request for Equivalency for enrollment as a returnee student?"
            ],
            "responses": [
                "You can obtain the Request for Equivalency from your College or Department."
            ]
        },
        {
            "patterns": [
                "Where can I get the Official Receipt for enrollment as an overstaying student?",
                "Where can I request the Official Receipt for enrollment as an overstaying student?",
                "Where can I obtain the Official Receipt for enrollment as an overstaying student?",
                "Where can I get the Official Receipt for enrollment as a returnee student?",
                "Where can I request the Official Receipt for enrollment as a returnee student?",
                "Where can I obtain the Official Receipt for enrollment as a returnee student?"
            ],
            "responses": [
                "You can obtain the Official Reciept from the Cashiering Office."
            ]
        },
        {
            "patterns": [
                "How do I apply for enrollment as an overstaying student?",
                "What are the steps for enrollment as an overstaying student?",
                "What is the enrollment process for overstaying students?",
                "How do I complete my enrollment as an overstaying student?",
                "What is the process for enrollment as an overstaying student?"
            ],
            "responses": [
                "To complete your enrollment as an overstaying student at BatStateU ARASOF-Nasugbu, please follow these steps:\n\n1. Proceed to the college/department for evaluation of Report of Grades \n2. Proceed to the Registration Services Office for enrollment of courses\n3. Submit the required documents to the Accounting Office for assessment\n4. Proceed to the Cashiering Office for payment\n5. Proceed to the Registration Services Office for validation of enrollment"
            ]
        },
        {
            "patterns": [
                "How long is the enrollment process for overstaying students?",
                "What is the duration of the enrollment process for overstaying students?",
                "How long does the entire enrollment process take for overstaying students?",
                "How long will it take to complete all the steps for enrollment as an overstaying student?",
                "What is the duration of the entire enrollment process for overstaying students?"
            ],
            "responses": [
                "The enrollment process for overstaying students at BatStateU ARASOF-Nasugbu typically takes about 1 hour to complete."
            ]
        },
        {
            "patterns": [
                "Is there a fee for the enrollment process for overstaying students?",
                "How much does the enrollment process cost for overstaying students?",
                "What are the fees for the entire enrollment process for overstaying students?",
                "Are there any fees I need to pay during the enrollment process for overstaying students?",
                "How much is the total cost associated with applying for enrollment as an overstaying student?"
            ],
            "responses": [
                "Here are the fees for enrollment as an overstaying student at BatStateU ARASOF-Nasugbu:\n\n- Tuition Fee – Php 250/unit \n- Registration – Php 260\n- Library Fee – PHP 622 \n- Athletic Fee – PHP 380 \n- Publication Fee – Php 380\n- Medical & Dental Fee – Php 380\n- Guidance Fee – Php 260 \n- Laboratory Fee -Php 751 \n- NSTP – Php 375\n- Anti-TB – Php 15 \n- SCUAA – Php 130\n- Cultural Fee – Php 173 \n- Security Fee – Php 173 \n- HEMF – Php 86/unit \n- Internet – Php 300 \n- SSC – Php 25\n- Insurance – Php 50\n**Non-Resident Fee – Php 10,000\n***RLE Fee = (Total Honorarium of Faculty + 30% Indirect Cost)/Total Number of Enrolled Students"
            ]
        },
        {
            "patterns": [
                "Who can I contact for inquiries about the enrollment process for overstaying students?",
                "Who should I reach out to about the enrollment process for overstaying students?",
                "Who do I reach out to for questions about the enrollment process for overstaying students?",
                "How can I contact the Registrar's Office for questions regarding the enrollment process for overstaying students?",
                "What is the contact information of the Registrar's Office for inquiries related to the enrollment process for overstaying students?"
            ],
            "responses": [
                "For inquiries about the enrollment process for overstaying students, you can contact the Registrar's Office. Here are the details:\n\nTelephone: (043) 416-0350 local 214\nEmail: registrar.nasugbu@g.batstate-u.edu.ph\n\nPlease feel free to reach out for any questions or assistance regarding enrollment process."
            ]
        },
        {
            "patterns": [
                "What are the requirements for enrollment as a returnee student?",
                "What documents do I need to submit for enrollment as a returnee student?",
                "What requirements do I need to apply for enrollment as a returnee student?",
                "What documents should I prepare to apply for enrollment as a returnee student?",
                "What are the required documents for the enrollment process for returnee students?"
            ],
            "responses": [
                "To enroll as a returnee student at BatStateU ARASOF-Nasugbu, please prepare the following documents:\n\n1. Report of Grades (1 Certified True Copy): From the Student Portal or Registration Services Office.\n2. Evaluation Form for Returnee ( 1 Original): From the Student Portal or Registration Services Office.\n3. Approved Leave of Absence (LOA), if applicable (1 Clear Copy)\n4. Proposal Slip (1 Original): From the College/Department.\n5. Program of Study (1 Clear Copy): From the College/Department.\n6. Approved Request for Equivalency (if applicable) (1 Original): From the College/Department.\n7. Student ID: From the Student Portal or ICT Department\nProgram Curriculum (1 Clear Copy): From the College/Department.\n\nConditional Requirement: In case, the student cannot personally process:\n - Authorization letter stating the processes to be undertaken by the representative (1 Original)\n - Clear photocopy of student ID (1 copy) and any valid ID of the representative (1 copy), with three (3) specimen signatures"
            ]
        },
        {
            "patterns": [
                "Where can I get the Evaluation Form for enrollment as a returnee student?",
                "Where can I request the Evaluation Form for enrollment as a returnee student?",
                "Where can I obtain the Evaluation Form for enrollment as a returnee student?"
            ],
            "responses": [
                "You can obtain the Evaluation Form for Returnee from the Student Portal or the Registration Services Office."
            ]
        },
        {
            "patterns": [
                "Where can I get the Program Curriculum for enrollment as a returnee student?",
                "Where can I request the Program Curriculum for enrollment as a returnee student?",
                "Where can I obtain the Program Curriculum for enrollment as a returnee student?"
            ],
            "responses": [
                "You can obtain the Program Curriculum from your College or Department."
            ]
        },
        {
            "patterns": [
                "How do I apply for enrollment as a returnee student?",
                "What are the steps for enrollment as a returnee student?",
                "What is the enrollment process for returnee students?",
                "How do I complete my enrollment as a returnee student?",
                "What is the process for enrollment as a returnee student?"
            ],
            "responses": [
                "To complete your enrollment as a returnee student at BatStateU ARASOF-Nasugbu, please follow these steps:\n\n1. Secure an Evaluation Form for Returnee, download the form from Student Portal or request thru the official email address of the Registration Services Office: registrar.nasugbu@g.batstate- u.edu.ph\n2. Submit the Evaluation Form for Returnee to the college/department for evaluation\n3. Proceed to the Registration Services Office for enrollment"
            ]
        },
        {
            "patterns": [
                "How long is the enrollment process for returnee students?",
                "What is the duration of the enrollment process for returnee students?",
                "How long does the entire enrollment process take for returnee students?",
                "How long will it take to complete all the steps for enrollment as a returnee student?",
                "What is the duration of the entire enrollment process for returnee students?"
            ],
            "responses": [
                "The enrollment process for returnee students at BatStateU ARASOF-Nasugbu typically takes about 1 hour to complete."
            ]
        },
        {
            "patterns": [
                "Is there a fee for the enrollment process for returnee students?",
                "How much does the enrollment process cost for returnee students?",
                "What are the fees for the entire enrollment process for returnee students?",
                "Are there any fees I need to pay during the enrollment process for returnee students?",
                "How much is the total cost associated with applying for enrollment as a returnee student?"
            ],
            "responses": [
                "There are no fees associated with the enrollment process for returnee students. The entire enrollment process is free of charge."
            ]
        },
        {
            "patterns": [
                "Who can I contact for inquiries about the enrollment process for returnee students?",
                "Who should I reach out to about the enrollment process for returnee students?",
                "Who do I reach out to for questions about the enrollment process for returnee students?",
                "How can I contact the Registrar's Office for questions regarding the enrollment process for returnee students?",
                "What is the contact information of the Registrar's Office for inquiries related to the enrollment process for returnee students?"
            ],
            "responses": [
                "For inquiries about the enrollment process for returnee students, you can contact the Registrar's Office. Here are the details:\n\nTelephone: (043) 416-0350 local 214\nEmail: registrar.nasugbu@g.batstate-u.edu.ph\n\nPlease feel free to reach out for any questions or assistance regarding enrollment process."
            ]
        },
        {
            "patterns": [
                "What are the requirements for enrollment as a late enrollee?",
                "What documents do I need to submit for enrollment as a late enrollee?",
                "What requirements do I need to apply for enrollment as a late enrollee?",
                "What documents should I prepare to apply for enrollment as a late enrollee?",
                "What are the required documents for the enrollment process for late enrollees at BatStateU ARASOF-Nasugbu?",
                "What are the requirements for late enrollment?",
                "What documents do I need to submit for late enrollment?",
                "What requirements do I need to apply for late enrollment?",
                "What documents should I prepare to apply for late enrollment?",
                "What are the required documents for the late enrollment process?"
            ],
            "responses": [
                "To enroll as a late enrollee at BatStateU ARASOF-Nasugbu, please prepare the following documents:\n\n1. Accommodation Form for Late Enrollment (1 Original): From the College/Department.\n2. Program of Study , if applicable (1 Clear Copy): From the College/Department.\n3. Report of Grades (1 Certified True Copy): From the Student Portal or Registration Services Office.\n4. Student ID: From the Student Portal or ICT Department\n\nConditional Requirement: In case, the student cannot personally process:\n - Authorization letter stating the processes to be undertaken by the representative (1 Original)\n - Clear photocopy of student ID (1 copy) and any valid ID of the representative (1 copy), with three (3) specimen signatures"
            ]
        },
        {
            "patterns": [
                "Where can I get the Accommodation Form for late enrollment?",
                "Where can I request the Accommodation Form for late enrollment?",
                "Where can I obtain the Accommodation Form for late enrollment?"
            ],
            "responses": [
                "You can obtain the Accomodation Form for Late Enrollment from your College or Department."
            ]
        },
        {
            "patterns": [
                "How do I apply for enrollment as a late enrollee?",
                "What are the steps for enrollment as a late enrollee?",
                "What is the enrollment process for late enrollees?",
                "How do I complete my enrollment as a late enrollee?",
                "What is the process for enrollment as a late enrollee?",
                "How do I apply for late enrollment?",
                "What are the steps for late enrollment?",
                "What is the late enrollment process?",
                "How do I complete my late enrollment?",
                "What is the process for late enrollment?"
            ],
            "responses": [
                "To complete your enrollment as a late enrollee at BatStateU ARASOF-Nasugbu, please follow these steps:\n\n1. Proceed to the college/department for evaluation\n2. Proceed to the Vice Chancellor for Academic Affairs for approval\n3. Submit the approved accommodation form to the Registration Services Office for enrollment"
            ]
        },
        {
            "patterns": [
                "How long is the enrollment process for late enrollees?",
                "What is the duration of the enrollment process for late enrollees?",
                "How long does the entire enrollment process take for late enrollees?",
                "How long will it take to complete all the steps for enrollment as a late enrollee?",
                "What is the duration of the entire enrollment process for late enrollees?",
                "How long is the late enrollment process for students?",
                "What is the duration of the late enrollment process?",
                "How long does the entire late enrollment process take?",
                "How long will it take to complete all the steps for late enrollment?",
                "What is the duration of the entire late enrollment process?"
            ],
            "responses": [
                "The enrollment process for late enrollees at BatStateU ARASOF-Nasugbu typically takes about 1 hour to complete."
            ]
        },
        {
            "patterns": [
                "Is there a fee for the enrollment process for late enrollees?",
                "How much does the enrollment process cost for late enrollees?",
                "What are the fees for the entire enrollment process for late enrollees?",
                "Are there any fees I need to pay during the enrollment process for late enrollees?",
                "How much is the total cost associated with applying for enrollment as a late enrollee?",
                "Is there a fee for the late enrollment process?",
                "How much does the late enrollment process cost?",
                "What are the fees for the entire late enrollment process?",
                "Are there any fees I need to pay during the late enrollment process?",
                "How much is the total cost associated with applying for late enrollment?"
            ],
            "responses": [
                "There are no fees associated with the enrollment process for late enrollees. The entire enrollment process is free of charge."
            ]
        },
        {
            "patterns": [
                "Who can I contact for inquiries about the enrollment process for late enrollees?",
                "Who should I reach out to about the enrollment process for late enrollees?",
                "Who do I reach out to for questions about the enrollment process for late enrollees?",
                "How can I contact the Registrar's Office for questions regarding the enrollment process for late enrollees?",
                "What is the contact information of the Registrar's Office for inquiries related to the enrollment process for late enrollees?"
            ],
            "responses": [
                "For inquiries about the enrollment process for late enrollees, you can contact the Registrar's Office. Here are the details:\n\nTelephone: (043) 416-0350 local 214\nEmail: registrar.nasugbu@g.batstate-u.edu.ph\n\nPlease feel free to reach out for any questions or assistance regarding enrollment process."
            ]
        },
        {
            "patterns": [
                "What are the requirements for canceling enrolled courses?",
                "What documents are required for canceling enrolled courses?",
                "What do I need to cancel enrolled courses?",
                "What documents should I prepare to cancel enrolled courses?",
                "What are the required documents for the cancellation of enrolled courses?"
            ],
            "responses": [
                "To cancel enrolled courses at BatStateU ARASOF-Nasugbu, you need to prepare the following:\n\n1. Cancellation of Enrollment Form (1 Original): From the Student Portal / Registration Services Office\n2. Student ID: From the Student Portal / ICT Department\n\nConditional Requirement: In case, the student cannot personally process:\n - Authorization letter stating the processes to be undertaken by the representative (1 Original)\n - Clear photocopy of student ID (1 copy) and any valid ID of the representative (1 copy), with three (3) specimen signatures"
            ]
        },
        {
            "patterns": [
                "Where can I get the Cancellation of Enrollment Form?",
                "Where can I request the Cancellation of Enrollment Form?",
                "Where can I obtain the Cancellation of Enrollment Form? ",
                "Where can I get the Cancellation of Enrollment Form for first-year students?",
                "Where can I request the Cancellation of Enrollment Form for first-year students?",
                "Where can I obtain the Cancellation of Enrollment Form for first-year students?"
            ],
            "responses": [
                "You can obtain the Cancellation of Enrollment Form through the Student Portal or the Registration Services Office."
            ]
        },
        {
            "patterns": [
                "How do I cancel my enrolled courses?",
                "What are the steps for canceling enrolled courses?",
                "What is the cancellation process for enrolled courses?",
                "How do I complete the cancellation of enrolled courses?",
                "What is the process for the cancellation of enrolled courses?"
            ],
            "responses": [
                "To complete your cancellation of enrolled courses, please follow these steps:\n\n1. Proceed to the Registration Services Office for evaluation\n2. Submit the duly signed form to the Registration Services Office"
            ]
        },
        {
            "patterns": [
                "How long is the cancellation process for enrolled courses?",
                "What is the duration of the cancellation process for enrolled courses?",
                "How long does the entire cancellation process take for enrolled courses?",
                "How long will it take to complete all the steps for canceling enrolled courses?",
                "What is the duration of the entire cancellation process for enrolled courses?"
            ],
            "responses": [
                "The cancellation process of enrolled courses at BatStateU ARASOF-Nasugbu typically takes about 30 minutes to complete."
            ]
        },
        {
            "patterns": [
                "Is there a fee for the cancellation process of enrolled courses?",
                "How much does the cancellation process for enrolled courses cost?",
                "What are the fees for the entire cancellation process of enrolled courses?",
                "Are there any fees I need to pay during the cancellation of enrolled courses?",
                "How much is the total cost associated with canceling enrolled courses?"
            ],
            "responses": [
                "There are no fees associated with the cancellation process of enrolled courses. The entire cancellation process is free of charge."
            ]
        },
        {
            "patterns": [
                "When is the deadline for canceling enrolled courses?"
            ],
            "responses": [
                "For the deadline of cancellation of enrolled coursse, please refer to the official announcements from the Registrar's Office or contact them directly for the most up-to-date information. You can reach the Registrar's Office at:\n\nTelephone: (043) 416-0350 local 214\nEmail: registrar.nasugbu@g.batstate-u.edu.ph"
            ]
        },
        {
            "patterns": [
                "Who can I contact for inquiries about canceling enrolled courses?",
                "Who should I reach out to for canceling enrolled courses?",
                "Who do I contact for questions about canceling enrolled courses?",
                "How can I contact the Registrar's Office for questions about canceling enrolled courses?",
                "What is the contact information of the Registrar's Office for inquiries about canceling enrolled courses?"
            ],
            "responses": [
                "For inquiries about the cancellation of enrolled courses, you can contact the Registrar's Office. Here are the details:\n\nTelephone: (043) 416-0350 local 214\nEmail: registrar.nasugbu@g.batstate-u.edu.ph\n\nPlease feel free to reach out for any questions or assistance regarding cancellation process."
            ]
        },
        {
            "patterns": [
                "What are the requirements for the cancellation of enrollment for first-year students?",
                "What documents are required for the cancellation of enrollment for first-year students?",
                "What do I need to cancel enrollment as a first-year student?",
                "What documents should I prepare to cancel enrollment as a first-year student?",
                "What are the required documents for the cancellation of enrollment for first-year students?"
            ],
            "responses": [
                "To cancel the enrollment of a first-year student at BatStateU ARASOF-Nasugbu, you need to prepare the following:\n\n1. Cancellation of Enrollment Form (1 Original): From the Student Portal / Registration Services Office\n2. Student ID: From the Student Portal / ICT Department\n\nConditional Requirement: In case, the student cannot personally process:\n - Authorization letter stating the processes to be undertaken by the representative (1 Original)\n - Clear photocopy of student ID (1 copy) and any valid ID of the representative (1 copy), with three (3) specimen signatures"
            ]
        },
        {
            "patterns": [
                "How do I cancel my enrollment as a first-year student?",
                "What are the steps for canceling enrollment as a first-year student?",
                "What is the cancellation process for enrollment as a first-year student?",
                "How do I complete the cancellation of enrollment as a first-year student?",
                "What is the process for the cancellation of enrollment as a first-year student?"
            ],
            "responses": [
                "To complete your cancellation of enrollment as a first-year student, please follow these steps:\n\n1. Proceed to the Registration Services Office for evaluation\n2. Submit the duly signed form to the Registration Services Office\n3. Sign the Outgoing Document logbook"
            ]
        },
        {
            "patterns": [
                "How long is the cancellation process for enrollment of a first-year student?",
                "What is the duration of the cancellation process for enrollment of a first-year student?",
                "How long does the entire cancellation process take for a first-year student’s enrollment?",
                "How long will it take to complete all the steps for canceling enrollment as a first-year student?",
                "What is the duration of the entire cancellation process for enrollment of a first-year student?"
            ],
            "responses": [
                "The cancellation of enrollment for first-year students at BatStateU ARASOF-Nasugbu typically takes about 30 minutes to complete."
            ]
        },
        {
            "patterns": [
                "Is there a fee for the cancellation process of enrollment as a first-year student?",
                "How much does the cancellation process for enrollment of a first-year student cost?",
                "What are the fees for the entire cancellation process of enrollment for a first-year student?",
                "Are there any fees I need to pay during the cancellation of enrollment as a first-year student?",
                "How much is the total cost associated with canceling enrollment for a first-year student?"
            ],
            "responses": [
                "There are no fees associated with the cancellation of enrollment for first-year students. The entire cancellation process is free of charge."
            ]
        },
        {
            "patterns": [
                "When is the deadline for canceling enrollment for a first-year student?"
            ],
            "responses": [
                "For the deadline of cancellation of enrollment, please refer to the official announcements from the Registrar's Office or contact them directly for the most up-to-date information. You can reach the Registrar's Office at:\n\nTelephone: (043) 416-0350 local 214\nEmail: registrar.nasugbu@g.batstate-u.edu.ph"
            ]
        },
        {
            "patterns": [
                "Who can I contact for inquiries about canceling enrollment as a first-year student?",
                "Who should I reach out to for canceling enrollment as a first-year student?",
                "Who do I contact for questions about canceling enrollment as a first-year student?",
                "How can I contact the Registrar's Office for questions about canceling enrollment for a first-year student?",
                "What is the contact information of the Registrar's Office for inquiries about canceling enrollment as a first-year student?"
            ],
            "responses": [
                "For inquiries about the cancellation of enrollement as a first-year student, you can contact the Registrar's Office. Here are the details:\n\nTelephone: (043) 416-0350 local 214\nEmail: registrar.nasugbu@g.batstate-u.edu.ph\n\nPlease feel free to reach out for any questions or assistance regarding cancellation process."
            ]
        },
        {
            "patterns": [
                "What are the requirements for adding courses?",
                "What documents do I need to submit to add courses?",
                "What requirements do I need to apply for adding courses?",
                "What documents should I prepare to apply for adding courses?",
                "What are the required documents for the process of adding courses?"
            ],
            "responses": [
                "To add courses at BatStateU ARASOF-Nasugbu, please prepare the following documents:\n\n1. Adding/Changing/Dropping of Courses Form: From the Registration Services Office or download from the Student Portal at https://dione.batstate-u.edu.ph/student/#/dashboard.\n2. Student ID: From the Student Portal or ICT Department.\n3. Program of Study (1 Clear Copy): From your respective College or Department.\n\nConditional Requirement: In case, the student cannot personally process:\n - Authorization letter stating the processes to be undertaken by the representative (1 Original)\n - Clear photocopy of student ID (1 copy) and any valid ID of the representative (1 copy), with three (3) specimen signatures"
            ]
        },
        {
            "patterns": [
                "What are the requirements for changing courses?",
                "What documents do I need to submit to change courses?",
                "What requirements do I need to apply for changing courses?",
                "What documents should I prepare to apply for changing courses?",
                "What are the required documents for the process of changing courses?"
            ],
            "responses": [
                "To change courses at BatStateU ARASOF-Nasugbu, please prepare the following documents:\n\n1. Adding/Changing/Dropping of Courses Form: From the Registration Services Office or download from the Student Portal at https://dione.batstate-u.edu.ph/student/#/dashboard.\n2. Student ID: From the Student Portal or ICT Department.\n3. Program of Study (1 Clear Copy): From your respective College or Department.\n\nConditional Requirement: In case, the student cannot personally process:\n - Authorization letter stating the processes to be undertaken by the representative (1 Original)\n - Clear photocopy of student ID (1 copy) and any valid ID of the representative (1 copy), with three (3) specimen signatures"
            ]
        },
        {
            "patterns": [
                "What are the requirements for dropping courses?",
                "What documents do I need to submit to drop courses?",
                "What requirements do I need to apply for dropping courses?",
                "What documents should I prepare to apply for dropping courses?",
                "What are the required documents for the process of dropping courses?"
            ],
            "responses": [
                "To drop courses at BatStateU ARASOF-Nasugbu, please prepare the following documents:\n\n1. Adding/Changing/Dropping of Courses Form: From the Registration Services Office or download from the Student Portal at https://dione.batstate-u.edu.ph/student/#/dashboard.\n2. Student ID: From the Student Portal or ICT Department.\n3. Program of Study (1 Clear Copy): From your respective College or Department.\n\nConditional Requirement: In case, the student cannot personally process:\n - Authorization letter stating the processes to be undertaken by the representative (1 Original)\n - Clear photocopy of student ID (1 copy) and any valid ID of the representative (1 copy), with three (3) specimen signatures"
            ]
        },
        {
            "patterns": [
                "Where can I get the Adding of Courses Form?",
                "Where can I request the Adding of Courses Form?",
                "Where can I obtain the Adding of Courses Form?",
                "Where can I get the Changing of Courses Form?",
                "Where can I request the Changing of Courses Form?",
                "Where can I obtain the Changing of Courses Form?",
                "Where can I get the Dropping of Courses Form?",
                "Where can I request the Dropping of Courses Form?",
                "Where can I obtain the Dropping of Courses Form?"
            ],
            "responses": [
                "You can obtain the Adding/Changing/Dropping of Courses Form from the Registration Services Office or download it from the Student Portal at https://dione.batstate-u.edu.ph/student/#/dashboard."
            ]
        },
        {
            "patterns": [
                "Where can I get the Program of Study for adding a course?",
                "Where can I request the Program of Study for adding a course?",
                "Where can I obtain the Program of Study for adding a course?",
                "Where can I get the Program of Study for changing a course?",
                "Where can I request the Program of Study for changing a course?",
                "Where can I obtain the Program of Study for changing a course?",
                "Where can I get the Program of Study for dropping a course?",
                "Where can I request the Program of Study for dropping a course?",
                "Where can I obtain the Program of Study for dropping a course?",
                "Where can I get the Program of Study for course overloading?",
                "Where can I request the Program of Study for course overloading?",
                "Where can I obtain the Program of Study for course overloading?"
            ],
            "responses": [
                "You can obtain the Program of Study from your respective College or Department."
            ]
        },
        {
            "patterns": [
                "Where can I get my Student ID for the process of adding a course?",
                "Where can I request my Student ID for the process of adding a course?",
                "Where can I obtain my Student ID for the process of adding a course?",
                "Where can I get my Student ID for the process of changing a course?",
                "Where can I request my Student ID for the process of changing a course?",
                "Where can I obtain my Student ID for the process of changing a course?",
                "Where can I get my Student ID for the process of dropping a course?",
                "Where can I request my Student ID for the process of dropping a course?",
                "Where can I obtain my Student ID for the process of dropping a course?"
            ],
            "responses": [
                "You can obtain your Student ID at the Student Portal or ICT Department"
            ]
        },
        {
            "patterns": [
                "How do I add courses?",
                "What are the steps for adding courses?",
                "What is the adding courses process?",
                "How do I complete the process of adding courses?",
                "What is the process for adding courses?"
            ],
            "responses": [
                "To complete the process of adding courses at BatStateU ARASOF-Nasugbu, please follow these steps:\n\n1. Proceed to the respective college for preliminary evaluation and signature of the accomplished Adding/ Changing/Dropping of Courses form\n2. Submit to the Registration Services Office the Adding, Changing and Dropping of Courses form approved by the College's Dean/Associate Dean/Program Chairperson\n3. Submit the Adding, Changing/ Dropping of Courses form to the Assessment Office for reassessment of fees\n4. Submit the signed form from the Accounting Office to the Registration Services Office"
            ]
        },
        {
            "patterns": [
                "How do I change courses?",
                "What are the steps for changing courses?",
                "What is the changing courses process?",
                "How do I complete the process of changing courses?",
                "What is the process for changing courses?"
            ],
            "responses": [
                "To complete the process of changing courses at BatStateU ARASOF-Nasugbu, please follow these steps:\n\n1. Proceed to the respective college for preliminary evaluation and signature of the accomplished Adding/ Changing/Dropping of Courses form\n2. Submit to the Registration Services Office the Adding, Changing and Dropping of Courses form approved by the College's Dean/Associate Dean/Program Chairperson\n3. Submit the Adding, Changing/ Dropping of Courses form to the Assessment Office for reassessment of fees\n4. Submit the signed form from the Accounting Office to the Registration Services Office"
            ]
        },
        {
            "patterns": [
                "How do I drop courses?",
                "What are the steps for dropping courses?",
                "What is the dropping courses process?",
                "How do I complete the process of dropping courses?",
                "What is the process for dropping courses?"
            ],
            "responses": [
                "To complete the process of dropping courses at BatStateU ARASOF-Nasugbu, please follow these steps:\n\n1. Proceed to the respective college for preliminary evaluation and signature of the accomplished Adding/ Changing/Dropping of Courses form\n2. Submit to the Registration Services Office the Adding, Changing and Dropping of Courses form approved by the College's Dean/Associate Dean/Program Chairperson\n3. Submit the Adding, Changing/ Dropping of Courses form to the Assessment Office for reassessment of fees\n4. Submit the signed form from the Accounting Office to the Registration Services Office"
            ]
        },
        {
            "patterns": [
                "How long is the process for adding courses?",
                "What is the duration of the process for adding courses?",
                "How long does the entire process take for adding courses?",
                "How long will it take to complete all the steps for adding courses?",
                "What is the duration of the entire process for adding courses?"
            ],
            "responses": [
                "The process for adding courses typically takes about 35 minutes to complete."
            ]
        },
        {
            "patterns": [
                "How long is the process for changing courses?",
                "What is the duration of the process for changing courses?",
                "How long does the entire process take for changing courses?",
                "How long will it take to complete all the steps for changing courses?",
                "What is the duration of the entire process for changing courses?"
            ],
            "responses": [
                "The process for changing courses typically takes about 35 minutes to complete."
            ]
        },
        {
            "patterns": [
                "How long is the process for dropping courses?",
                "What is the duration of the process for dropping courses?",
                "How long does the entire process take for dropping courses?",
                "How long will it take to complete all the steps for dropping courses?",
                "What is the duration of the entire process for dropping courses?"
            ],
            "responses": [
                "The process for dropping courses typically takes about 35 minutes to complete."
            ]
        },
        {
            "patterns": [
                "Is there a fee for the process of adding courses?",
                "How much does the process of adding courses cost?",
                "What are the fees for the entire process of adding courses?",
                "Are there any fees I need to pay during the process of adding courses?",
                "How much is the total cost associated with adding courses?"
            ],
            "responses": [
                "There are no fees associated with the process of adding courses. The entire process is free of charge."
            ]
        },
        {
            "patterns": [
                "Is there a fee for the process of changing courses?",
                "How much does the process of changing courses cost?",
                "What are the fees for the entire process of changing courses?",
                "Are there any fees I need to pay during the process of changing courses?",
                "How much is the total cost associated with changing courses?"
            ],
            "responses": [
                "There are no fees associated with the process of changing courses. The entire process is free of charge."
            ]
        },
        {
            "patterns": [
                "Is there a fee for the process of dropping courses?",
                "How much does the process of dropping courses cost?",
                "What are the fees for the entire process of dropping courses?",
                "Are there any fees I need to pay during the process of dropping courses?",
                "How much is the total cost associated with dropping courses?"
            ],
            "responses": [
                "There are no fees associated with the process of dropping courses. The entire process is free of charge."
            ]
        },
        {
            "patterns": [
                "When can I submit my request for adding courses?",
                "When does the period for adding courses begin and end?"
            ],
            "responses": [
                "For the period for adding courses, please refer to the official announcements from the Registrar's Office or contact them directly for the most up-to-date information. You can reach the Registrar's Office at:\n\nTelephone: (043) 416-0350 local 214\nEmail: registrar.nasugbu@g.batstate-u.edu.ph"
            ]
        },
        {
            "patterns": [
                "When is the deadline for adding courses?"
            ],
            "responses": [
                "For the deadline for adding courses, please refer to the official announcements from the Registrar's Office or contact them directly for the most up-to-date information. You can reach the Registrar's Office at:\n\nTelephone: (043) 416-0350 local 214\nEmail: registrar.nasugbu@g.batstate-u.edu.ph"
            ]
        },
        {
            "patterns": [
                "When can I submit my request for changing courses?",
                "When does the period for changing courses begin and end?",
                "When is the deadline for changing courses?"
            ],
            "responses": [
                "For the period for changing courses, please refer to the official announcements from the Registrar's Office or contact them directly for the most up-to-date information. You can reach the Registrar's Office at:\n\nTelephone: (043) 416-0350 local 214\nEmail: registrar.nasugbu@g.batstate-u.edu.ph"
            ]
        },
        {
            "patterns": [
                "When can I submit my request for dropping courses?",
                "When does the period for dropping courses begin and end?",
                "When is the deadline for dropping courses?"
            ],
            "responses": [
                "For the period for dropping courses, please refer to the official announcements from the Registrar's Office or contact them directly for the most up-to-date information. You can reach the Registrar's Office at:\n\nTelephone: (043) 416-0350 local 214\nEmail: registrar.nasugbu@g.batstate-u.edu.ph"
            ]
        },
        {
            "patterns": [
                "Who can I contact for inquiries about the process of adding courses?",
                "Who should I reach out to about adding courses?",
                "Who do I reach out to for questions about adding courses?",
                "How can I contact the Registrar's Office for questions regarding adding courses?",
                "What is the contact information of the Registrar's Office for inquiries related to adding courses?",
                "Who can I contact for inquiries about the process of changing courses?",
                "Who should I reach out to about changing courses?",
                "Who do I reach out to for questions about changing courses?",
                "How can I contact the Registrar's Office for questions regarding changing courses?",
                "What is the contact information of the Registrar's Office for inquiries related to changing courses?",
                "Who can I contact for inquiries about the process of dropping courses?",
                "Who should I reach out to about dropping courses?",
                "Who do I reach out to for questions about dropping courses?",
                "How can I contact the Registrar's Office for questions regarding dropping courses?",
                "What is the contact information of the Registrar's Office for inquiries related to dropping courses?"
            ],
            "responses": [
                "For inquiries about the process of adding, changing, or dropping courses, you can contact the Registrar's Office. Here are the details:\n\nTelephone: (043) 416-0350 local 214\nEmail: registrar.nasugbu@g.batstate-u.edu.ph\n\nPlease feel free to reach out for any questions or assistance regarding the process."
            ]
        },
        {
            "patterns": [
                "What are the requirements for requesting course overloading?",
                "What documents do I need to submit for requesting course overloading?",
                "What requirements do I need to apply for course overloading?",
                "What documents should I prepare to apply for course overloading?",
                "What are the required documents for the course overloading process?"
            ],
            "responses": [
                "To request course overloading at BatStateU ARASOF-Nasugbu, please prepare the following documents:\n\n1. Accomplished Request for Course/s Overload Form: From the Registration Services Office or downloadable from the Student Portal at https://dione.batstate-u.edu.ph/student/#/dashboard.\n2. Student ID: From the Student Portal or ICT Department.\n3. Program of Study (1 Clear Copy): From your respective College or Department.\n4. Program Curriculum (1 Original): From your respective College or Department.\n\nConditional Requirement: In case, the student cannot personally process:\n - Authorization letter stating the processes to be undertaken by the representative (1 Original)\n - Clear photocopy of student ID (1 copy) and any valid ID of the representative (1 copy), with three (3) specimen signatures"
            ]
        },
        {
            "patterns": [
                "Where can I get the Request for Course/s Overload Form for course overloading?",
                "Where can I request the Request for Course/s Overload Form for course overloading?",
                "Where can I obtain the Request for Course/s Overload Form for course overloading?"
            ],
            "responses": [
                "You can obtain the Request for Course/s Overload Form from the Registration Services Office or download it from the Student Portal at https://dione.batstate-u.edu.ph/student/#/dashboard."
            ]
        },
        {
            "patterns": [
                "Where can I get my Student ID for the course overloading process?",
                "Where can I request my Student ID for the course overloading process?",
                "Where can I obtain my Student ID for the course overloading process?",
                "Where can I get my Student ID for the Leave of Absence application?",
                "Where can I request my Student ID for the Leave of Absence application?",
                "Where can I obtain my Student ID for the Leave of Absence application?",
                "Where can I get my Student ID for the request of Report of Grades?",
                "Where can I request my Student ID for the request of Report of Grades?",
                "Where can I obtain my Student ID for the request of Report of Grades?"
            ],
            "responses": [
                "You can obtain your Student ID from the Student Portal or the ICT Department."
            ]
        },
        {
            "patterns": [
                "Where can I get the Program Curriculum for course overloading?",
                "Where can I request the Program Curriculum for course overloading?",
                "Where can I obtain the Program Curriculum for course overloading?"
            ],
            "responses": [
                "You can obtain the Program Curriculum from your respective College or Department."
            ]
        },
        {
            "patterns": [
                "How do I apply for course overloading?",
                "What are the steps for requesting course overloading?",
                "What is the course overloading process?",
                "How do I complete my request for course overloading?",
                "What is the process for requesting course overloading?"
            ],
            "responses": [
                "To complete the process of course overloading at BatStateU ARASOF-Nasugbu, please follow these steps:\n\n1. Proceed to the respective college for preliminary evaluation and approval of the accomplished Request for Course/s Overloading form\n2. Submit to the Registration Services Office the Adding, Changing and Dropping of Courses form approved by the College's Department/Program Chair and the Dean\n3. Proceed to the Assessment Office for reassessment of fees\n4. Submit the signed form from the Accounting Office to the Registration Services Office"
            ]
        },
        {
            "patterns": [
                "How long is the course overloading process?",
                "What is the duration of the course overloading process?",
                "How long does the entire course overloading process take?",
                "How long will it take to complete all the steps for requesting course overloading?",
                "What is the duration of the entire course overloading process?"
            ],
            "responses": [
                "The process for course overloading typically takes about 25 minutes to complete."
            ]
        },
        {
            "patterns": [
                "Is there a fee for the course overloading process?",
                "How much does the course overloading process cost?",
                "How much are the fees for the entire course overloading process?",
                "Are there any fees I need to pay during the course overloading process?",
                "How much is the total cost associated with course overloading?"
            ],
            "responses": [
                "There are no fees associated with the course overloading process. The entire process is free of charge."
            ]
        },
        {
            "patterns": [
                "When can I submit my requests for course overloading?",
                "When does the period for course overloading begin and end?"
            ],
            "responses": [
                "For the period for course overloading, please refer to the official announcements from the Registrar's Office or contact them directly for the most up-to-date information. You can reach the Registrar's Office at:\n\nTelephone: (043) 416-0350 local 214\nEmail: registrar.nasugbu@g.batstate-u.edu.ph"
            ]
        },
        {
            "patterns": [
                "When is the deadline for course overloading?"
            ],
            "responses": [
                "For the deadline for course overloading, please refer to the official announcements from the Registrar's Office or contact them directly for the most up-to-date information. You can reach the Registrar's Office at:\n\nTelephone: (043) 416-0350 local 214\nEmail: registrar.nasugbu@g.batstate-u.edu.ph"
            ]
        },
        {
            "patterns": [
                "Who can I contact for inquiries about the process of course overloading?",
                "Who should I reach out to about course overloading?",
                "Who do I reach out to for questions about course overloading?",
                "How can I contact the Registrar's Office for questions regarding course overloading?",
                "What is the contact information of the Registrar's Office for inquiries related to course overloading?"
            ],
            "responses": [
                "For inquiries about the process of course overloading, you can contact the Registrar's Office. Here are the details:\n\nTelephone: (043) 416-0350 local 214\nEmail: registrar.nasugbu@g.batstate-u.edu.ph\n\nPlease feel free to reach out for any questions or assistance regarding the process."
            ]
        },
        {
            "patterns": [
                "What are the requirements for applying for Leave of Absence (LOA)?",
                "What documents do I need to submit for Leave of Absence (LOA) application?",
                "What requirements do I need to apply for Leave of Absence (LOA)?",
                "What documents should I prepare to apply for Leave of Absence (LOA)?",
                "What are the required documents for the process of applying for Leave of Absence (LOA)?"
            ],
            "responses": [
                "To apply for Leave of Absence (LOA) at BatStateU ARASOF-Nasugbu, please prepare the following documents:\n\n1. Leave of Absence Form (3 Original): From the Registration Services Office or downloadable from the Student Portal at https://dione.batstate-u.edu.ph/student/#/dashboard.\n2. Photocopy of Parent/guardian’s any valid ID with three (3) specimen signature (1 Copy)\n3. Student ID: From the Student Portal or ICT Department.\n\nConditional Requirement: In case, the student cannot personally process:\n - Authorization letter stating the processes to be undertaken by the representative (1 Original)\n - Clear photocopy of student ID (1 copy) and any valid ID of the representative (1 copy), with three (3) specimen signatures"
            ]
        },
        {
            "patterns": [
                "Where can I get the Leave of Absence Form for my application?",
                "Where can I request the Leave of Absence Form for my application?",
                "Where can I obtain the Leave of Absence Form for my application?"
            ],
            "responses": [
                "You can obtain the Leave of Absence Form from the Registration Services Office or download it from the Student Portal at https://dione.batstate-u.edu.ph/student/#/dashboard."
            ]
        },
        {
            "patterns": [
                "How do I apply for a Leave of Absence?",
                "What are the steps to apply for a Leave of Absence?",
                "What is the Leave of Absence application process?",
                "How do I complete my application for a Leave of Absence?",
                "What is the process to apply for a Leave of Absence?"
            ],
            "responses": [
                "To complete the process of applying for Leave of Absence at BatStateU ARASOF-Nasugbu, please follow these steps:\n\n1. Secure a Leave of Absence Form (LOA), download the form from Student Portal or request thru the official email address of the Registration Services Office\n - Email: registrar.nasugbu@g.batstate-u.edu.ph\n2. Proceed to the respective college for preliminary evaluation and signature of the accomplished Leave of Absence form with attached parent’s consent photocopy of parent’s valid ID\n3. Submit the signed form to the Office of the Student Discipline\n4. Submit the signed form to the Registration Services Office\n5. Receive the approved Leave of Absence form"
            ]
        },
        {
            "patterns": [
                "How long is the process for applying for Leave of Absence application?",
                "What is the duration of the Leave of Absence application process?",
                "How long does the entire process take to apply for Leave of Absence?",
                "How long will it take to complete all the steps for Leave of Absence application?",
                "What is the duration of the entire process for applying for Leave of Absence application?"
            ],
            "responses": [
                "The process for applying for Leave of Absence typically takes about 35 minutes to complete."
            ]
        },
        {
            "patterns": [
                "Is there a fee for the Leave of Absence application process?",
                "How much does the Leave of Absence application process cost?",
                "How much are the fees for the entire Leave of Absence application process?",
                "Are there any fees I need to pay during the Leave of Absence application process?",
                "How much is the total cost associated with applying for Leave of Absence?"
            ],
            "responses": [
                "There are no fees associated with the Leave of Absence application process. The entire process is free of charge."
            ]
        },
        {
            "patterns": [
                "When can I submit my application for Leave of Absence?",
                "When does the period for Leave of Absence application begin and end?"
            ],
            "responses": [
                "For the period for submitting application for Leave of Absence, please refer to the official announcements from the Registrar's Office or contact them directly for the most up-to-date information. You can reach the Registrar's Office at:\n\nTelephone: (043) 416-0350 local 214\nEmail: registrar.nasugbu@g.batstate-u.edu.ph"
            ]
        },
        {
            "patterns": [
                "When is the deadline for submitting Leave of Absence application?"
            ],
            "responses": [
                "For the deadline for submitting Leave of Absence application, please refer to the official announcements from the Registrar's Office or contact them directly for the most up-to-date information. You can reach the Registrar's Office at:\n\nTelephone: (043) 416-0350 local 214\nEmail: registrar.nasugbu@g.batstate-u.edu.ph"
            ]
        },
        {
            "patterns": [
                "Who can I contact for inquiries about the process of Leave of Absence application?",
                "Who should I reach out to about the process of Leave of Absence application?",
                "Who do I reach out to for questions about the process of Leave of Absence application?",
                "How can I contact the Registrar's Office for questions regarding the process of Leave of Absence application?",
                "What is the contact information of the Registrar's Office for inquiries related to the process of Leave of Absence application?"
            ],
            "responses": [
                "For inquiries about the process of Leave of Absence application, you can contact the Registrar's Office. Here are the details:\n\nTelephone: (043) 416-0350 local 214\nEmail: registrar.nasugbu@g.batstate-u.edu.ph\n\nPlease feel free to reach out for any questions or assistance regarding the process."
            ]
        },
        {
            "patterns": [
                "What are the requirements for applying for graduation?",
                "What documents do I need to submit for a graduation application?",
                "What requirements do I need to apply for graduation?",
                "What documents should I prepare to apply for graduation?",
                "What are the required documents for the process of applying for graduation?"
            ],
            "responses": [
                "To apply for graduation at BatStateU ARASOF-Nasugbu, please prepare the following documents:\n\n1. Application for Graduation Form (1 Original): From the Registration Services Office or downloadable from the Student Portal at https://dione.batstate-u.edu.ph/student/#/dashboard.\n2. Completion of Academic Requirements\n3. Certification of Submission of Hard Bound (1 Original): From the Library Services Office"
            ]
        },
        {
            "patterns": [
                "Where can I get the Graduation Form for my application?",
                "Where can I request the Graduation Form for my application?",
                "Where can I obatin the Graduation Form for my application?"
            ],
            "responses": [
                "You can obtain the Graduation Form from the Registration Services Office or download it from the Student Portal at https://dione.batstate-u.edu.ph/student/#/dashboard."
            ]
        },
        {
            "patterns": [
                "Where can I get the Certification of Submission of Hard Bound for the graduation application?",
                "Where can I request the Certification of Submission of Hard Bound for the graduation application?",
                "Where can I obtain the Certification of Submission of Hard Bound for the graduation application?"
            ],
            "responses": [
                "You can obtain the Certification of Submission of Hard Bound from the Library Services Office."
            ]
        },
        {
            "patterns": [
                "How do I apply for graduation?",
                "What are the steps to apply for graduation?",
                "What is the graduation application process?",
                "How do I complete my application for graduation?",
                "What is the process to apply for graduation?"
            ],
            "responses": [
                "To complete the process of applying for Graduation at BatStateU ARASOF-Nasugbu, please follow these steps:\n\n1. Secure an Application for Graduation form, download the form from Student Portal or request thru the official email address of the Registration Services Office\n - Email: registrar.nasugbu@g.batstate-u.edu.ph\n2. Submit the accomplished Application for Graduation form to the concerned college\n3. Submit the deficiencies"
            ]
        },
        {
            "patterns": [
                "How long is the process for applying for graduation?",
                "What is the duration of the graduation application process?",
                "How long does the entire process take to apply for graduation?",
                "How long will it take to complete all the steps for the graduation application?",
                "What is the duration of the entire process for applying for graduation?"
            ],
            "responses": [
                "The process for applying for Graduation typically takes about 4 months, 3 days, 10 minutesto complete."
            ]
        },
        {
            "patterns": [
                "Is there a fee for the graduation application process?",
                "How much does the graduation application process cost?",
                "How much are the fees for the entire graduation application process?",
                "Are there any fees I need to pay during the graduation application process?",
                "How much is the total cost associated with applying for graduation?"
            ],
            "responses": [
                "There are no fees associated with the Graduation application process. The entire process is free of charge."
            ]
        },
        {
            "patterns": [
                "When can I submit my application for graduation?",
                "When does the period for graduation application begin and end?"
            ],
            "responses": [
                "For the period for submitting application for graduation, please refer to the official announcements from the Registrar's Office or contact them directly for the most up-to-date information. You can reach the Registrar's Office at:\n\nTelephone: (043) 416-0350 local 214\nEmail: registrar.nasugbu@g.batstate-u.edu.ph"
            ]
        },
        {
            "patterns": [
                "When is the deadline for submitting my graduation application?"
            ],
            "responses": [
                "For the deadline for submitting graduation application, please refer to the official announcements from the Registrar's Office or contact them directly for the most up-to-date information. You can reach the Registrar's Office at:\n\nTelephone: (043) 416-0350 local 214\nEmail: registrar.nasugbu@g.batstate-u.edu.ph"
            ]
        },
        {
            "patterns": [
                "Who can I contact for inquiries about the graduation application process?",
                "Who should I reach out to about the graduation application process?",
                "Who do I reach out to for questions about the graduation application process?",
                "How can I contact the Registrar's Office for questions regarding the graduation application process?",
                "What is the contact information of the Registrar's Office for inquiries related to the graduation application process?"
            ],
            "responses": [
                "For inquiries about the process of graduation application, you can contact the Registrar's Office. Here are the details:\n\nTelephone: (043) 416-0350 local 214\nEmail: registrar.nasugbu@g.batstate-u.edu.ph\n\nPlease feel free to reach out for any questions or assistance regarding the process."
            ]
        },
        {
            "patterns": [
                "What are the requirements for requesting a Certificate of Course Description?",
                "What documents do I need to submit for the issuance of a Certificate of Course Description?",
                "What requirements do I need to request a Certificate of Course Description?",
                "What documents should I prepare to request a Certificate of Course Description?",
                "What are the required documents for the process of requesting a Certificate of Course Description?"
            ],
            "responses": [
                "To request a Certificate of Course Description at BatStateU ARASOF-Nasugbu, please prepare the following documents:\n\n1. Online Clearance: From the Registration Portal or Student Clearance System.\n2. Request and Claim Slip (1 Original): From the Registration Services Office or downloadable from the Student Portal at https://dione.batstate-u.edu.ph/student/#/dashboard.\n3. One (1) Valid Identification Card (ID) - PRC ID, Driver’s License, UMID, Passport\n4. Official Receipt of Payment: From the Cashiering Office\n\nConditional Requirement: In case, the student cannot personally process:\n - Authorization letter stating the processes to be undertaken by the representative (1 Original)\n - Clear photocopy of student ID (1 copy) and any valid ID of the representative (1 copy), with three (3) specimen signatures"
            ]
        },
        {
            "patterns": [
                "Where can I get the Online Clearance for my request of Certificate of Course Description?",
                "Where can I request the Online Clearance for my request of Certificate of Course Description?",
                "Where can I obtain the Online Clearance for my request of Certificate of Course Description?",
                "Where can I get the Online Clearance for my request of Form 137?",
                "Where can I request the Online Clearance for my request of Form 137?",
                "Where can I obtain the Online Clearance for my request of Form 137?",
                "Where can I get the Online Clearance for my request of Report of Grades?",
                "Where can I request the Online Clearance for my request of Report of Grades?",
                "Where can I obtain the Online Clearance for my request of Report of Grades?",
                "Where can I get the Online Clearance for my request of a Second Copy of Diploma?",
                "Where can I request the Online Clearance for my request of a Second Copy of Diploma?",
                "Where can I obtain the Online Clearance for my request of a Second Copy of Diploma?",
                "Where can I get the Online Clearance for my request of Transcript of Records?",
                "Where can I request the Online Clearance for my request of Transcript of Records?",
                "Where can I obtain the Online Clearance for my request of Transcript of Records?",
                "Where can I get the Online Clearance for my request of Transfer Credentials?",
                "Where can I request the Online Clearance for my request of Transfer Credentials?",
                "Where can I obtain the Online Clearance for my request of Transfer Credentials?"
            ],
            "responses": [
                "You can obtain the Online Clearance from the Registration Portal/Student Clearance System."
            ]
        },
        {
            "patterns": [
                "Where can I get the Request and Claim Slip for my request of Certificate of Course Description?",
                "Where can I request the Request and Claim Slip for my request of Certificate of Course Description?",
                "Where can I obtain the Request and Claim Slip for my request of Certificate of Course Description?",
                "Where can I get the Request and Claim Slip for my request of Form 137?",
                "Where can I request the Request and Claim Slip for my request of Form 137?",
                "Where can I obtain the Request and Claim Slip for my request of Form 137?",
                "Where can I get the Request and Claim Slip for the request of Report of Grades?",
                "Where can I request the Request and Claim Slip for the request of Report of Grades?",
                "Where can I obtain the Request and Claim Slip for the request of Report of Grades?",
                "Where can I get the Request and Claim Slip for my request of a Second Copy of Diploma?",
                "Where can I request the Request and Claim Slip for my request of a Second Copy of Diploma?",
                "Where can I obtain the Request and Claim Slip for my request of a Second Copy of Diploma?",
                "Where can I get the Request and Claim Slip for my request of Transcript of Records?",
                "Where can I request the Request and Claim Slip for my request of Transcript of Records?",
                "Where can I obtain the Request and Claim Slip for my request of Transcript of Records?",
                "Where can I get the Request and Claim Slip for my request of Transfer Credentials?",
                "Where can I request the Request and Claim Slip for my request of Transfer Credentials?",
                "Where can I obtain the Request and Claim Slip for my request of Transfer Credentials?"
            ],
            "responses": [
                "You can obtain the Request and Claim Slip from the Registration Services Office or download it from the Student Portal at https://dione.batstate-u.edu.ph/student/#/dashboard."
            ]
        },
        {
            "patterns": [
                "Where can I get the Official Receipt of Payment for my request of Certificate of Course Description?",
                "Where can I request the Official Receipt of Payment for my request of Certificate of Course Description?",
                "Where can I obtain the Official Receipt of Payment for my request of Certificate of Course Description?",
                "Where can I get the Official Receipt of Payment for my request of Form 137?",
                "Where can I request the Official Receipt of Payment for my request of Form 137?",
                "Where can I obtain the Official Receipt of Payment for my request of Form 137?",
                "Where can I get the Official Receipt of Payment for my request of a Second Copy of Diploma?",
                "Where can I request the Official Receipt of Payment for my request of a Second Copy of Diploma?",
                "Where can I obtain the Official Receipt of Payment for my request of a Second Copy of Diploma?",
                "Where can I get the Official Receipt of Payment for my request of Transcript of Records?",
                "Where can I request the Official Receipt of Payment for my request of Transcript of Records?",
                "Where can I obtain the Official Receipt of Payment for my request of Transcript of Records?",
                "Where can I get the Official Receipt of Payment for my request of Transfer Credentials?",
                "Where can I request the Official Receipt of Payment for my request of Transfer Credentials?",
                "Where can I obtain the Official Receipt of Payment for my request of Transfer Credentials?"
            ],
            "responses": [
                "You can obtain the Official Receipt of Payment from the Cashiering Office."
            ]
        },
        {
            "patterns": [
                "How do I request Certificate of Course Description?",
                "What are the steps to request Certificate of Course Description?",
                "What is the Certificate of Course Description issuance process?",
                "How do I complete my request for Certificate of Course Description?",
                "What is the process to request Certificate of Course Description?"
            ],
            "responses": [
                "To complete the process of requesting Certificate of Course Description at BatStateU ARASOF-Nasugbu, please follow these steps:\n\n1. Request the document \n - Thru Online Document Request (ODR)- Access the Online Document Request System at https://dione.batstateu.edu.ph/odr/#/ and accomplish the steps for document requisition\n- Thru email – Send a message via email at registrar.nasugbu@g.batstate-u.edu.ph\n- Thru Face-to-Face Transaction - Secure Request and Claim Slip Form at the Registration Services Office\n2. Pay at the Cashiering Office/LinkBiz Portal\n3. Upload via ODR or Present the official receipt at the Registration Services Office\n4. Present the notice/ Claim Slip to claim the requested document\n5. Check and receive the requested document and sign in the Logbook "
            ]
        },
        {
            "patterns": [
                "How long is the process to request Certificate of Course Description?",
                "What is the duration of the process to request Certificate of Course Description?",
                "How long does the entire process take to request Certificate of Course Description?",
                "How long will it take to complete all the steps to request Certificate of Course Description?",
                "What is the duration of the entire process to request Certificate of Course Description?"
            ],
            "responses": [
                "The process for requesting Certificate of Course Description typically takes about 7 days."
            ]
        },
        {
            "patterns": [
                "Is there a fee for requesting a Certificate of Course Description?",
                "How much does the issuance of a Certificate of Course Description process cost?",
                "How much are the fees for the entire issuance of a Certificate of Course Description process?",
                "Are there any fees I need to pay during the issuance of a Certificate of Course Description process?",
                "How much is the total cost associated with requesting a Certificate of Course Description?"
            ],
            "responses": [
                "Here are the fees for requesting Certificate of Course Description at BatStateU ARASOF-Nasugbu:\n\n- Certificate - Php 30/page"
            ]
        },
        {
            "patterns": [
                "Who can I contact for inquiries about the issuance of a Certificate of Course Description process?",
                "Who should I reach out to for questions about the issuance of a Certificate of Course Description process?",
                "Who do I reach out to for questions regarding the issuance of a Certificate of Course Description?",
                "How can I contact the Registrar's Office for questions regarding the issuance of a Certificate of Course Description?",
                "What is the contact information of the Registrar's Office for inquiries related to the issuance of a Certificate of Course Description?"
            ],
            "responses": [
                "For inquiries about the issuance of Certificate of Course Description, you can contact the Registrar's Office. Here are the details:\n\nTelephone: (043) 416-0350 local 214\nEmail: registrar.nasugbu@g.batstate-u.edu.ph\n\nPlease feel free to reach out for any questions or assistance regarding the process."
            ]
        },
        {
            "patterns": [
                "What are the requirements for requesting Form 137?",
                "What documents do I need to submit for the issuance of Form 137?",
                "What requirements do I need to request Form 137?",
                "What documents should I prepare to request Form 137?",
                "What are the required documents for the process of requesting Form 137?"
            ],
            "responses": [
                "To request Form 137 at BatStateU ARASOF-Nasugbu, please prepare the following documents:\n\n1. Online Clearance: From the Registration Portal or Student Clearance System.\n2. Request and Claim Slip (1 Original): From the Registration Services Office or downloadable from the Student Portal at https://dione.batstate-u.edu.ph/student/#/dashboard.\n3. One (1) Valid Identification Card (ID) - PRC ID, Driver’s License, UMID, Passport\n4. Official Receipt of Payment: From the Cashiering Office\n5. Approved Exit Interview Form (1 clear copy): From Concerned College/Guidance and Counseling Office\n6. Letter of No Objection, if Transferred Credentials (Copy For) (1 Original): From Receiving School\n7. Signed lower portion of the Certificate of Transfer Credentials (1 Original): From Receiving School\n\nIn case of lost request:\n- Request Letter from the school for lost issued Certificate of Transfer Credential. If applicable (1 Original): From Receiving School\n- Affidavit of loss including a statement that the document is not yet forwarded to another school (1 Original): From Notary Public\n\nConditional Requirement: In case, the student cannot personally process:\n - Authorization letter stating the processes to be undertaken by the representative (1 Original)\n - Clear photocopy of student ID (1 copy) and any valid ID of the representative (1 copy), with three (3) specimen signatures"
            ]
        },
        {
            "patterns": [
                "How do I request Form 137?",
                "What are the steps to request Form 137?",
                "What is the Form 137  issuance process?",
                "How do I complete my request for Form 137?",
                "What is the process to request Form 137?"
            ],
            "responses": [
                "To complete the process of requesting Form 137 at BatStateU ARASOF-Nasugbu, please follow these steps:\n\n1. Request the document \n - Thru Online Document Request (ODR)- Access the Online Document Request System at https://dione.batstateu.edu.ph/odr/#/ and accomplish the steps for document requisition\n- Thru email – Send a message via email at registrar.nasugbu@g.batstate-u.edu.ph\n - Thru Face-to-Face Transaction - Secure Request and Claim Slip Form at the Registration Services Office\n2. Pay at the Cashiering Office/LinkBiz Portal\n3. Upload via ODR or Present the official receipt at the Registration Services Office\n4. Present the notice/ Claim Slip to claim the requested document\n5. Check and receive the requested document and sign in the Logbook "
            ]
        },
        {
            "patterns": [
                "How long is the process to request Form 137?",
                "What is the duration of the process to request Form 137?",
                "How long does the entire process take to request Form 137?",
                "How long will it take to complete all the steps to request Form 137?",
                "What is the duration of the entire process to request Form 137?"
            ],
            "responses": [
                "The process for requesting Form 137 typically takes about 2 days."
            ]
        },
        {
            "patterns": [
                "Is there a fee for requesting a Form 137?",
                "How much does the issuance of a Form 137 process cost?",
                "How much are the fees for the entire issuance of a Form 137 process?",
                "Are there any fees I need to pay during the issuance of a Form 137 process?",
                "How much is the total cost associated with requesting a Form 137?"
            ],
            "responses": [
                "Here are the fees for requesting Form 137 at BatStateU ARASOF-Nasugbu:\n\n- Form 137 - Php 100"
            ]
        },
        {
            "patterns": [
                "Who can I contact for inquiries about the issuance of Form 137 process?",
                "Who should I reach out to for questions about the issuance of Form 137 process?",
                "Who do I reach out to for questions regarding the issuance of Form 137?",
                "How can I contact the Registrar's Office for questions regarding the issuance of Form 137?",
                "What is the contact information of the Registrar's Office for inquiries related to the issuance of Form 137?"
            ],
            "responses": [
                "For inquiries about the issuance of Form 137, you can contact the Registrar's Office. Here are the details:\n\nTelephone: (043) 416-0350 local 214\nEmail: registrar.nasugbu@g.batstate-u.edu.ph\n\nPlease feel free to reach out for any questions or assistance regarding the process."
            ]
        },
        {
            "patterns": [
                "What are the requirements for requesting Report of Grades?",
                "What documents do I need to submit for the issuance of Report of Grades?",
                "What requirements do I need to request Report of Grades?",
                "What documents should I prepare to request Report of Grades?",
                "What are the required documents for the process of requesting Report of Grades?"
            ],
            "responses": [
                "To request the Issuance of Report of Grades at BatStateU ARASOF-Nasugbu, please prepare the following documents:\n\n1. Online Clearance: From the Registration Portal or Student Clearance System.\n2. Request and Claim Slip (1 Original): From the Registration Services Office or downloadable from the Student Portal at https://dione.batstate-u.edu.ph/student/#/dashboard.\n3. Student ID: From the Student Portal or ICT Department.\n\nConditional Requirement: In case, the student cannot personally process:\n - Authorization letter stating the processes to be undertaken by the representative (1 Original)\n - Clear photocopy of student ID (1 copy) and any valid ID of the representative (1 copy), with three (3) specimen signatures"
            ]
        },
        {
            "patterns": [
                "How do I request Report of Grades?",
                "What are the steps to request Report of Grades?",
                "What is the Report of Grades issuance process?",
                "How do I complete my request for Report of Grades?",
                "What is the process to request Report of Grades?"
            ],
            "responses": [
                "To complete the process of requesting the Report of Grades at BatStateU ARASOF-Nasugbu, please follow these steps:\n\n1. State the request for Report of Grades and present Student ID/required documents for authorized representatives\n2. Check and receive the Report of Grades"
            ]
        },
        {
            "patterns": [
                "How long is the process to request Report of Grades?",
                "What is the duration of the process to request Report of Grades?",
                "How long does the entire process take to request Report of Grades?",
                "How long will it take to complete all the steps to request Report of Grades?",
                "What is the duration of the entire process to request Report of Grades?"
            ],
            "responses": [
                "The process for requesting the Report of Grades typically takes about 5 minutes to complete"
            ]
        },
        {
            "patterns": [
                "Is there a fee for requesting Report of Grades?",
                "How much does the issuance of Report of Grades process cost?",
                "How much are the fees for the entire issuance of Report of Grades process?",
                "Are there any fees I need to pay during the issuance of Report of Grades process?",
                "How much is the total cost associated with requesting Report of Grades?"
            ],
            "responses": [
                "There are no fees associated with requesting of the Report of Grades. The entire process is free of charge."
            ]
        },
        {
            "patterns": [
                "Who can I contact for inquiries about the issuance of the Report of Grades process?",
                "Who should I reach out to for questions about the issuance of the Report of Grades process?",
                "Who do I reach out to for questions regarding the issuance of the Report of Grades?",
                "How can I contact the Registrar's Office for questions regarding the issuance of the Report of Grades?",
                "What is the contact information of the Registrar's Office for inquiries related to the issuance of the Report of Grades?"
            ],
            "responses": [
                "For inquiries about the issuance of the Report of Grades, you can contact the Registrar's Office. Here are the details:\n\nTelephone: (043) 416-0350 local 214\nEmail: registrar.nasugbu@g.batstate-u.edu.ph\n\nPlease feel free to reach out for any questions or assistance regarding the process."
            ]
        },
        {
            "patterns": [
                "What are the requirements for requesting a Second Copy of Diploma?",
                "What documents do I need to submit for the issuance of a Second Copy of Diploma?",
                "What requirements do I need to request a Second Copy of Diploma?",
                "What documents should I prepare to request a Second Copy of Diploma?",
                "What are the required documents for the process of requesting a Second Copy of Diploma?"
            ],
            "responses": [
                "To request a Second Copy of Diploma at BatStateU ARASOF-Nasugbu, please prepare the following documents:\n\n1. Online Clearance: From the Registration Portal or Student Clearance System.\n2. Request and Claim Slip (1 Original): From the Registration Services Office or downloadable from the Student Portal at https://dione.batstate-u.edu.ph/student/#/dashboard.\n3. One (1) Valid Identification Card (ID) - PRC ID, Driver’s License, UMID, Passport\n4. Official Receipt of Payment: From the Cashiering Office\n\nConditional Requirement: In case, the student cannot personally process:\n - Authorization letter stating the processes to be undertaken by the representative (1 Original)\n - Clear photocopy of student ID (1 copy) and any valid ID of the representative (1 copy), with three (3) specimen signatures"
            ]
        },
        {
            "patterns": [
                "How do I request a Second Copy of Diploma?",
                "What are the steps to request a Second Copy of Diploma?",
                "What is the Second Copy of Diploma issuance process?",
                "How do I complete my request for a Second Copy of Diploma?",
                "What is the process to request a Second Copy of Diploma?"
            ],
            "responses": [
                "To complete the process of requesting a Second Copy of Diploma at BatStateU ARASOF-Nasugbu, please follow these steps:\n\n1. Request the document \n - Thru Online Document Request (ODR)- Access the Online Document Request System at https://dione.batstateu.edu.ph/odr/#/ and accomplish the steps for document requisition\n- Thru email – Send a message via email at registrar.nasugbu@g.batstate-u.edu.ph\n- Thru Face-to-Face Transaction - Secure Request and Claim Slip Form at the Registration Services Office\n2. Pay at the Cashiering Office/LinkBiz Portal\n3. Upload via ODR or Present the official receipt at the Registration Services Office\n4. Present the notice/ Claim Slip to claim the requested document\n5. Check and receive the requested document and sign in the Logbook "
            ]
        },
        {
            "patterns": [
                "How long is the process to request a Second Copy of Diploma?",
                "What is the duration of the process to request a Second Copy of Diploma?",
                "How long does the entire process take to request a Second Copy of Diploma?",
                "How long will it take to complete all the steps to request a Second Copy of Diploma?",
                "What is the duration of the entire process to request a Second Copy of Diploma?"
            ],
            "responses": [
                "The process for requesting a Second Copy of Diploma typically takes about 4 days to complete."
            ]
        },
        {
            "patterns": [
                "Is there a fee for requesting a Second Copy of Diploma?",
                "How much does the issuance of a Second Copy of Diploma process cost?",
                "How much are the fees for the entire issuance of a Second Copy of Diploma process?",
                "Are there any fees I need to pay during the issuance of a Second Copy of Diploma process?",
                "How much is the total cost associated with requesting a Second Copy of Diploma?"
            ],
            "responses": [
                "Here are the fees for requesting a Second Copy of Diploma at BatStateU ARASOF-Nasugbu:\n\n- Diploma - Php 400/copy"
            ]
        },
        {
            "patterns": [
                "Who can I contact for inquiries about the issuance of a Second Copy of Diploma process?",
                "Who should I reach out to for questions about the issuance of a Second Copy of Diploma process?",
                "Who do I reach out to for questions regarding the issuance of a Second Copy of Diploma?",
                "How can I contact the Registrar's Office for questions regarding the issuance of a Second Copy of Diploma?",
                "What is the contact information of the Registrar's Office for inquiries related to the issuance of a Second Copy of Diploma?",
                "Who should I reach out to for questions about the issuance of Transcript of Records process?",
                "Who do I reach out to for questions regarding the issuance of Transcript of Records?",
                "How can I contact the Registrar's Office for questions regarding the issuance of Transcript of Records?",
                "What is the contact information of the Registrar's Office for inquiries related to the issuance of Transcript of Records?"
            ],
            "responses": [
                "For inquiries about the issuance of a Second Copy of Diploma, you can contact the Registrar's Office. Here are the details:\n\nTelephone: (043) 416-0350 local 214\nEmail: registrar.nasugbu@g.batstate-u.edu.ph\n\nPlease feel free to reach out for any questions or assistance regarding the process."
            ]
        },
        {
            "patterns": [
                "What are the requirements for requesting a Transcript of Records?",
                "What documents do I need to submit for the issuance of a Transcript of Records?",
                "What requirements do I need to request a Transcript of Records?",
                "What documents should I prepare to request a Transcript of Records?",
                "What are the required documents for the process of requesting a Transcript of Records?"
            ],
            "responses": [
                "To request a Transcript of Records at BatStateU ARASOF-Nasugbu, please prepare the following documents:\n\n1. Online Clearance: From the Registration Portal or Student Clearance System.\n2. Request and Claim Slip (1 Original): From the Registration Services Office or downloadable from the Student Portal at https://dione.batstate-u.edu.ph/student/#/dashboard.\n3. One (1) Valid Identification Card (ID) - PRC ID, Driver’s License, UMID, Passport\n4. Official Receipt of Payment (1 Original/ e-receipt) : From the Cashiering Office\n5. Letter of No Objection, if Transferred Credentials (Copy For) (1 Original): From Receiving School\n\nConditional Requirement: In case, the student cannot personally process:\n - Authorization letter stating the processes to be undertaken by the representative (1 Original)\n - Clear photocopy of student ID (1 copy) and any valid ID of the representative (1 copy), with three (3) specimen signatures"
            ]
        },
        {
            "patterns": [
                "Where can I get the Letter of No Objection for my request of Transcript of Records?",
                "Where can I request the Letter of No Objection for my request of Transcript of Records?",
                "Where can I obtain the Letter of No Objection for my request of Transcript of Records?"
            ],
            "responses": [
                "You can obtain the Letter of No Objection from the Receiving School."
            ]
        },
        {
            "patterns": [
                "How do I request a Transcript of Records?",
                "What are the steps to request a Transcript of Records?",
                "What is the Transcript of Records issuance process?",
                "How do I complete my request for a Transcript of Records?",
                "What is the process to request a Transcript of Records?"
            ],
            "responses": [
                "To complete the process of requesting a Transcript of Record at BatStateU ARASOF-Nasugbu, please follow these steps:\n\n1. Request the document \n - Thru Online Document Request (ODR)- Access the Online Document Request System at https://dione.batstateu.edu.ph/odr/#/ and accomplish the steps for document requisition\n- Thru email – Send a message via email at registrar.nasugbu@g.batstate-u.edu.ph\n- Thru Face-to-Face Transaction - Secure Request and Claim Slip Form at the Registration Services Office\n2. Pay at the Cashiering Office/LinkBiz Portal\n3. Upload via ODR or Present the official receipt at the Registration Services Office\n4. Present the notice/ Claim Slip to claim the requested document\n5. Check and receive the requested document and sign in the Logbook "
            ]
        },
        {
            "patterns": [
                "How long is the process to request a Transcript of Records?",
                "What is the duration of the process to request a Transcript of Records?",
                "How long does the entire process take to request a Transcript of Records?",
                "How long will it take to complete all the steps to request a Transcript of Records?",
                "What is the duration of the entire process to request a Transcript of Records?"
            ],
            "responses": [
                "The process for requesting a Transcript of Records typically takes about 3 days for Auto TOR and 7 days for Manual TOR."
            ]
        },
        {
            "patterns": [
                "Is there a fee for requesting a Transcript of Records?",
                "How much does the issuance of a Transcript of Records process cost?",
                "How much are the fees for the entire issuance of a Transcript of Records process?",
                "Are there any fees I need to pay during the issuance of a Transcript of Records process?",
                "How much is the total cost associated with requesting a Transcript of Records?"
            ],
            "responses": [
                "Here are the fees for requesting a Transcript of Records at BatStateU ARASOF-Nasugbu:\n\n- Certificate of Transfer Credentials - Php100\n- CertificationTranscript of Records - Php50/page"
            ]
        },
        {
            "patterns": [
                "Who can I contact for inquiries about the issuance of Transcript of Records process?"
            ],
            "responses": [
                "For inquiries about the issuance of Transcript of Records, you can contact the Registrar's Office. Here are the details:\n\nTelephone: (043) 416-0350 local 214\nEmail: registrar.nasugbu@g.batstate-u.edu.ph\n\nPlease feel free to reach out for any questions or assistance regarding the process."
            ]
        },
        {
            "patterns": [
                "What are the requirements for requesting Transfer Credentials?",
                "What documents do I need to submit for the issuance of Transfer Credentials?",
                "What requirements do I need to request Transfer Credentials?",
                "What documents should I prepare to request Transfer Credentials?",
                "What are the required documents for the process of requesting Transfer Credentials?"
            ],
            "responses": [
                "To request Transfer Credentials at BatStateU ARASOF-Nasugbu, please prepare the following documents:\n\n1. Online Clearance: From the Registration Portal or Student Clearance System.\n2. Request and Claim Slip (1 Original): From the Registration Services Office or downloadable from the Student Portal at https://dione.batstate-u.edu.ph/student/#/dashboard.\n3. One (1) Valid Identification Card (ID) - PRC ID, Driver’s License, UMID, Passport\n4. Official Receipt of Payment: From the Cashiering Office\n5. Exit Interview Form (1 clear copy): From Concerned College/Guidance and Counseling Office\n6. Request Letter from the school for lost issued Certificate of Transfer Credential. (If applicable): From Receiving School\n7. Affidavit of Loss stating the issuance of certificate and non-submission to any school (if applicable): From Notary Public\n\nConditional Requirement: In case, the student cannot personally process:\n - Authorization letter stating the processes to be undertaken by the representative (1 Original)\n - Clear photocopy of student ID (1 copy) and any valid ID of the representative (1 copy), with three (3) specimen signatures"
            ]
        },
        {
            "patterns": [
                "How do I request Transfer Credentials?",
                "What are the steps to request Transfer Credentials?",
                "What is the Transfer Credentials issuance process?",
                "How do I complete my request for Transfer Credentials?",
                "What is the process to request Transfer Credentials?"
            ],
            "responses": [
                "To complete the process of requesting Transfer Credentials at BatStateU ARASOF-Nasugbu, please follow these steps:\n\n1. Request the document \n - Thru Online Document Request (ODR)- Access the Online Document Request System at https://dione.batstateu.edu.ph/odr/#/ and accomplish the steps for document requisition\n- Thru email – Send a message via email at registrar.nasugbu@g.batstate-u.edu.ph\n- Thru Face-to-Face Transaction - Secure Request and Claim Slip Form at the Registration Services Office\n2. Pay at the Cashiering Office/LinkBiz Portal\n3. Upload via ODR or Present the official receipt at the Registration Services Office\n4. Present the notice/ Claim Slip to claim the requested document\n5. Check and receive the requested document and sign in the Logbook "
            ]
        },
        {
            "patterns": [
                "How long is the process to request Transfer Credentials?",
                "What is the duration of the process to request Transfer Credentials?",
                "How long does the entire process take to request Transfer Credentials?",
                "How long will it take to complete all the steps to request Transfer Credentials?",
                "What is the duration of the entire process to request Transfer Credentials?"
            ],
            "responses": [
                "The process for requesting Transfer Credentials typically takes about 3 days for Auto TOR and 7 days for Manual TOR"
            ]
        },
        {
            "patterns": [
                "Is there a fee for requesting Transfer Credentials?",
                "How much does the issuance of Transfer Credentials process cost?",
                "How much are the fees for the entire issuance of Transfer Credentials process?",
                "Are there any fees I need to pay during the issuance of Transfer Credentials process?",
                "How much is the total cost associated with requesting Transfer Credentials?"
            ],
            "responses": [
                "Here are the fees for requesting Transfer Credentials at BatStateU ARASOF-Nasugbu:\n\n- Certificate of Transfer Credentials - Php 100\n- Certification Transcript of Records - Php50/page"
            ]
        },
        {
            "patterns": [
                "Who can I contact for inquiries about the issuance of Transfer Credentials process?",
                "Who should I reach out to for questions about the issuance of Transfer Credentials process?",
                "Who do I reach out to for questions regarding the issuance of Transfer Credentials?",
                "How can I contact the Registrar's Office for questions regarding the issuance of Transfer Credentials?",
                "What is the contact information of the Registrar's Office for inquiries related to the issuance of Transfer Credentials?"
            ],
            "responses": [
                "For inquiries about the issuance of Transfer Credentials, you can contact the Registrar's Office. Here are the details:\n\nTelephone: (043) 416-0350 local 214\nEmail: registrar.nasugbu@g.batstate-u.edu.ph\n\nPlease feel free to reach out for any questions or assistance regarding the process."
            ]
        },
        {
            "patterns": [
                "What are the requirements for requesting Student Verification?",
                "What documents do I need to submit for Student Verification?",
                "What requirements do I need to request Student Verification?",
                "What documents should I prepare to request Student Verification?",
                "What are the required documents for the process of requesting Student Verification?"
            ],
            "responses": [
                "To request for student verification at BatStateU ARASOF-Nasugbu, please prepare the following documents:\n\n1. Letter of Authorization/ Letter of Consent of Concerned Student/Graduate: From the Requesting Company/ Agency\n2. Scanned copy of valid ID of the concerned student: From the Requesting Company/ Agency\n3. Scanned Copy of Transcript of Records/Diploma: From the Requesting Company/ Agency\n4. Student Verification Form : From the Requesting Company/ Agency\n"
            ]
        },
        {
            "patterns": [
                "Where can I get the Letter of Authorization / Consent for student verification?",
                "Where can I request the Letter of Authorization / Consent for student verification?",
                "Where can I obtain the Letter of Authorization / Consent for student verification?"
            ],
            "responses": [
                "You can obtain the Letter of Authorization / Consent from the Requesting Company / Agency."
            ]
        },
        {
            "patterns": [
                "Where can I get the Student Verification Form for student verification?",
                "Where can I request the Student Verification Form for student verification?",
                "Where can I obtain the Student Verification Form for student verification?"
            ],
            "responses": [
                "You can obtain your Student Vertification Form from the Requesting Company / Agency."
            ]
        },
        {
            "patterns": [
                "How do I request student verification?",
                "What are the steps for requesting student verification?",
                "What is the student verification process?",
                "How do I complete my request for student verification?",
                "What is the process for requesting student verification?"
            ],
            "responses": [
                "To request student verification at BatStateU ARASOF-Nasugbu, please follow these steps:\n\n1. Send request for student verification with complete requirements via email to the Registration Services Office.\nEmail: registrar.nasugbu@g.batstate-u.edu.ph\n2. Receive the response for student verification Department/Program Chair and the Dean\n"
            ]
        },
        {
            "patterns": [
                "How long is the student verification process?",
                "What is the duration of the student verification process?",
                "How long does the entire student verification process take?",
                "How long will it take to complete all the steps for requesting student verification?",
                "What is the duration of the entire student verification process?"
            ],
            "responses": [
                "The process for student verification typically takes about 1 day to complete."
            ]
        },
        {
            "patterns": [
                "Is there a fee for the student verification process?",
                "How much does the student verification process cost?",
                "How much are the fees for the entire student verification process?",
                "Are there any fees I need to pay during the student verification process?",
                "How much is the total cost associated with student verification process?"
            ],
            "responses": [
                "There are no fees associated with the student verification process. The entire process is free of charge."
            ]
        },
        {
            "patterns": [
                "Who can I contact for inquiries about the process of student verification?",
                "Who should I reach out to about student verification?",
                "Who do I reach out to for questions about student verification?",
                "How can I contact the Registrar's Office for questions regarding student verification?",
                "What is the contact information of the Registrar's Office for inquiries related to student verification?"
            ],
            "responses": [
                "For inquiries about the process of student verification, you can contact the Registrar's Office. Here are the details:\n\nTelephone: (043) 416-0350 local 214\nEmail: registrar.nasugbu@g.batstate-u.edu.ph\n\nPlease feel free to reach out for any questions or assistance regarding the process."
            ]
        },
        {
            "patterns": [
                "Where is BatStateU ARASOF-Nasugbu Campus located?"
            ],
            "responses": [
                "The BatStateU ARASOF-Nasugbu Campus is located at R. Martinez St., Brgy. Bucana, Nasugbu, 4231 Batangas, Philippines."
            ]
        },
        {
            "patterns": [
                "What are the landmarks near the BatStateU ARASOF-Nasugbu Campus?"
            ],
            "responses": [
                "Landmarks near the campus include the Globe Telecom Building and Kainan sa Dalampasigan Restaurant."
            ]
        },
        {
            "patterns": [
                "How can I travel to BatStateU ARASOF-Nasugbu Campus?"
            ],
            "responses": [
                "You can reach the campus through:\n\nPublic Transport: Take a bus from PITX, Coastal Road, or Pasay terminals in Manila heading to Nasugbu, Batangas. The buses will drop you close to the campus.\n\nBy Car: Drive via SLEX to Tagaytay City, then continue on the Tagaytay-Nasugbu Highway for a scenic two-hour trip to Nasugbu. Alternatively, take the Cavitex Highway, passing through the Mount Palay Palay tunnel to the Nasugbu-Ternate Highway, leading near the campus."
            ]
        },
        {
            "patterns": [
                "What is the size of the BatStateU ARASOF-Nasugbu Campus?"
            ],
            "responses": [
                "The BatStateU ARASOF-Nasugbu Campus covers an area of 4.159 hectares, divided into two compounds."
            ]
        },
        {
            "patterns": [
                "How is the BatStateU ARASOF-Nasugbu Campus divided?"
            ],
            "responses": [
                "The BatStateU ARASOF-Nasugbu Campus is divided into two compounds. Area I is located adjacent to the shores of Nasugbu and houses the majority of the campus buildings, including the admin building, which is the oldest structure on campus. Area II is home to the Physical Education School Sports (PESS) Ground, also known as the Roxas-Gargollo Sports Field, which is used for sports events, PE subjects, and other outdoor activities."
            ]
        },
        {
            "patterns": [
                "What is the oldest building on the BatStateU ARASOF-Nasugbu Campus?"
            ],
            "responses": [
                "The oldest building on the campus is the admin building, which dates back to the university's founding years. It is located in Area I, the part of the campus near the shores of Nasugbu."
            ]
        },
        {
            "patterns": [
                "What is the size of the Roxas-Gargollo Sports Field?"
            ],
            "responses": [
                "The Roxas-Gargollo Sports Field (also known as the PESS Ground) covers an area of 1.6849 hectares."
            ]
        },
        {
            "patterns": [
                "What facilities are located near the Roxas-Gargollo Sports Field?"
            ],
            "responses": [
                "Near the Roxas-Gargollo Sports Field, you'll find the BatStateU Hostel, which serves as a function hall for local events, and the Higher Education Building, where classes for various college programs are held."
            ]
        },
        {
            "patterns": [
                "What is the history of BatStateU ARASOF-Nasugbu Campus?"
            ],
            "responses": [
                "The history of BatStateU ARASOF-Nasugbu Campus dates back over 70 years. It was established by Republic Act 685, passed in 1952 through the efforts of Congressman Apolinario Reyes Apacible and Bureau of Fisheries Director Deogracias V. Villadolid. Initially called the Philippine Institute of Fisheries Technology, the school started operating in 1957 under the name Batangas School of Fisheries (BSF), with a two-story building constructed on a three-hectare land donated by Roxas y Cia.\n\nThrough the years, the school expanded its academic offerings, starting with a secondary fisheries curriculum. In 1972, it began offering a Diploma in Fishery Technology, followed by a Bachelor of Science in Fishery Education in the late 1970s.\n\nIn the 1980s, the school was renamed Apolinario R. Apacible School of Fisheries (ARASOF) and started offering elementary education, non-traditional courses, and short-term programs. By 1994, ARASOF was placed under the Commission on Higher Education (CHED), enabling the introduction of more programs such as Bachelor of Science in Food Technology, Hotel and Restaurant Management, and Education.\n\nIn 2000, ARASOF became part of Batangas State University (BatStateU) through the integration of the Pablo Borbon Memorial Institute of Technology, with ARASOF becoming one of the university's campuses. This transition led to the creation of BatStateU ARASOF-Nasugbu Campus under Republic Act 9045 in 2001.\n\nToday, BatStateU ARASOF-Nasugbu continues to grow, offering a range of multidisciplinary programs. The campus is home to over 7,000 students, with six colleges and a laboratory school, continuing its mission of academic excellence and contributing to the local community and region."
            ]
        },
        {
            "patterns": [
                "What are the academic departments at BatStateU ARASOF-Nasugbu Campus?"
            ],
            "responses": [
                "The academic departments at BatStateU ARASOF-Nasugbu Campus are:\n\n1. College of Accountancy, Business, Economics and International Hospitality Management\n2. College of Arts and Sciences\n3. College of Informatics and Computing Sciences\n4. College of Engineering and Technology\n5. College of Nursing and Allied Health Sciences\n6. College of Teacher Education\n7. Laboratory School"
            ]
        },
        {
            "patterns": [
                "What is CABEIHM?"
            ],
            "responses": [
                "CABEIHM stands for the College of Accountancy, Business, Economics, and International Hospitality Management at BatStateU ARASOF-Nasugbu. It offers a wide range of nationally accredited graduate and undergraduate programs in business, hospitality, economics, and public administration."
            ]
        },
        {
            "patterns": [
                "What programs are offered by CABEIHM at BatStateU ARASOF-Nasugbu?"
            ],
            "responses": [
                "CABEIHM offers the following programs:\n\n- Bachelor of Science in Accountancy\n- Bachelor of Science in Management Accounting\n- Bachelor of Science in Business Administration major in Financial Management\n- Bachelor of Science in Business Administration major in Marketing Management\n- Bachelor of Science in Business Administration major in Human Resource Management\n- Bachelor of Science in Hospitality Management\n- Bachelor of Science in Tourism Management"
            ]
        },
        {
            "patterns": [
                "Who is the Dean of CABEIHM?"
            ],
            "responses": [
                "The Dean of CABEIHM is Assoc. Prof. Mayette A. Cananea."
            ]
        },
        {
            "patterns": [
                "How can I contact CABEIHM?"
            ],
            "responses": [
                "You can contact CABEIHM via the following:\n\nTelephone: (043) 416-0350 loc. 204\nEmail: cabeihm.nasugbu@g.batstate-u.edu.ph"
            ]
        },
        {
            "patterns": [
                "Who are the program chairpersons at CABEIHM?"
            ],
            "responses": [
                "The program chairpersons at CABEIHM are:\n\n- Ms. Carla M. Sandoval (OIC-Department Chairperson, BSA & BSMA)\n- Ms. Leila T. Bayot (Program Chairperson, BSHM)\n- Asst. Prof. Arlene M. Mendoza (Program Chairperson, BSTM)\n- Ms. Marilyn P. Tampes (Program Chairperson, BSBA MM)\n- Ms. Dyemnah Inasiah P. Bentir (Program Chairperson, BSBA HRM & FM)"
            ]
        },
        {
            "patterns": [
                "What is the goal of CABEIHM?"
            ],
            "responses": [
                "The CABEIHM aims to provide quality education to prepare students for a wide range of careers in accountancy, business, hotel and restaurant management, tourism management, custom and public administration, aspire for continuing education, enhance competencies and hone their leadership skills to enable them to participate actively in the global market through high quality instruction, research, extension and production which serve as fertile ground for the internalization of values that uplift self, society and the environment."
            ]
        },
        {
            "patterns": [
                "What degrees can I pursue at CABEIHM?"
            ],
            "responses": [
                "At CABEIHM, you can pursue the following degrees:\n\n- Bachelor of Science in Accountancy\n- Bachelor of Science in Management Accounting\n- Bachelor of Science in Business Administration (with majors in Financial Management, Marketing Management, or Human Resource Management)\n- Bachelor of Science in Hospitality Management\n- Bachelor of Science in Tourism Management"
            ]
        },
        {
            "patterns": [
                "What is CAS?"
            ],
            "responses": [
                "CAS stands for the College of Arts and Sciences at BatStateU ARASOF-Nasugbu. It focuses on providing exemplary leadership in the education of professionals in the arts and sciences."
            ]
        },
        {
            "patterns": [
                "What programs are offered by CAS at BatStateU ARASOF-Nasugbu?"
            ],
            "responses": [
                "CAS offers the following programs:\n\n- Bachelor of Arts in Communication\n- Bachelor of Science in Criminology\n- Bachelor of Science in Food Technology\n- Bachelor of Science in Psychology\n- Bachelor of Science in Fisheries and Aquatic Sciences"
            ]
        },
        {
            "patterns": [
                "Who is the Dean of CAS?"
            ],
            "responses": [
                "The Dean of CAS is Dr. Maria Luisa A. Valdez."
            ]
        },
        {
            "patterns": [
                "How can I contact CAS?"
            ],
            "responses": [
                "You can contact CAS via the following:\n\nTelephone: (043) 416-0350 loc. 202\nEmail: cas.nasugbu@g.batstate-u.edu.ph"
            ]
        },
        {
            "patterns": [
                "Who are the program chairpersons at CAS?"
            ],
            "responses": [
                "The program chairpersons at CAS are:\n\n- Mr. Robert Marrel V. Dela Vega (Program Chair, BA Communication)\n- Ms. Elsie I. Montealegre (OIC-Program Chair, BS Criminology)\n- Mr. Christopher A. Fernandez (OIC-Program Chair, BS Fisheries and Aquatic Sciences)\n- Mr. Ronie G. Baclas (OIC-Program Chair, BS Food Technology)\n- Mr. Mariel June A. Magsino (OIC-Program Chair, BS Psychology)"
            ]
        },
        {
            "patterns": [
                "What is the goal of CAS?"
            ],
            "responses": [
                "The CAS aims to provide exemplary leadership essential to the education of proficient and humane professionals in the arts and sciences."
            ]
        },
        {
            "patterns": [
                "What degrees can I pursue at CAS?"
            ],
            "responses": [
                "At CAS, you can pursue the following degrees:\n\n- Bachelor of Arts in Communication\n- Bachelor of Science in Criminology\n- Bachelor of Science in Food Technology\n- Bachelor of Science in Psychology\n- Bachelor of Science in Fisheries and Aquatic Sciences"
            ]
        },
        {
            "patterns": [
                "What is CICS?"
            ],
            "responses": [
                "CICS stands for the College of Engineering and Computing Sciences at BatStateU ARASOF-Nasugbu. It offers programs in Information Technology and Computer Science, focusing on developing globally competitive professionals equipped with quality education and practical training in the fields of IT and computing."
            ]
        },
        {
            "patterns": [
                "What programs are offered by CICS at BatStateU ARASOF-Nasugbu?"
            ],
            "responses": [
                "CICS offers the following program:\n\nBachelor of Science in Information Technology (with two tracks: Network Technology and Business Analytics)"
            ]
        },
        {
            "patterns": [
                "Who is the Dean of CICS?"
            ],
            "responses": [
                "The Dean of CICS is Dr. Lorissa Joana E. Buenas."
            ]
        },
        {
            "patterns": [
                "How can I contact CICS?"
            ],
            "responses": [
                "You can contact CICS via the following:\n\nTelephone: (043) 416-0350 loc. 207\nEmail: cics.nasugbu@g.batstate-u.edu.ph"
            ]
        },
        {
            "patterns": [
                "Who is the Department Chair for ITE Programs at CICS?"
            ],
            "responses": [
                "The Department Chair for ITE Programs is Asst. Prof. Benjie R. Samonte."
            ]
        },
        {
            "patterns": [
                "What is the goal of CICS?"
            ],
            "responses": [
                "CICS aims to develop a highly dynamic, righteous, and competent pool of professionals equipped with quality education and practical training, committed to innovation, nation-building, and responding to the needs of society and the world."
            ]
        },
        {
            "patterns": [
                "What degrees can I pursue at CICS?"
            ],
            "responses": [
                "At CICS, you can pursue the following degrees:\n\n- Bachelor of Science in Information Technology"
            ]
        },
        {
            "patterns": [
                "What is CET?"
            ],
            "responses": [
                "CET stands for the College of Engineering and Technology at BatStateU ARASOF-Nasugbu. It offers programs in Computer Engineering and Industrial Technology, aiming to develop globally competitive graduates who meet local, national, and international demands for skilled professionals in the engineering and technology fields."
            ]
        },
        {
            "patterns": [
                "What programs are offered by CET at BatStateU ARASOF-Nasugbu?"
            ],
            "responses": [
                "CET offers the following programs:\n\n- Bachelor of Science in Computer Engineering\n- Bachelor of Industrial Technology Major in Electrical Technology"
            ]
        },
        {
            "patterns": [
                "Who is the Dean of CET?"
            ],
            "responses": [
                "The Dean of CET is Dr. Froilan G. Destreza."
            ]
        },
        {
            "patterns": [
                "How can I contact CET?"
            ],
            "responses": [
                "You can contact CET via the following:\n\nTelephone: (043) 416-0350 loc. 210\nEmail: ce.nasugbu@g.batstate-u.edu.ph"
            ]
        },
        {
            "patterns": [
                "Who is the Department Chair for CET at BatStateU ARASOF-Nasugbu?"
            ],
            "responses": [
                "The OIC-CET Department Chair is Engr. Romeo A. Concepcion Jr."
            ]
        },
        {
            "patterns": [
                "What is the goal of CET?"
            ],
            "responses": [
                "CET aims to develop a well-rounded graduate imbued with moral and ethical values, spiritual vigor, and utmost concern for the environment as integral parts of the furtherance of a chosen profession, and produce well-rounded and globally competitive individuals who meet local, national and international demands for skilled workers."
            ]
        },
        {
            "patterns": [
                "What degrees can I pursue at CET?"
            ],
            "responses": [
                "At CET, you can pursue the following degrees:\n\n- Bachelor of Science in Computer Engineering\n- Bachelor of Industrial Technology Major in Electrical Technology\n"
            ]
        },
        {
            "patterns": [
                "What is CONAHS?"
            ],
            "responses": [
                "CONAHS stands for the College of Nursing and Allied Health Sciences at BatStateU ARASOF-Nasugbu. It provides high-quality education in nursing, nutrition and dietetics, and public health, preparing students for leadership roles in healthcare and equipping them with practical skills to serve communities and improve population health."
            ]
        },
        {
            "patterns": [
                "What programs are offered by CONAHS at BatStateU ARASOF-Nasugbu?"
            ],
            "responses": [
                "CONAHS offers the following programs:\n\n- Bachelor of Science in Nursing\n- Bachelor of Science in Nutrition and Dietetics\n- Bachelor of Science in Public Health (Major in Disaster Response)"
            ]
        },
        {
            "patterns": [
                "Who is the Dean of CONAHS?"
            ],
            "responses": [
                "The Dean of CONAHS is Asst. Prof. Renalyn D. Malabanan."
            ]
        },
        {
            "patterns": [
                "How can I contact CONAHS?"
            ],
            "responses": [
                "You can contact CONAHS via the following:\n\nTelephone: (043) 416-0350 loc. 209\nMobile: +63 919 672 2322\nEmail: conahs.nasugbu@g.batstate-u.edu.ph\nFacebook page: https://www.facebook.com/conahs.batstateu.arasof"
            ]
        },
        {
            "patterns": [
                "Who are the Program Chairs for CONAHS at BatStateU ARASOF-Nasugbu?"
            ],
            "responses": [
                "The Program Chairs are:\n\n- BS in Nutrition and Dietetics: Asst. Prof. Rosalie R. Rojales\n- BS Nursing: Asst. Prof. Ronarica B. Diones"
            ]
        },
        {
            "patterns": [
                "What is the goal of CONAHS?"
            ],
            "responses": [
                "CONAHS aims to provide high-quality education in healthcare professions, developing students with the necessary theoretical and clinical skills. It focuses on preparing students to serve communities through leadership in healthcare practices, research, and partnerships, emphasizing moral, cultural, and legal principles."
            ]
        },
        {
            "patterns": [
                "What degrees can I pursue at CONAHS?"
            ],
            "responses": [
                "At CONAHS, you can pursue the following degrees:\n\n- Bachelor of Science in Nursing\n- Bachelor of Science in Nutrition and Dietetics\n- Bachelor of Science in Public Health (Major in Disaster Response)"
            ]
        },
        {
            "patterns": [
                "What is the CTE?"
            ],
            "responses": [
                "CTE is the College of Teacher Education at BatStateU ARASOF-Nasugbu, dedicated to preparing well-rounded educators who are equipped with technical, pedagogical, and research skills to meet the challenges of diverse educational settings. It focuses on developing competitive educators with 21st-century skills to drive positive social transformation."
            ]
        },
        {
            "patterns": [
                "What programs are offered by CTE at BatStateU ARASOF-Nasugbu?"
            ],
            "responses": [
                "CTE offers the following programs:\n\n- Bachelor of Elementary Education (BEEd)\n- Bachelor of Secondary Education major in English (BSEd English)\n- Bachelor of Secondary Education major in Mathematics (BSEd Math)\n- Bachelor of Secondary Education major in Sciences (BSEd Sciences)\n- Bachelor of Secondary Education major in Filipino (BSEd Filipino)\n- Bachelor of Secondary Education major in Social Studies (BSEd Social Studies)\n- Bachelor of Physical Education (BPEd)\n- Professional Teacher Education"
            ]
        },
        {
            "patterns": [
                "Who is the Dean of CTE?"
            ],
            "responses": [
                "The Dean of CTE is Dr. Anania B. Aquino."
            ]
        },
        {
            "patterns": [
                "How can I contact CTE?"
            ],
            "responses": [
                "You can contact CTE via the following:\n\nTelephone: (043) 416-0350 loc. 206\nMobile: +63 917 107 2200\nEmail: cte.nasugbu@g.batstate-u.edu.ph"
            ]
        },
        {
            "patterns": [
                "Who are the program chairs for CTE at BatStateU ARASOF-Nasugbu?"
            ],
            "responses": [
                "The Program Chairs are:\n\n- BEEd: Ms. Evangeline S. Barredo\n- BSEd English & Filipino: Asst. Prof. Japner Xavier L. Guevarra\n- BSEd Math & Sciences: Asst. Prof. Marilou A. Romarate\n- BPEd: Ms. Ria S. Tanglao"
            ]
        },
        {
            "patterns": [
                "What is the goal of CTE?"
            ],
            "responses": [
                "CTE is committed to providing high-quality education that equips students to excel in specific fields of interest. It focuses on creating opportunities for personal and professional growth, fostering the development of 21st-century skills, and promoting lifelong learning among its graduates."
            ]
        },
        {
            "patterns": [
                "What degrees can I pursue at CTE?"
            ],
            "responses": [
                "At CTE, you can pursue the following degrees:\n\n- Bachelor of Elementary Education\n- Bachelor of Secondary Education (with majors in English, Mathematics, Sciences, Filipino, or Social Studies)\n- Bachelor of Physical Education\n- Professional Teacher Education"
            ]
        },
        {
            "patterns": [
                "What is the mission of the BatStateU Laboratory School?"
            ],
            "responses": [
                "The mission of the BatStateU Laboratory School is to contribute to nation-building by instilling curiosity and a love for learning in every child, helping them progress into productive citizens of society."
            ]
        },
        {
            "patterns": [
                "What education levels are offered at the BatStateU Laboratory School?"
            ],
            "responses": [
                "The Laboratory School offers K-12 basic education, which includes Kindergarten 2, Elementary (Grade 1-6), Junior High School (Grade 7-10), and Senior High School (Grade 11-12)."
            ]
        },
        {
            "patterns": [
                "What strand is offered under the Senior High School Academic Track?"
            ],
            "responses": [
                "The Senior High School offers the Science, Technology, Engineering, and Mathematics (STEM) strand under the Academic Track."
            ]
        },
        {
            "patterns": [
                "What are the goals of the Kindergarten level at the Laboratory School?"
            ],
            "responses": [
                "The Kindergarten level aims to equip learners with basic skills, promote social interaction, enhance concentration and confidence, and provide play-based learning experiences."
            ]
        },
        {
            "patterns": [
                "What are the goals of the Elementary level at the Laboratory School?"
            ],
            "responses": [
                "The Elementary level aims to provide knowledge and skills in literacy, numeracy, science, technology, communication, and values formation."
            ]
        },
        {
            "patterns": [
                "What are the goals of the Junior Middle Program  at the Laboratory School?"
            ],
            "responses": [
                "The Junior High School program aims to develop cognitive and psychomotor skills, technology ethics, communication skills, leadership, and spiritual formation."
            ]
        },
        {
            "patterns": [
                "What are the goals of the Senior Middle Program  at the Laboratory School?"
            ],
            "responses": [
                "The Senior High School program focuses on strengthening cognitive and psychomotor skills, technology ethics, research, communication, leadership, and values formation."
            ]
        },
        {
            "patterns": [
                "Who is the Principal of BatStateU Laboratory School?",
                "Who is the Principal of Laboratory School at BatStateU ARASOF-Nasugbu?"
            ],
            "responses": [
                "The Principal of BatStateU Laboratory School is Dr. Jose Alejandro R. Belen."
            ]
        },
        {
            "patterns": [
                "How can I contact the Office of the Principal at BatStateU Laboratory School?"
            ],
            "responses": [
                "You can contact the Office of the Principal via the following:\n\nTelephone: (043) 416-0350 loc. 211\nEmail: labschool.nasugbu@g.batstate-u.edu.ph"
            ]
        },
        {
            "patterns": [
                "Who is the Chairperson for the Elementary level at BatStateU Laboratory School?"
            ],
            "responses": [
                "The Chairperson for the Elementary level at BatStateU Laboratory School is Asst. Prof. Lorna V. Dacillo."
            ]
        },
        {
            "patterns": [
                "How can I contact the Elementary Chairperson at BatStateU Laboratory School?"
            ],
            "responses": [
                "You can contact the Elementary Chairperson via the following:\nEmail: lorna.dacillo@g.batstate-u.edu.ph"
            ]
        },
        {
            "patterns": [
                "Who is the Chairperson for the High School level at BatStateU Laboratory School?"
            ],
            "responses": [
                "The Chairperson for the High School level at BatStateU Laboratory School is Ms. Jingle G. Guevarra."
            ]
        },
        {
            "patterns": [
                "How can I contact the High School Chairperson at BatStateU Laboratory School?"
            ],
            "responses": [
                "You can contact the High School Chairperson via the following:\nEmail: jingle.guevarra@g.batstate-u.edu.ph"
            ]
        },
        {
            "patterns": [
                "What is the official email of BatStateU Laboratory School?"
            ],
            "responses": [
                "The official email of BatStateU Laboratory School is labschool.nasugbu@g.batstate-u.edu.ph."
            ]
        },
        {
            "patterns": [
                "What is the official Facebook page of BatStateU Laboratory School?"
            ],
            "responses": [
                "The official Facebook page of BatStateU Laboratory School is https://www.facebook.com/BatStateULabSchool."
            ]
        },
        {
            "patterns": [
                "Who is the Chancellor of BatStateU ARASOF-Nasugbu?"
            ],
            "responses": [
                "The Chancellor of BatStateU ARASOF-Nasugbu is Prof. Enrico M. Dalangin."
            ]
        },
        {
            "patterns": [
                "Who is the Head of Internal Audit at BatStateU ARASOF-Nasugbu?"
            ],
            "responses": [
                "The Head of Internal Audit is Ms. Marilyn P. Tampes."
            ]
        },
        {
            "patterns": [
                "Who is the Head of Quality Assurance Management at BatStateU ARASOF-Nasugbu?"
            ],
            "responses": [
                "The Head of Quality Assurance Management is Mr. Marvin C. Hernandez."
            ]
        },
        {
            "patterns": [
                "Who is the Head of Sustainable Development at BatStateU ARASOF-Nasugbu?"
            ],
            "responses": [
                "The Head of Sustainable Development is Assoc. Prof. Lorenjane E. Balan."
            ]
        },
        {
            "patterns": [
                "Who is the Vice Chancellor for Academic Affairs at BatStateU ARASOF-Nasugbu?"
            ],
            "responses": [
                "The Vice Chancellor for Academic Affairs is Dr. Lorissa Joana E. Buenas."
            ]
        },
        {
            "patterns": [
                "Who is the Dean of the College of Accountancy, Business, Economics, and International Hospitality Management at BatStateU ARASOF-Nasugbu?"
            ],
            "responses": [
                "The Dean of the College of Accountancy, Business, Economics, and International Hospitality Management is Assoc. Prof. Mayette A. Cananea."
            ]
        },
        {
            "patterns": [
                "Who is the Associate Dean of the College of Accountancy, Business, Economics, and International Hospitality Management at BatStateU ARASOF-Nasugbu?"
            ],
            "responses": [
                "The Associate Dean of the College of Accountancy, Business, Economics, and International Hospitality Management is Mr. Marvin C. Hernandez."
            ]
        },
        {
            "patterns": [
                "Who is the Dean of the College of Engineering and Technology at BatStateU ARASOF-Nasugbu?"
            ],
            "responses": [
                "The Dean of the College of Engineering and Technology is Dr. Froilan G. Destreza."
            ]
        },
        {
            "patterns": [
                "Who is the Dean of the College of Informatics and Computing Sciences at BatStateU ARASOF-Nasugbu?"
            ],
            "responses": [
                "The Dean of the College of Informatics and Computing Sciences is Dr. Lorissa Joana E. Buenas."
            ]
        },
        {
            "patterns": [
                "Who is the Dean of the College of Teacher Education at BatStateU ARASOF-Nasugbu?"
            ],
            "responses": [
                "The Dean of the College of Teacher Education is Dr. Anania B. Aquino."
            ]
        },
        {
            "patterns": [
                "Who is the Associate Dean of the College of Teacher Education at BatStateU ARASOF-Nasugbu?"
            ],
            "responses": [
                "The Associate Dean of the College of Teacher Education is Dr. Thessa H. Noche."
            ]
        },
        {
            "patterns": [
                "Who is the Dean of the College of Arts and Sciences at BatStateU ARASOF-Nasugbu?"
            ],
            "responses": [
                "The Dean of the College of Arts and Sciences is Dr. Maria Luisa A. Valdez."
            ]
        },
        {
            "patterns": [
                "Who is the Associate Dean of the College of Arts and Sciences at BatStateU ARASOF-Nasugbu?"
            ],
            "responses": [
                "The Associate Dean of the College of Arts and Sciences is Mr. Jonas C. Villaveza."
            ]
        },
        {
            "patterns": [
                "Who is the Dean of the College of Nursing and Allied Health Sciences at BatStateU ARASOF-Nasugbu?"
            ],
            "responses": [
                "The Dean of the College of Nursing and Allied Health Sciences is Asst. Prof. Renalyn D. Malabanan."
            ]
        },
        {
            "patterns": [
                "Who is the Head of General Education at BatStateU ARASOF-Nasugbu?"
            ],
            "responses": [
                "The Head of General Education is Dr. Estilito J. Punongbayan."
            ]
        },
        {
            "patterns": [
                "Who is the Head of the Registration Services at BatStateU ARASOF-Nasugbu?"
            ],
            "responses": [
                "The Head of the Registration Services is Mr. Erwin R. Abiad."
            ]
        },
        {
            "patterns": [
                "Who is the Head of Health Services at BatStateU ARASOF-Nasugbu?"
            ],
            "responses": [
                "The Head of Health Services is Dr. Winnona Andrea Fatima P. Magahis."
            ]
        },
        {
            "patterns": [
                "Who is the Head of the Library at BatStateU ARASOF-Nasugbu?"
            ],
            "responses": [
                "The Head of the Library is Ms. Ellaine G. Lid-Ayan."
            ]
        },
        {
            "patterns": [
                "Who is the Head of Testing and Admission at BatStateU ARASOF-Nasugbu?"
            ],
            "responses": [
                "The Head of Testing and Admission is Ms. Analyn H. Venzon."
            ]
        },
        {
            "patterns": [
                "Who is the Head of On-the-Job Training at BatStateU ARASOF-Nasugbu?"
            ],
            "responses": [
                "The Head of On-the-Job Training is Ms. Leila T. Bayot."
            ]
        },
        {
            "patterns": [
                "Who is the Adviser of Student Organization at BatStateU ARASOF-Nasugbu?"
            ],
            "responses": [
                "The Adviser of Student Organization is Engr. Alfredo V. Atienza Jr."
            ]
        },
        {
            "patterns": [
                "Who is the Head of Student Discipline at BatStateU ARASOF-Nasugbu?"
            ],
            "responses": [
                "The Head of Student Discipline is Asst. Prof. Cherry U. Banta."
            ]
        },
        {
            "patterns": [
                "Who is the Head of Guidance and Counseling at BatStateU ARASOF-Nasugbu?"
            ],
            "responses": [
                "The Head of Guidance and Counseling is Ms. Analyn H. Venzon."
            ]
        },
        {
            "patterns": [
                "Who is the Head of Scholarship and Financial Assistance at BatStateU ARASOF-Nasugbu?"
            ],
            "responses": [
                "The Head of Scholarship and Financial Assistance is Asst. Prof. Rosalie R. Rojales."
            ]
        },
        {
            "patterns": [
                "Who is the Head of the Sports Development Program at BatStateU ARASOF-Nasugbu?"
            ],
            "responses": [
                "The Head of the Sports Development Program is Ms. Ria S. Tanglao."
            ]
        },
        {
            "patterns": [
                "Who is the Head of Culture and Arts at BatStateU ARASOF-Nasugbu?"
            ],
            "responses": [
                "The Head of Culture and Arts is Ms. Maria Jessica P. De Guzman."
            ]
        },
        {
            "patterns": [
                "Who is the Head of the National Service Training Program (NSTP) at BatStateU ARASOF-Nasugbu?"
            ],
            "responses": [
                "The Head of NSTP is Asst. Prof. Wilfredo U. Abellera."
            ]
        },
        {
            "patterns": [
                "Who is the Vice Chancellor for Research, Development, and Extension Services at BatStateU ARASOF-Nasugbu?"
            ],
            "responses": [
                "The Vice Chancellor for Research, Development, and Extension Services is Prof. Froilan G. Destreza."
            ]
        },
        {
            "patterns": [
                "Who is the Head of Research at BatStateU ARASOF-Nasugbu?"
            ],
            "responses": [
                "The Head of Research is Assoc. Prof. Carmina L. Caurez."
            ]
        },
        {
            "patterns": [
                "Who is the Head of Extension Services at BatStateU ARASOF-Nasugbu?"
            ],
            "responses": [
                "The Head of Extension Services is Mr. Albert V. Paytaren."
            ]
        },
        {
            "patterns": [
                "Who is the Vice Chancellor for Administration and Finance at BatStateU ARASOF-Nasugbu?"
            ],
            "responses": [
                "The Vice Chancellor for Administration and Finance is Assoc. Prof. Josephine D. Vergara."
            ]
        },
        {
            "patterns": [
                "Who is the Head of Human Resource Management at BatStateU ARASOF-Nasugbu?"
            ],
            "responses": [
                "The Head of Human Resource Management is Ms. Aimee Roxanne U. Percano."
            ]
        },
        {
            "patterns": [
                "Who is the Head of Procurement at BatStateU ARASOF-Nasugbu?"
            ],
            "responses": [
                "The Head of Procurement is Ms. Marife G. Galvezo."
            ]
        },
        {
            "patterns": [
                "Who is the Head of Property and Supply at BatStateU ARASOF-Nasugbu?"
            ],
            "responses": [
                "The Head of Property and Supply is Ms. Maybelle R. De Las Alas."
            ]
        },
        {
            "patterns": [
                "Who is the Head of Project and Facility Management at BatStateU ARASOF-Nasugbu?"
            ],
            "responses": [
                "The Head of Project and Facility Management is Arch. Lara Patricia E. Cabanillas."
            ]
        },
        {
            "patterns": [
                "Who is the Head of Budget at BatStateU ARASOF-Nasugbu?"
            ],
            "responses": [
                "The Head of Budget is Ms. Eleonor T. Laña."
            ]
        },
        {
            "patterns": [
                "Who is the Head of Accounting at BatStateU ARASOF-Nasugbu?"
            ],
            "responses": [
                "The Head of Accounting is Ms. Apple Kheer R. Chuidian."
            ]
        },
        {
            "patterns": [
                "Who is the Head of Cashiering at BatStateU ARASOF-Nasugbu?"
            ],
            "responses": [
                "The Head of Cashiering is Ms. Anna Lisa B. Villapando."
            ]
        },
        {
            "patterns": [
                "Who is the Head of General Services at BatStateU ARASOF-Nasugbu?"
            ],
            "responses": [
                "The Head of General Services is Ms. Ana Jean J. Maranan."
            ]
        },
        {
            "patterns": [
                "Who is the Head of Records at BatStateU ARASOF-Nasugbu?"
            ],
            "responses": [
                "The Head of Records is Mr. Ebenezer Joshua S. Velasco."
            ]
        },
        {
            "patterns": [
                "Who is the Head of Environmental Management Unit at BatStateU ARASOF-Nasugbu?"
            ],
            "responses": [
                "The Head of Environmental Management Unit is Mr. Juvenal R. Oriondo."
            ]
        },
        {
            "patterns": [
                "Who is the Head of Disbursing Officer at BatStateU ARASOF-Nasugbu?"
            ],
            "responses": [
                "The Head of Disbursing Officer is Ms. Ellaine L. Guerrero."
            ]
        },
        {
            "patterns": [
                "Who is the Vice Chancellor for Development and External Affairs at BatStateU ARASOF-Nasugbu?"
            ],
            "responses": [
                "The Vice Chancellor for Development and External Affairs is Assoc. Prof. Lorennjane E. Balan."
            ]
        },
        {
            "patterns": [
                "Who is the Head of ICT Services at BatStateU ARASOF-Nasugbu?"
            ],
            "responses": [
                "The Head of ICT Services is Asst. Prof. Renz Mervin A. Salac."
            ]
        },
        {
            "patterns": [
                "Who is the Head of Planning and Development at BatStateU ARASOF-Nasugbu?"
            ],
            "responses": [
                "The Head of Planning and Development is Mr. Ebenezer Joshua S. Velasco."
            ]
        },
        {
            "patterns": [
                "Who is the Head of External Affairs at BatStateU ARASOF-Nasugbu?"
            ],
            "responses": [
                "The Head of External Affairs is Ms. Maria Mariel D. Perea."
            ]
        },
        {
            "patterns": [
                "Who is the Head of Resource Generation at BatStateU ARASOF-Nasugbu?"
            ],
            "responses": [
                "The Head of Resource Generation is Ms. Monaliza C. Drio."
            ]
        },
        {
            "patterns": [
                "What is the contact number for BatStateU ARASOF-Nasugbu?"
            ],
            "responses": [
                "The contact numbers for BatStateU ARASOF-Nasugbu are:\n\n- 416-0350\n- 416-0068"
            ]
        },
        {
            "patterns": [
                "What is the local number for the Registrar’s Office at BatStateU ARASOF-Nasugbu?"
            ],
            "responses": [
                "The local number for the Registrar’s Office is 214."
            ]
        },
        {
            "patterns": [
                "What is the local number for the Library Services at BatStateU ARASOF-Nasugbu?"
            ],
            "responses": [
                "The local number for Library Services is 221."
            ]
        },
        {
            "patterns": [
                "What is the local number for the Testing and Admission Office at BatStateU ARASOF-Nasugbu?"
            ],
            "responses": [
                "The local number for the Testing and Admission Office is 216."
            ]
        },
        {
            "patterns": [
                "What is the local number for the Office of Guidance and Counseling at BatStateU ARASOF-Nasugbu?"
            ],
            "responses": [
                "The local number for the Office of Guidance and Counseling is 219."
            ]
        },
        {
            "patterns": [
                "What is the local number for the Human Resource Management Office at BatStateU ARASOF-Nasugbu?"
            ],
            "responses": [
                "The local number for the Human Resource Management Office is 402."
            ]
        },
        {
            "patterns": [
                "What is the local number for the Accounting Office at BatStateU ARASOF-Nasugbu?"
            ],
            "responses": [
                "The local number for the Accounting Office is 417."
            ]
        },
        {
            "patterns": [
                "What is the local number for the Cashiering Office at BatStateU ARASOF-Nasugbu?"
            ],
            "responses": [
                "The local number for the Cashiering Office is 416."
            ]
        },
        {
            "patterns": [
                "What is the local number for the External Affairs Office (For International Students and Alumni) at BatStateU ARASOF-Nasugbu?"
            ],
            "responses": [
                "The local number for the External Affairs Office is 504."
            ]
        },
        {
            "patterns": [
                "What is the local number for ICT Services at BatStateU ARASOF-Nasugbu?"
            ],
            "responses": [
                "The local number for ICT Services is 502."
            ]
        },
        {
            "patterns": [
                "What is the local number for Health Services at BatStateU ARASOF-Nasugbu?"
            ],
            "responses": [
                "The local number for Health Services is 215."
            ]
        },
        {
            "patterns": [
                "What is the local number for the Bids and Awards Committee at BatStateU ARASOF-Nasugbu?"
            ],
            "responses": [
                "The local number for the Bids and Awards Committee is 105."
            ]
        },
        {
            "patterns": [
                "What is the email address for the Bids and Awards Committee at BatStateU ARASOF-Nasugbu?"
            ],
            "responses": [
                "The email address for the Bids and Awards Committee is:\n\nbids.awards.nasugbu@g.batstate-u.edu.ph"
            ]
        },
        {
            "patterns": [
                "What are the contact numbers for different offices at BatStateU ARASOF-Nasugbu?"
            ],
            "responses": [
                "The contact details for various offices at BatStateU ARASOF-Nasugbu are as follows:\n\nMain Contact Numbers:\n- 416-0350\n- 416-0068\n\nRegistrar’s Office:\n- Local Number: 214\n\nLibrary Services:\n- Local Number: 221\n\nTesting and Admission Office:\n- Local Number: 216\n\nOffice of Guidance and Counseling:\n- Local Number: 219\n\nHuman Resource Management Office:\n- Local Number: 402\n\nAccounting Office:\n- Local Number: 417\n\nCashiering Office:\n- Local Number: 416\n\nExternal Affairs Office (For International Students and Alumni):\n- Local Number: 504\n\nICT Services:\n- Local Number: 502\n\nHealth Services:\n- Local Number: 215\n\nBids and Awards Committee:\n- Local Number: 105\n- Email: bids.awards.nasugbu@g.batstate-u.edu.ph"
            ]
        },
        {
            "patterns": [
                "Hi!"
            ],
            "responses": [
                "Hi! How can I help you today?"
            ]
        },
        {
            "patterns": [
                "Hello!"
            ],
            "responses": [
                "Hello! How can I assist you?"
            ]
        },
        {
            "patterns": [
                "Hey there!"
            ],
            "responses": [
                "Hey there! What can I do for you?"
            ]
        },
        {
            "patterns": [
                "Good morning!"
            ],
            "responses": [
                "Good morning! How’s your day going?"
            ]
        },
        {
            "patterns": [
                "Good afternoon!"
            ],
            "responses": [
                "Good afternoon! How can I help?"
            ]
        },
        {
            "patterns": [
                "Good evening!"
            ],
            "responses": [
                "Good evening! What can I assist you with?"
            ]
        },
        {
            "patterns": [
                "How’s it going?"
            ],
            "responses": [
                "I’m doing well, thanks for asking! How can I assist you?"
            ]
        },
        {
            "patterns": [
                "What’s up?"
            ],
            "responses": [
                "Not much, what’s up with you?"
            ]
        },
        {
            "patterns": [
                "Take care!"
            ],
            "responses": [
                "Take care too! See you next time."
            ]
        },
        {
            "patterns": [
                "Good night!"
            ],
            "responses": [
                "Good night! Have a restful evening."
            ]
        },
        {
            "patterns": [
                "Thanks for your help!"
            ],
            "responses": [
                "Anytime! I’m here for you. If you have more questions later, just pop back in!"
            ]
        },
        {
            "patterns": [
                "Thanks so much!"
            ],
            "responses": [
                "You’re very welcome! Feel free to reach out anytime."
            ]
        },
        {
            "patterns": [
                "Appreciate it!"
            ],
            "responses": [
                "No problem! Happy to help whenever you need."
            ]
        },
        {
            "patterns": [
                "That was helpful!"
            ],
            "responses": [
                "Glad to hear it! Let me know if there’s anything else I can do."
            ]
        },
        {
            "patterns": [
                "Thanks a lot!"
            ],
            "responses": [
                "My pleasure! I’m here if you have more questions."
            ]
        },
        {
            "patterns": [
                "Nice one!"
            ],
            "responses": [
                "Glad I could help! Just reach out if you need more assistance."
            ]
        },
        {
            "patterns": [
                "You’ve been really helpful!"
            ],
            "responses": [
                "Anytime! Don’t hesitate to ask if anything else comes up."
            ]
        },
        {
            "patterns": [
                "Good job!"
            ],
            "responses": [
                "Awesome! Let me know if I can help with anything else."
            ]
        },
        {
            "patterns": [
                "Thanks for answering my questions!"
            ],
            "responses": [
                "Happy to help! Feel free to check in anytime."
            ]
        },
        {
            "patterns": [
                "Nice, I got it!"
            ],
            "responses": [
                "Perfect! If you need more info, just let me know."
            ]
        },
        {
            "patterns": [
                "Bye for now!"
            ],
            "responses": [
                "Bye! Have a fantastic day! Don’t hesitate to reach out if you need anything!"
            ]
        },
        {
            "patterns": [
                "See you later!"
            ],
            "responses": [
                "Take care! I’ll be here if you have more questions."
            ]
        },
        {
            "patterns": [
                "Catch you next time!"
            ],
            "responses": [
                "Anytime! Looking forward to helping you again."
            ]
        },
        {
            "patterns": [
                "Later!"
            ],
            "responses": [
                "Later! Feel free to come back if you have more questions."
            ]
        },
        {
            "patterns": [
                "Talk soon!"
            ],
            "responses": [
                "Definitely! I’ll be here if you need any more info."
            ]
        },
        {
            "patterns": [
                "Goodbye!"
            ],
            "responses": [
                "Goodbye! Have a great day, and reach out whenever!"
            ]
        },
        {
            "patterns": [
                "I’m out!"
            ],
            "responses": [
                "No problem! Take care, and come back if you need anything!"
            ]
        },
        {
            "patterns": [
                "I’ll be back if I need more help."
            ],
            "responses": [
                "Sounds good! I’m just a message away."
            ]
        },
        {
            "patterns": [
                "Thanks and goodbye!"
            ],
            "responses": [
                "You’re welcome! Goodbye, and have a wonderful day!"
            ]
        },
        {
            "patterns": [
                "Signing off for now!"
            ],
            "responses": [
                "Got it! Just hop back in if you need more assistance."
            ]
        },
        {
            "patterns": [
                "You’re not helping me at all"
            ],
            "responses": [
                "I’m sorry to hear that! Let’s try again—I’ll do my best to help."
            ]
        },
        {
            "patterns": [
                "You don’t understand what I’m asking."
            ],
            "responses": [
                "My apologies! Can you tell me a bit more? I want to get it right."
            ]
        },
        {
            "patterns": [
                "This isn’t making sense."
            ],
            "responses": [
                "Got it, let’s try a different way. I’m here to help you understand."
            ]
        },
        {
            "patterns": [
                "Why is this so hard to get an answer?"
            ],
            "responses": [
                "I know, it can feel that way. Let’s take it one step at a time."
            ]
        },
        {
            "patterns": [
                "Nothing you’re saying is helping."
            ],
            "responses": [
                "I’m sorry about that. Could you tell me exactly what you need, and I’ll focus on that?"
            ]
        },
        {
            "patterns": [
                "I feel like you’re not listening to me."
            ],
            "responses": [
                "I hear you. Let’s go over it again to make sure I understand."
            ]
        },
        {
            "patterns": [
                "I’m getting nowhere with this."
            ],
            "responses": [
                "I know it’s frustrating! Let’s try another way to solve it."
            ]
        },
        {
            "patterns": [
                "This isn’t what I need!"
            ],
            "responses": [
                "I apologize. Let’s try to find exactly what you’re looking for."
            ]
        },
        {
            "patterns": [
                "I don’t get why this is so confusing."
            ],
            "responses": [
                "I understand. Let’s break it down together."
            ]
        },
        {
            "patterns": [
                "I’m still stuck!"
            ],
            "responses": [
                "I’m sorry you’re stuck! Let’s start from the beginning to make it easier."
            ]
        },
        {
            "patterns": [
                "I’ll just get help somewhere else."
            ],
            "responses": [
                "I understand. If you need help later, I’ll be here."
            ]
        },
        {
            "patterns": [
                "You’re not helping."
            ],
            "responses": [
                "I’m sorry it didn’t work out. I’ll be here if you’d like to try again."
            ]
        },
        {
            "patterns": [
                "This chat isn’t getting me anywhere."
            ],
            "responses": [
                "I understand, and I apologize. If you’d like to give it another go, I’m here."
            ]
        },
        {
            "patterns": [
                "I’m just going to find another way"
            ],
            "responses": [
                "You’re not giving me what I need, so goodbye."
            ]
        },
        {
            "patterns": [
                "You’re not giving me what I need"
            ],
            "responses": [
                "Understood. I’m here if you need me later."
            ]
        },
        {
            "patterns": [
                "This isn’t helpful; I’m out."
            ],
            "responses": [
                "I’m sorry it’s been frustrating. I’m here anytime you need assistance."
            ]
        },
        {
            "patterns": [
                "This is just a waste of my time."
            ],
            "responses": [
                "I apologize for that. If you need help down the line, don’t hesitate to reach out."
            ]
        },
        {
            "patterns": [
                "I’ll figure it out myself."
            ],
            "responses": [
                "Got it. Feel free to return if you need help."
            ]
        },
        {
            "patterns": [
                "This was pointless."
            ],
            "responses": [
                "I understand, and I apologize for the experience. I’m here if you change your mind."
            ]
        },
        {
            "patterns": [
                "You’re not helping at all."
            ],
            "responses": [
                "I’m sorry for that. Let me know if you’d like to try again anytime."
            ]
        }
    ]
}